{
  "1569": {
    "data": {
      "url": "https://support.google.com/pixelphone/thread/111153276/google-feedback-system?hl=en",
      "title": "Google feedback system",
      "content": "I would like to bring to your notice that Google Play services does not support image pasting while sharing feedback of Google apps or sending feedback about the device or Google products. I would like to suggest to give software update where in Google play services supports image pasting and also a option to upload image while sharing a feedback of Google apps or Google products and also while sending feedback about Google apps and Products. As it will be convenient and easy to understand and  analyse the feedback given by the user  for the issue's faced  or some new brilliant suggestions ideas for google products and Google apps with the help and support  of image or image pasting options.",
      "is_img": 0,
      "category": "Other, Google Pixel 4a (5G)",
      "post_time": "2021-05-25T15:23:38.235138+00:00",
      "reply": "3 Replies"
    },
    "label": {
      "label1": "I would like"
    }
  },
  "776": {
    "data": {
      "url": "https://support.google.com/pixelphone/thread/113248177/i-am-having-issues-trying-to-figure-out-how-to-activate-visual-voicemail-and-wifi-calling?hl=en",
      "title": "I am having issues trying to figure out how to activate visual voicemail and wifi calling.",
      "content": "I'm trying to activate visual voicemail and Wi-Fi calling can you help me with that issue?",
      "is_img": 0,
      "category": "Contacts, Calls, Voicemail, Google Pixel 4 XL",
      "post_time": "2021-06-11T22:49:47.881344+00:00",
      "reply": "2 Replies"
    },
    "label": {
      "label1": "I'm ........"
    }
  },
  "21635": {
    "data": {
      "url": "https://support.google.com/pixelphone/thread/17676600/now-resolved-google-chrome-will-not-update-to-the-latest-version-on-pixel-4-how-do-i-fix-this?hl=en",
      "title": "*Now resolved* Google Chrome will not update to the latest version on Pixel 4...how do I fix this?",
      "content": "*Now resolved - Problem seems to have fixed itself and the app updated overnight.*\n\nHaving an issue where Google Chrome will not update on my Pixel 4 XL.\n\nIt downloads, goes to the installing stage and sits there.\n\nI've tried a number of times in the last 24 hours, even disabled chrome and rebooted the device etc but nothing.\n\nAnyone else having this issue and resolved it?\n\nCheers",
      "is_img": 0,
      "category": "Device Performance, Google Pixel 4 XL",
      "post_time": "2019-10-25T10:18:56.60317+00:00",
      "reply": "1 Recommended Answer"
    },
    "label": {
      "label1": "Having an issue where Google Chrome will not update on my Pixel 4 XL."
    }
  }
}