{
    "url": "https://support.google.com/pixelphone/thread/14564890/adding-esim-to-pixel-3a?hl=en",
    "title": "Adding eSIM to Pixel 3a",
    "content": "I have a Pixel 3a XL. Glad that DSDS was activated/ official for Pixel 3a series. After updating to Android 10 on release day, I tried to add esim to my phone to use 2 SIMs. \n\nOK, I tried using an esim from a carrier that specifically stated that they did not guarantee their eSIM will work with Pixel phones as they only supported the fruit phones. So with that in mind, I went ahead nevertheless and obtained the eSIM QR code from the carrier (\"Carrier 1\"). Followed the usual process to add eSIM: -\nSettings -> Network & Internet -> \"+\" Mobile Network -> \"Don't have SIM card\" -> \"Checking network info...\" -> camera automatically fired-up to scan the given QR code;\nscanned the QR code of Carrier 1; and\nreceived error message \"Networks not activated\".\n\nOK, fine.... Carrier 1 already said they did not guarantee their eSIM will work on Pixel.\n\nAnd after some forum discussions with fellow users in the same country who succesfully added esim to their Pixel 3 (not 3a) using other carriers who also specifically stated that they only supported the fruit phones, I decided to instead try another carrier's eSIM (\"Carrier 2\").\n\nPrior to trying to Carrier 2, these were the intervening matters: -\nnetwork settings (only) were reset, including checking the box to reset \"downloaded sims\"; and\nupdated apps - including \"SIM Manager\" by Google [current version D.1.5.73-google (5793666)].\n\nSo went to Carrier 2's store and requested their eSIM. Again, followed the usual process to add eSIM: - \nSettings -> Network & Internet -> \"+\" Mobile Network -> \"Don't have SIM card\" -> \"Checking network info...\" -> \ncamera DIDN'T fire-up at all to scan the given QR; and\nreceived error message \"Networks not activated\".\n After, the above, I reset the phone back to factory settings and tried again. Same result as per trying to add Carrier 2's eSIM above. NOT EVEN a chance to scan the QR code and was again and again informed \"Networks not activated\"...\n\nWhat seems to be the problem? Could it be the \"SIM Manager\" app's latest update?\n\nThanks in advance.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a XL",
    "post_time": "2019-09-17T04:09:50.710767+00:00",
    "reply": "1 Recommended Answer"
}