{
    "url": "https://support.google.com/pixelphone/thread/17593576/very-disappointing-customer-service-for-pixel-3-replacement?hl=en",
    "title": "Very disappointing customer service for Pixel 3 replacement",
    "content": "My Pixel 3 developed an issue with the camera in that the picture would shake while the camera was active and the device was moved, as though there was a loose component within the camera enclosure. I was advised to send the device in to receive a replacement, being informed that the process would take 5-10 business days. I packaged my phone and sent it, and it was confirmed as received.\n\nWe are 16 business days down the line, and I had to get in touch myself twice before I was told that there were supply problems with replacement devices and nobody could tell me when a replacement device would even be available, let alone shipped. I was disappointed with the customer service and wished to complain, but I was once again told that \"someone would get in touch via email within 24-48 hours\", which is what I was told previously before nobody got in touch at all.\n\nIncredibly frustrating customer service for what was a minor issue with the phone. I use the phone for work, and if I'd known there were supply problems I wouldn't have sent the phone in at that time, especially having planned for 10 business days without it at worst seeing as that was what I was told. I have been using Google-branded phones since the Galaxy Nexus, but unfortunately I'll now have to avoid them in future and warn others off them if this is typical customer service.\n\nAt this point I'd actually just accept having my faulty phone sent back to me, but nobody in customer service seems to be taking my concerns seriously or seems to be erecting barriers to me complaining about the replacement process. All I have is the Send Feedback link at the bottom of the Google search page and this forum. Buyers beware, presumably there will be similar issues with the new Pixel 4 given that it will be the same standard of customer service.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-10-24T11:19:42.991406+00:00",
    "reply": "4 Replies"
}