{
    "url": "https://support.google.com/pixelphone/thread/1455840/has-anyone-else-had-a-bad-experience-with-the-support-team?hl=en",
    "title": "Has anyone else had a bad experience with the Support Team?",
    "content": "My camera is faulty (keeps flickering in both camera and video mode) so I contacted support. After going through all the troubleshooting steps including a factory reset, the problem persisted. I had the problem from the start but assumed it was a software bug that would be fixed in an eventual update. \n\nI contacted google support and so far it has been a nightmare, to the point that it has shaken the little trust I had left in the company. For background,  I bought the device from the Google Store online on the first day of release and paid full price. I have been a \"fanboy\" for years and have gone through nearly every iteration of Nexus and Pixel phones not to mention all the other google devices I own. \n\n27 emails and 3 support agents on the phone later and still I am getting the runaround. They are refusing to replace the device with a new device. I paid FULL PRICE for this phone and after a few months of use I would expect it to be replaced with a NEW device. I am only being offered a refurbished device.\n\nI get that the refurbished devices go through testing but I am not interested in getting something that was previously owned and returned when I paid a premium amount for a \"premium\" phone. \n\nAll I am getting is the same copied and pasted text from the support team - even after escalation. I called this morning and was connected with an AUSTRALIAN support specialist (I am in the US and bought the phone here). He then had to transfer me to a US specialist who then had to transfer me to a supervisor.  None of them have any real authority and kept to the script. \n\nI am at my wit's end. I don't know what to do any more other than to make good on my threat to switch to Apple which I have been considering for a while. \n\nAny ideas?",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-02-04T17:45:39.295459+00:00",
    "reply": "1 Recommended Answer"
}