{
    "url": "https://support.google.com/pixelphone/thread/27062291/help-pixel-3-rma-10-day-sla-delays?hl=en",
    "title": "HELP! Pixel 3 RMA - 10 day SLA delays",
    "content": "Hi team\n\nBEFORE CONTINUING, PLEASE READ THIS EXTRACT FROM MY MOST RECENT CHAT WITH GOOGLE SUPPORT:\n\nSteve\n2:41 pm\nplease tell me what i can do to get my phone back\n\nSteve\n2:41 pm\nyou realise it feels like google have actually robbed me here?\n\nSteve\n2:41 pm\nyou took my money for a phone, then you took the phone back\n\nSteve\n2:42 pm\nand left me with nothing\n\nSteve\n2:42 pm\nit feels horrible\n\nSteve\n2:42 pm\nI'm actually helpless\n\nGoogle support\n2:42 pm\nThanks for contacting Google. It was a pleasure to assist you. Have a Nice day!\n\nGoogle support\n2:42 pm\nThank you for contacting Google Hardware chat support. Your chat session is now complete.\n\nTHAT IS THE LEVEL OF SERVICE I HAVE BEEN DEALING WITH! THE BACK STORY:\n\nThe power button on my Pixel 3 stopped working. I contacted Pixel support, who said they would repair/replace, and the whole process would take less than 10 days via RMA process.\n\nI made absolutely clear that I need the phone back by *30th Jan*, as I would be away travelling for a month. They assured me I'd receive a replacement within 10 days of sending the phone.\n\n- I sent the phone on that day (19th).\n- It arrived less than 48hrs later in the Poland factory.\n- Since then - nothing!\n- I am now on my 10th day (29th), and still have NO INFORMATION.\n- If the phone does not arrive in next 48 hours, I am going to have serious problems as it will mean being without my smart phone for over a month while travelling\n\nI have contacted Google support multiple times.  All I keep being told is:\n- They understand\n- They are checking with the specialist team\n- They are waiting for the specialist team to respond\n- There is nothing more they can do\n\nThe timeline has also changed multiple times:\n- 5 to 10 days\n- 10 to 14 days\n- Up to 10 business days\n- Definitely soon\n\nI AM NOW BEING TOLD GOOGLE CANNOT PROMISE MY PHONE WILL BE DELIVERED WITHIN THE 10 DAY LIMIT\n\nIf there was a chance a replacement would not be received by 30th January, I never would have sent the phone for repair. \n\nI have been patient.\nI have been friendly.\nI have not been aggressive.\nI have not been rude.\nBut...\nI have begged.\nI have pleaded.\nI have offered my services in any way possible to help ensure this gets resolved.\n\nBut still no replacement phone has been arranged.\n\nPLEASE CAN SOMEONE KINDLY UNDERTAKE WHATEVER ACTION IS NECESSARY TO ENSURE I GET A PIXEL 3 PHONE WITHIN NEXT 48 HOURS\n\n- Dispatch it today with 24hr delivery\n- Send me cash to buy a replacement myself\n- Whatever else it takes\n\nPLEASE HELP ME!\n\n\nThank you\n\nCASE IDs:\nRMA02586794\n0-0304000029714\n0-9901000029682\n9-0508000029289\n1-8652000029123\n6-9725000029055\n9-3623000029270",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-01-29T14:40:26.454389+00:00",
    "reply": "4 Replies"
}