{
    "url": "https://support.google.com/pixelphone/thread/89132433/bought-used-pixel-4-and-apparently-it-s-got-a-known-issue-of-incorrectly-being-locked-to-xfinity?hl=en",
    "title": "Bought used Pixel 4, and apparently it's got a known issue of incorrectly being locked to Xfinity.",
    "content": "Hi,\n\n  I purchased a used Pixel 4, GSM unlocked.  In a complete coincidence, I was planning on transferring my number over to Xfinity Mobile.  I attempted to do so after verifying on the Xfinity site that my IMEI was compatible with their network.  Ported the number, but the service did nothing since I bought a GSM phone and Xfinity is CDMA.  After the days it took to figure that out, I then ported that number over to Cricket since they're GSM.  Successfully ported the number, I guess, but the phone still says \"SIM card isn't supported. Ask Xfinity Mobile if this device can be unlocked.\"  I have spent hours with Xfinity Mobile veryifing that the phone is not locked, not was ever locked by them.  They stated the issue has to be with my new carrier Cricket.  Cricket states everything is good on their end, active phone number, no issues, and that since every time I insert the Cricket SIM it states to check with XFinity to unlock, it must be XFinity's fault.\n\nI've tried a hard factory reboot, and it still gives me the Xfinity message with no service.\n\nA quick google, and it shows many people purchased unlocked Pixel 4 phones directly from Google only to have them show up locked to XFinity.  Google recognized the issue and sent them new phones, and many people received another phone with the same issue. There are multiple threads on Reddit about this, and even an article on 9to5google specifically about the Xfinity locked Pixel 4 issue.\n\nConsidering Xfinity has verified multiple times the phone was never locked by them, and even a hard reboot doesn't stop if from saying it's XFinity locked, does it sound like I got one of these phones?  If so, buying it used and having spend 30 days troubleshooting this, is there any chance Google will take responsibility for a known error if it's on a used phone?\n\nThanks in advance.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4",
    "post_time": "2020-12-17T16:59:07.087348+00:00",
    "reply": "1 Recommended Answer"
}