{
    "url": "https://support.google.com/pixelphone/thread/110807291/control-over-own-phone-google-pixel-vs-samsung-galaxy?hl=en",
    "title": "Control over own phone: Google Pixel vs. Samsung Galaxy",
    "content": "I am a Samsung Galaxy user who has gotten increasingly mad at Samsung over years about the phone doing more and more its own thing without me as the owner having any control.\n\n[TINY RANT START] The last drop was when I was getting daily notifications to migrate from Samsung Cloud to One Drive, even though I had nothing in Samsung Cloud, nor I wanted to have to do anything with either of them. The notifications were saying they would end from March 31. Nopes, in April that got an extension to April 30. Disabling those things from pinging me daily was a disabled option in the settings. So that's it, I decided that I needed to move off somewhere where I get more control. [TINY RANT END].\n\nHere, I would like to ask and get answers about a few basics about Google Pixel, as I consider getting the Google Pixel 6 later this year. Please, go sensitive about the below things, as they had been quite some pain points for me in the last few years:\n\nSometime in 2017/18, Samsung Galaxies started randomly requiring pin check to unlock instead of biometrics, for security purposes they say. One would argue that this wasn't random, but that's how it feels to me. Does Google Pixel enforce things like that, or can the user set up to always unlock the phone with biometrics, and only need a pin verification when the biometric check fails enough times? That's a selling point for me.\nSometime in 2019, some parts of Samsung Health didn't want to work anymore without having access to my contact list. That was when I emptied my contact list in order to use all of the Samsung Health. Does Google Fit exercise similar behavior?\nAlso, Galaxy Store started requiring access to my contact list in order to update the apps. That is just bonkers, but luckily I had already wiped my contact list and the phone remained 'functional' in the sense that Samsung apps could get an update. Does Google Pixel exercise any similar behavior of asking for unreasonable things (e.g., my contact list) in order to provide basic functionality, such as updating the apps?\nSometime in 2021, Samsung Health didn't want to work anymore without 2FA. That is how I lost access to my Samsung Health. Does Google Fit do the same? In general, how is enforcing 2FA bad at Google Pixel? A phone that lets me choose 2FA or not is a selling point.\n\nHope this wasn't too painful to read. Thanks in advance for telling me how those points work out on Google Pixel!",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device",
    "post_time": "2021-05-22T15:56:09.69244+00:00",
    "reply": "1 Reply"
}