{
    "url": "https://support.google.com/pixelphone/thread/39800880/why-did-my-pixel-3a-partially-reset-itself-with-more-issues-as-described?hl=en",
    "title": "Why did my Pixel 3a partially reset itself? (With more issues as described)",
    "content": "I picked up my phone from my pocket earlier today, and as I did, it appeared it had just restarted itself. However, as soon as I unlocked it and felt it vibrate, I realised it had done something more that just restart.\n\nIt appeared that the phone reset its settings to default - i.e. all phone settings were as when started for the first time, with haptic feedback and certain system sounds on (which I had otherwise disabled), dark mode off (which I had enabled), the default quick setting icons under the navigation bar present (which I had adjusted), and so on. It had not, however, removed or reset any network settings (saved wifi networks were still there, as were my recently customised APN settings).\n\nWhile the settings could of course have been re-adjusted, unfortunately some major bugs appeared as well. I observed the following:\n * Home button and app switcher button did not work (but back button did)\n* Notification bar was only expandable one step, i.e. able to reveal the quick setting icons but not expand one step further as required to, for example, get the notification cogwheel icon and ability to adjust the quick setting icons\n* A blank space where the search bar in settings is supposed to be\n* Was not able to turn mobile data on (switch could be tapped, but after backing out from mobile network settings and going back again, it was switched back off)\n\nIt did not seem to affect any apps, as they were all functioning as normal and had no loss of settings or other data (to my knowledge). Safe mode did not resolve the issue. There was a small system update available (security patch), which was installed but did not resolve the issue.\n\nAs I didn't have the patience to await any response to this query, I did a factory reset before exploring any other aspects than what is described above. After that, I could immediately get a mobile data connection (during setup, even), and everything else seems to work. But the issue should be reported regardless so it can be discussed! Has anyone else experienced this? What may have caused it?",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2020-04-13T15:17:05.915229+00:00",
    "reply": "3 Replies"
}