{
    "url": "https://support.google.com/pixelphone/thread/54124732/music-files-streaming-file-transfer-lots-of-questions?hl=en",
    "title": "Music Files, Streaming, File Transfer, Lots of Questions",
    "content": "I just got phone. Unable to transfer files via cable from my linux pc to phone. I have developer mode turned on and USB set to allow transfers. When I connect cable it makes a sound, but I don't get notification screen asking if I want to charge or transfer files.  My pc doesn't see my storage on the phone and the other way around as well.\n\nI also heard google thinks people will stream the music the play. Well OK, provided I can store some locally when not online or having to use mobile service. All I can see is to install Play Manager. I did and it wants me to set up an account for what appears to be a for pay service, although I get a free trial. If I have to pay for the service to access or upload my files I don't quite see how this is free. The app is.\n\nHere is what I wrote when I asked googles automated help didn't answer my question and I responded that it didn't:\n\nI installed music manager.  It appears to be a free trial for a paid service or something. I have plenty of music files. I don't want a service to select and provide music. I just got a pixel phone. I read something about Google expects people wii store music in cloud and it will be streamed from there. Coupled with Google Fi wifi service this made some sense if I could limit file transfers or streaming to only when wifi is available. As wifi is not likely available sometimes when on a long highway drive I assumed it would store a good selection of music locally on the phone.  For people like me who mainly want to play in random play mode if it could be set up to transfer and move files around from the cloud to local when wifi is connected automatically to keep a fresh set of random songs. My pixel only has internal memory, 64GB, somewhat less is actually available, the OS and apps will take up another 6 to 10 GB.  That may be about the size my total collection is.  That doesn't leave any room for much data on or other stuff stored locally.\n\nI picked this phone on the basis of reading it seamlessly meshes with wifi networks and you can store music (I read unlimited) in the cloud on Google Play. I figured somehow you had figured out a way to save and rotate a good deal of songs stored locally. Now that I actually have the phone I don't see much on how to do this other than install the play manager, which sure looks like an for pay service.  That isn't free.\n\nI also haven't figured out yet how to get the USB charge notification to pop up when I connect to USB. I use a linux PC. It worked fine in my most recent android phones.  I don't know what's up with the Pixel.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2020-06-18T02:56:28.141471+00:00",
    "reply": "0 Replies"
}