{
    "url": "https://support.google.com/pixelphone/thread/20605299/worst-customer-support-i-have-ever-experienced?hl=en",
    "title": "Worst customer support i have ever experienced",
    "content": "I am facing charging issues with my pixel 3 device. It's been around three weeks since i registered a complaint for this and still i haven't even received any information about what will be the next step. I am never going to buy google devices again and recommend same to others.\n\nBelow is the mail chain with customer care executive:\nHi Mohit,\nThanks for contacting Google Support. \nWe're looking into this issue and we will update you as soon as we have determined the next steps or have more details.\nI may be in touch to request more information about this issue.\nI really appreciate your continued patience and cooperation as we work to resolve this situation.\nThanks!\nJeff F\nThe Google Support Team\nGoogle Help Center\n© Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA\nI haven't received any update from you, this kind of service is not expected from Google.\nShow quoted text\n Hi Mohit,\nThank you for contacting Google Support.\nI really appreciate your time and patience while checking with my specialist team.\nOur specialist team are still working on your case and I'll get back to you as soon as I've an update form our concerned team via email at the earliest.\nThank you for your understanding and cooperation as we work together as team to resolve this issue.\nThanks!\nJeff F\nThe Google Support Team\nGoogle Help Centre\n© Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA \n Hi Mohit,\nThank you for contacting to Google Support.\nI do understand that it's not quite the best feelings to wait for a long time. \nI'm following up with my specialist team on a regular basis and have updated them with each and every detail provided by you. I'm still awaiting a response from them. Please be assured, I've forwarded  this request on priority. \nI'll update you as soon as I have more details from my team. Trust me, I'm trying to the best of my abilities to help you with this.\nYour patience would be much appreciated while we look into this further.\nHide quoted text\nThanks!\nJeff F\nThe Google Support Team\nGoogle Help Centre\n© Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA \n Hi Mohit,\nThank you for contacting to Google Support.\nI've checked with my specialists team and upon investigating this further please shipping address of current residence.\nAwaiting your response.\nHide quoted text\nThanks!\nJeff F\nThe Google Support Team\nGoogle Help Centre\n© Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA \nCurrent shipping address:\n\n2 Gortlee, Gortlee Road, F92V3AX\nLetterkenny, Donegal\nIreland\nHide quoted text\n\nOn Tue, 12 Nov, 2019, 7:52 pm , <store-support@google.com> wrote:\n Hi Mohit,\nThank you for contacting to Google Support.\nI've checked with my specialists team and upon investigating this further please shipping address of current residence.\nAwaiting your response.\nThanks!\nJeff F\nThe Google Support Team\nGoogle Help Centre\n© Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA \nPlease share email Id or contact details of your senior, my phone is almost unusable and it's been more than 10 days of registering request with you. \nThis type of service is not expected from company like Google. Apple and Samsung would have given me a new phone in this much time.\nShow quoted text\n Hi Mohit,\nThanks for contacting Google support! \nThis is Abraham, one of the floor supervisors and I'm happy to help you! \nFirst of all, I'd like to apologize for the delay in getting back to you and the moment I got your case assigned to me, I was checking on this with our Internal team to get this sorted. \nHowever, I see that we'd need our Internal team to look into this case and being a supervisor you can be assured that I'm now working on this case with our Internal team closely. \nI'll keep you posted the moment I get any update on this case. \nOnce again, I apologize for the delay and appreciate your cooperation \nThanks!\n\nAbraham\nThe Google Support Team\nShow quoted text\nHi Abraham,\n\nIt's been more than 2 weeks and i still don't have any information about what will be the next step, this phone is almost unusable, i need to hold charging port to charge the device, same issue with headphones also, this is very frustrating.",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-11-20T16:17:32.581931+00:00",
    "reply": "0 Replies"
}