{
    "url": "https://support.google.com/pixelphone/thread/6963778/pixel-1-freezes-and-shuts-off-even-with-full-battery?hl=en",
    "title": "Pixel 1 freezes and shuts off even with full battery",
    "content": "My Verizon pixel 1 has been fine for years, but the past few weeks it has been shutting off. I'm an advanced user and have tried almost everything. \nHere's an outline of steps I've taken.\n\n-Initially had Q beta operating system installed.\n-phone ran fine with typical glitching for months.\n-Rolled back to 9 factory reset using GUI and beta opt out.\n-Issue still occured.\n-Factory reset to 9 again using bootloader\n-Issue still occured.\n-This issue still occured even before restoring account on both tries.\n-the shut off is very random and can be severe where my phone will not boot at all. I have to give up and then it magically boots.\n-So to clear up confusion I didn't restore my original account and used a clean slate account for backup on my next factory reset to 9. \n-it was fairly stable, but eventually did the same issue. Even the periodic severe boot loop.\n-so I decided to jailbreak my phone and roll back to the last 7 nougat build thinking my firmware may be corrupt.\n-my phone runs much better now and has only done the freeze crash twice.\n\nOverall, I'll probably get a new phone at this point so I can have warranty coverage, but this is extremely disappointing due to the fact that I'm seeing newer models with the same issue.\n\nOdd details, my phone froze when it was showing the charging screen even when the phone was off. \nDuring the shut offs weird pixel glitches showed on screen followed by a bright flash on the screen.\nThe bright flash occurs during all crashes, but not the glitches. \nMy final verdict is that there is something Google is doing on the back end beyond security updates and patching that is damaging hardware. Most likely pushing the phones too hard and the damage is permanent. This is the only logical way I can see this problem happening across all devices",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-05-28T18:32:12.935394+00:00",
    "reply": "1 Reply"
}