{
    "url": "https://support.google.com/pixelphone/thread/4276522/need-to-know-why-the-process-of-detecting-devices-on-a-network-has-changed-and-how-i-can-solve-it?hl=en",
    "title": "Need to know why the process of detecting devices on a network has changed, and how I can solve it.",
    "content": "I have a network setup (a digital audio mixer attached to a wireless router through ethernet cable, i do NOT need internet access on this router's network, it just allows me to control the mixer wirelessly from my pixel 2 (Android 9, latest update) or any other android/ios/pc/mac device that can connect to the router's wi-fi with help from the mixer's android/ios/pc downloadable app). Again I DO NOT and WILL NOT have any internet access with this network because it is not needed.\n\nHere is my issue: when I connect to the network's wi-fi from my PIXEL 2, I type in the password and it connects to the network fine, but it does not recognize the device (mixer) on the network UNTIL I press \"yes\" when it asks if I want to \"stay connected to the network since it does not have internet access?\". That wouldn't be an issue, but when i disconnect the PIXEL 2 from the wireless network or the connection is interrupted, I will connect to the saved network for the second time but the notification for \"stay connected?\" never pops up, EVEN THOUGH I left the box for \"don't ask me again for this network\" UNCHECKED because I WANT it to ask again. It seems the PIXEL 2 does not look for devices on the network until AFTER I hit \"yes stay connected\", however when I connect to the network using my NEXUS 5X running android lollipop, it recognizes the device on the network RIGHT AWAY before the \"stay connected?\" notification even pops up. This is how I KNOW it is an issue with the PIXEL 2 SPECIFICALLY. Either that or there was a change to exactly WHEN android recognizes devices on a network that is not connected to the internet. (The Pixel 2 on Pie recognizes devices AFTER I hit \"yes stay connected\" as opposed to the nexus 5X on lollipop recognizing it BEFORE the pop up.) All I want is for the PIXEL 2 to do what my nexus 5X does. Look for devices BEFORE the \"stay connected?\" screen. Either that or actually ask me everytime I connect to the SAVED network. I was not able to get help from Pixel support and it should not matter that my mixer is a third party product because it is just a device with an IP address connected to the router through an ethernet cable and this all works like it should only on the PIXEL 2 I keep having to \"forget\" the network and reconnect with the password to get the \"stay connected?\" notification to pop up so I can hit \"yes\" and it finally will recognize the devices on the network. Both Google PIXEL and NEXUS 5X can see the device, but the Nexus 5X sees the devices on the network BEFORE it asks me to \"stay connected?\", while the pixel looks for it AFTER I hit \"yes\" which is a problem because it only asks me when I connect for the first time, never again unless I \"forget\" the network and start over. I would SO GREATLY appreciate some info on why this is an issue on the Pixel 2 and not the Nexus 5X, it is the same OS (stock android), just a different version. AHHH PLEASE HELP",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-04-16T07:02:15.951639+00:00",
    "reply": "1 Recommended Answer"
}