{
    "url": "https://support.google.com/pixelphone/thread/23469665/awful-and-inconsistent-customer-service?hl=en",
    "title": "Awful and Inconsistent Customer Service",
    "content": "My son performed a software update to his Pixel 3.   Received a black screen the next morning. \nUsing the power and volume down button I was able to perform a hard reset on the device and got it to power up.  However, after a few hours, the phone shut down again.  I could not get the phone to restart via all the youtube tricks.  \n\nI brought the phone to ubreakifix, thought it may be the battery?!?.   After 3 days ubreakifix could find nothing wrong with the hardware on the phone.  \n\nOn December 18th, I contacted Pixel support via Chat w Angel S.  I had to exit the chat (for work) before resolution and Angel S finished the chat off with an long email basically explaining how to plug in the pixel.  \n\nOn December 19th, I recontacted PIxel support via Chat w Sam.   I ran through all the same steps, and Sam told me I should bring the phone to ubreakifix.  I explained I already had.  Sam's repsonse?  I should bring the phone to ubreakifix.  After many heart felt apologies from Sam,  his only response was to inform me I should take the phone to ubreakifix.  I asked to speak w a supervisor.  He informed me that could not call back but a supervisor would email me.  I also asked and was given the call in 800 number for google support.\n\nI called the google support and spoke with a lady.  I did not get her name.  She OF COURSE, said I need to bring the phone to ubreakifix.  I explained I already had.  She said she needed the ubreakifix location information and would need to verify and get then approval from her supervisor if my information was accurate.   About 10 minutes later, the rep called back and said she had approval from her supervisor and needed the ship to information etc for the replacement phone.  Hooray!   I gave her all the information and disconnected.\n\nAbout two hours later I receive an email from LARRY @ Google Support.  Larry's suggestion was.....bring it to UBREAKIFIX.....\n\nOn December 20th, I realized it was possible that Larry had overridden the previous replacement authorization.  So once again I called customer support.  And received,  let me check the notes....you need to bring it tooo.....yeahp UBREAKIFIX.   According to Google they had no notes anyone from Google authorizing a replacement.\n \nThis is enough for me to quit Google forever.  Awful awful customer service.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-12-21T16:33:28.351193+00:00",
    "reply": "1 Reply"
}