{
    "url": "https://support.google.com/pixelphone/thread/78356704/pixel-4xl-screen-not-working-and-support-cannot-find-the-info-on-the-imei-for-warranty-replacement?hl=en",
    "title": "Pixel 4XL Screen not Working and Support cannot find the info on the IMEI for Warranty replacement.",
    "content": "I have been having a horrible time with Pixel support for over a week now. Tuesday October 13th my Pixel 4XL screen started flashing, after about 10 minutes it began only displaying green and within an hour it stopped displaying altogether. I went to the Pixel support site and the only option was to place my number on the call waiting list. Shortly after I got a call and then was placed on hold for two and half hours, not sure why I placed myself on the list to be called when they were just going to put me on hold, but that is what happened. I finally got connected with an agent who informed me that he was unable to find any information on my IMEI and placed me on hold to check into the issue further. I bought the phone second hand, so I had already checked Google’s site to ensure that it was an authentic Pixel. After spending another half hour on hold I was getting aggravated and asked for the agent’s supervisor, at which point I was hung up on. When I went back to the support site chat was no longer disabled so I began a chat with support. I spent another 2 hours being placed on 3 minute holds after every interaction and either the support agent was a bot or they were copy and pasting the same 4-5 responses over and over\n\n-        Please allow me 2-3 minutes more to check for the information.\n-        Thank you for waiting.\n-        I have escalated this case to my higher support.\n-        They will get back to you via email within 24 hours.\n  After calling the support agent out for this they continued to say the same thing until they closed the chat. The next evening, I finally heard back via email from a floor supervisor who promptly did nothing but transfer me to yet another person who has done nothing but send me information on uBreakiFix. I’m extremely disappointed in this entire experience. The Pixel 4 was release less then a year ago and therefor the device has to be under warranty, the company is just refusing to provide replacement/repair. The device is in pristine condition, no cracks, and has never been dropped.",
    "is_img": 1,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-10-21T18:47:19.12036+00:00",
    "reply": "4 Replies"
}