{
    "url": "https://support.google.com/pixelphone/thread/8695120/my-terrible-experience-with-google-support?hl=en",
    "title": "My terrible experience with Google Support",
    "content": "I have been a loyal Google user for a long long time. Every phone I have owned has been a Google phone. I use a lot of their other hardware - Chromebook, Nest, Nexus Player...even Google Glass :) I am a die hard user of their software - Gmail, Maps, Drive, Keep, Play...you name it. I am even an avid contributor on places like Google Reviews and Google Local Guides.\n\nBut my recent experience with Google Support has left me completely disenchanted with Google.\n\nMy issue was a Pixel (1 XL) phone that went into a bootloop and the died. It was roughly a year and a half old. So out of warrantly. But this was the 2nd Google phone in a row that had done this. The previous phone was also a year and half old too when it died. So I called Google support about a couple of weeks ago. After I explained my situation, they agreed to escalate the issue to see if I could get a replacement phone even though it was out of warranty. That's where my saga began.\n\nI was told a supervisor would call me in 30 mins. Never did.\nSince then I have chatted/talked on the phone with them 4 separate times. Each time the support person tells me that issue is still open but they don't know the exact status since it's with another supervisor. Each time I am told they will put a note and that I will receive a call within 24 hours. But every time I never hear back. This has been going on for 2 weeks now.\n\nI would have been totally ok if they had gotten back to me in a timely manner without giving me the run around and told me that they couldn't replace the phone cos it was out of warranty (unhappy but still ok)\nBut at this point this has started to feel like one of those Comcast support horror stories or a SNL skit.\n\nGoogle just lost a loyal customer cos of their support. I realize it won't be realistic to diconnect from stuff like Maps & Gmail. But no more new Google hardware or stuff like Reviews/Guides etc for me.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-06-25T17:09:42.915448+00:00",
    "reply": "1 Recommended Answer"
}