{
    "url": "https://support.google.com/pixelphone/thread/7791170/introducing-time-lapse?hl=en",
    "title": "Introducing Time Lapse",
    "content": "Hey Pixel fans,\n\nThe long-awaited Time Lapse feature is now available to all Pixel devices running Google Camera version 6.2.030! Time Lapse allows you to create cinematic, sped-up videos of things such as sunsets, traffic, flying on an airplane, your kids playing soccer, etc.\n\n\n\nRecording Time Lapse is simple:\n\nOpen the Google Camera\nGo into “More” and find “Time Lapse”\nSelect a speed of how fast you want your video to be\nTap the capture button to start recording!\n\nGenerally, 5x is good for shorter recordings such as your kids or pets playing, and 120x is good for recordings over a longer period of time, like a sunset.\n\n\n\nNot sure when to stop? During recording, the recording time and the expected output time will be shown so you can stop at anytime you’d want your video length to be.\n\n\n\nWe know that battery life is very important for Pixel users, so during shooting, if your phone is inactive for more than 1 minute, the display will dim to maximize your battery.\n\nFinally, we’ve added a few tricks to make Time Lapse even more fun to use:  \n\nFirst, we’ve added video stabilization into the Time Lapse so that you’re not only limited to shoot on a tripod, but anywhere handheld. That includes walking down the streets or in a moving car without fearing your video will be extremely shaky.\n\nSecond, you can change speed at anytime during recording for creative or dramatic effects. For example, while recording, try switching between 10x and 1x speeds.\n\n\n\nThis was shot in a shaky, fast moving taxi on a highway and is a great example of what you’re able to shoot with Time Lapse thanks to built in video stabilization and the speed change feature.\n\nHope you enjoy the feature and let us know how we can make it even better!\n\nKevin Fu\nProgram Manager, Pixel Camera",
    "is_img": 1,
    "category": "Camera",
    "post_time": "2019-06-10T22:56:34.030839+00:00",
    "reply": "15 Replies"
}