{
    "url": "https://support.google.com/pixelphone/thread/95294215/notification-on-locked-pixel-3a-immediately-unlocks-phone-and-opens-app?hl=en",
    "title": "Notification on Locked Pixel 3a > Immediately Unlocks Phone and Opens App",
    "content": "Hi all,\n\nI just updated my Pixel 3a to Android 11 maybe a week ago, and since then I've noticed some unusual behavior. I'll have my phone locked, sitting on my desk while I work. I received a notification from YouTube about a new video from a channel to which I'm subscribed, but instead of just showing the notification, my phone unlocks itself, opens the app, and starts playing the video by itself.\n\nThe same thing happened when I got an email or a text message. I'm not on my phone, not even touching it, and it just unlocks by itself, opens the respective app, and immediately displays the message / email I just got. This doesn't seem to happen every time, but it's often enough that it's noticeable. I thought it was just a weird fluke after upgrading, but since then I've rebooted my device a few times, and it still happens. I thought it may have been an issue where 'the first time a notification comes through for [x] YT channel' or 'the first text message from this one contact' it would open automatically and then revert to its normal state, but so far it's happened multiple times for the same contact / YT channel.\n\nI do have a Pebble watch that is added as a Trusted Device, so I don't have to enter my pattern every time I unlock my phone. However, I removed it as a trusted device, and this still happens. In that case, instead of going right to the app, it prompts me for my pattern, as if I had tapped on the notification myself on the locked screen.\n\nHas anyone else encountered this issue? I've been looking through Settings and online and I can't find anywhere a setting to disable this, so it seems like a bug?\n\nI've tried to capture it on camera, but (obviously) it happens when I'm not expecting it, and whenever I *do* try to test it (test text, etc.), it of course doesn't happen.\n\nAny help would be greatly appreciated!",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2021-01-27T04:14:34.665492+00:00",
    "reply": "16 Replies"
}