{
    "url": "https://support.google.com/pixelphone/thread/14188404/photos-in-camera-roll-just-disappeared?hl=en",
    "title": "Photos in camera roll just disappeared",
    "content": "Yesterday I tried taking a video and got a notification that I didn't have enough storage. I started deleting photos but made sure to only delete some that were already backed up (my back up is turned on automatically). After deleting 20-30, I tried deleting more and it said it could not delete them. I went to check my phone storage, and it said the total phone was only at 73%, so something happened to the 27% that was there when I was trying to take the video. I had guessed that I somehow accidentally selected to \"Free Up Space\", which from my understanding would only have removed photos that were already backed up, so I wasn't worried about it. Later that night I looked at my photos, and all of the photos I had taken that day said \"Not backed up. Too big or unknown type\" (which didn't make sense because one photo had that message, but the next photo that I had taken 5 minutes later didn't). I searched the internet and someone suggested to clear the cache, and confirmed this would do nothing to harm any photos. I did that and then went back to my \"camera\" album and only the first 32 photos appeared, and the rest were grey squares. If I went to \"photos\", it appears that all of the pictures that are saved to my device won't appear, but any photos that aren't, appeared correctly.  In \"camera\" when I clicked on a photo that isn't displaying, it just gave me a black screen. If I tried editing the photo it said \"unable to edit, check your connection\". I was connected to both wifi and data so that shouldn't be an issue. If I tried to share the photo, it just gave me a white screen. \n\nI decided to try restarting my phone because presumably that fixes everything, but then ALL of my photos, except for those first 32 were gone from my camera album. The ones that weren't backed up because they were \"too big or unknown type\" (even though my camera was the one that took them) were completely gone. \n\nI'm guessing there's nothing I can do and that those pictures are just gone forever? Any one have any ideas at all of what happened or anything I could do to get those pictures back?",
    "is_img": 0,
    "category": "Camera, Google Pixel 3",
    "post_time": "2019-09-12T10:26:15.369733+00:00",
    "reply": "1 Reply"
}