{
    "url": "https://support.google.com/pixelphone/thread/11820611/can-t-transfer-files-to-and-from-pc-anymore-on-pixel-2xl?hl=en",
    "title": "Can't transfer files to and from PC anymore on Pixel 2XL.",
    "content": "Since updating to Android 9, lots of users faced this huge problem. Unable to transfer their files/photos/videos to and from their PC. I'm one of them. Now, this is a big issue for Google doing this. Because Google is preventing us to have the freedom of how we want our files to be transferred. Not by telling us or recommend us using Google Drive or some other Cloud services. What's the point of doing this latest update for a thousand dollars phone? Do you really know how slow it is to transfer thousands of files to Drive or Cloud?\nI've tried to use other cables, messing with USB settings/configurations and Developer option, reinstalling drivers, tried on other PC and laptop and went as far to factory reset. But none of them resolve this huge problem. Very frustrating and disappointing. What's wrong with the pic attached below? I can't even press anything on it when connected to my PC. As you can see, it is greyed out. And the biggest problem of all is Windows no longer recognized USB device even after installing new drivers, it always popped up whenever I connect this phone. Why do you need to disable this, Google?  I really believe this is a software issue that you have done, no other explainations needed, which is such a shame to be honest.\nOK Google, now I would like to request on how to downgrade to Android 8 or any other earlier versions of Pie. Are you able to to show me the steps and requirements on this? Are you able to make the transferring files possible again? If you can't help on this and say that the phone is unable to roll back because of software issue, then this phone will either go to the drain or I will sell it away. There is no point keeping this phone for much longer. There is no point for Pixel users to have this phone.\nI hope Google can hear to my complaints and would like hear from them ASAP.",
    "is_img": 1,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-08-12T11:32:55.855572+00:00",
    "reply": "2 Recommended Answers"
}