{
    "url": "https://support.google.com/pixelphone/thread/59693123/pixel-1-going-crazy-after-factory-reset?hl=en",
    "title": "Pixel 1 going crazy after factory reset",
    "content": "Hi,\n\nI have an original Pixel 32GB, i bought it 10 months ago with Android 8 installed I believe and I unlocked the bootloader then updated to Android 10 and everything worked fine apart from i couldn't update one app and then it stopped working unless i updated it. It doesn't work on phones with unlocked bootloaders.\nSo 3 weeks ago I locked the bootloader and did a factory reset and I cant remember exactly when the problems started but definitely after 1.5-2 weeks the microphone stopped working, people would call me and they couldnt hear me and I couldnt hear them either. I could still get sound from radio, facebook, twitter videos etc etc no problem. Also the battery seemed to be running down a lot quicker than before as well\n\nThen i started investigating and downloaded a hardware tester app that had a sound meter and I would open it randomly and it would say 0dB, I restart the phone then go back and it would display a fluctuating value, then at some point later if i did it again it would stay at 0dB, restarting the phone fixed it.\nThen I was recording a video and \"audio cant be recorded, microphone is in use by another app\" so i went in to permissions and denied microphone for everything except camera, and the video recorded with sound ok, i then gave all the apps microphone permission again and it still worked so woooohhhooooo...... but then at some point later the microphone stopped working again.\nI tried safe mode and microphone was still ok after several hours\n\nA couple of times I picked up my phone and it was a white screen with a G and a moving bar underneath, i had to restart it by holding down power button and volume down, it never did this before the factory reset\n\nI chatted to google support 2 nights ago he suggested\nReset app preferences.\nforce stop the camera\nclear cache/storage for Camera, Google”, “Messages”, “Phone”, “Clock” and “Settings”.\n\nBut nothing worked\n\nSometimes i would try and do a video and camera app would crash, or sometimes it would record something but it wouldn't play\n\nSo today I did another factory reset, it was taking ages on a white screen with a G and a moving bar underneath then came up with an error saying it was corrupt and i could try again and do a factory reset, so i did factory reset again. Since then it has gone to the white screen with a G and a moving bar underneath several times while I've been using it, it did 1 video with sound ok then I just tried again, camera app crashed, photos app crashed, and no sound on the video.\n\nIs there any software solution for this or is this a hardware problem? Just seems strange that it was absolutely fine until the first factory reset.\n\nThanks",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2020-07-18T13:29:19.915197+00:00",
    "reply": "1 Reply"
}