{
    "url": "https://support.google.com/pixelphone/thread/113169243/google-recorder-crashes-and-cannot-start-i-have-more-than-1gb-of-recordings-i-cannot-lose-help?hl=en",
    "title": "Google Recorder crashes and cannot start, I have more than 1GB of recordings I cannot lose, help",
    "content": "Hello,\non my Pixel 4a, I have the last RQ3A.210605.005 Android update and after the last (Google) Recorder update 2.3.378307099 the Recorder does not start! It crashes, freezes and only tells me \"App has stopped\" / \"Recorder keeps stopping\".\nI have more than 1GB of sound recordings I cannot lose, and as you know, they are hidden from the user (unless I root the phone presumably, which I do not want to do.)\n\nI of course tried everything, forcing the app to stop, deleting cookies. I of course cannot delete App Data or reinstall the app. I have all the possible updates. My only idea here would be to downgrade, but that is not an option without uninstalling the app.\n\nI also want to add that I do not have all of these backuped in recorder.google.com,\nas there is anyway no way of downloading them through that website externally,\nso I didnt use it.\n\nWhat do you recommend?\nShell I wait for an another app update with the hopes that it will fix the problem and I will be able to export the recordings?\nShell I boot to safe mode and see if it changes anything?\nhttps://support.google.com/pixelphone/answer/2852139#zippy=%2Cif-your-phone-is-on\nIs rooting the phone the only option really? (To see the folder /data/data/com.google.android.apps.recorder/files/recordings )\n\nError log / screens can be downloaded here:\nhttps://1drv.ms/u/s!ApA-lU4RlEhdarMvL57fJYUTZJ4?e=1xaZjY\n\nWhat other alternative options are there?\nIf necessary, tell me what other info you need.\n\nThank you in advance for any tips. I am the first and only user of my original Pixel 4a, I am caring for it and until now, I was really a big fan of Pixel.. But now .. I am not so sure anymore.\n\n(my contact email of the Android account is myknowkiafone@gmail.com)\n\n\nDaniel",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-06-11T08:47:04.459942+00:00",
    "reply": "2 Recommended Answers"
}