{
    "url": "https://support.google.com/pixelphone/thread/77934618/sent-my-phone-for-a-warranty-replacement-and-still-haven-t-received-any-info-from-google?hl=en",
    "title": "Sent my phone for a warranty replacement and still haven't received any info from Google",
    "content": "TLDR: Between Google and AT&T - they have not resolved my battery management/charing issues for a month and now Google has my phone and hasn't sent a replacement.\n\nRight after the A11 update, my Pixel 4 XL (which was running perfectly prior to the A11 update) started to experience really odd battery management/charging issues which many seemed to complain about since the most recent OS. On top of that, the OS just seemed really sluggish overall. Over the last month I've reached out to both AT&T and Google Pixel Phone Support trying to get a resolution. Pixel support recommended I go to a local repair shop since they thought it was a hardware issue. Went there and they didn't have a battery and motherboard they thought they needed to replace to get my phone working even after I told them the issues started occurring after A11. So they said they would have parts in a couple of days. I get a call over a week later saying they still had no parts and at this point I'd already contacted Pixel Phone support again and arranged a warranty replacement and sent my phone using the provided shipping label (I was on the phone with someone for over an hour to even get them to agree to replace my phone). The device arrived at Google's returns center on 10/14 and in the email they mentioned that my replacement would be shipped out in 1-2 business days and that I would be notified of the shipping details. I still have yet to receive any confirmation that my replacement was shipped and when chatting with Pixel Phone support T1 and T2 agents today, they could not tell me what was going on at all, no details or status of my replacement. The T2 agent said I would receive an email from a supervisor within 1-2 (more) business days for a status. It's been about a month since my phone stopped working properly....at $1,500/share, you would think Google's support would be able to solve my issue on a device that's worth less than 1 Google share. Anyone else have this type of experience with Pixel Phone support?",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-10-19T18:29:04.171096+00:00",
    "reply": "0 Replies"
}