{
    "url": "https://support.google.com/pixelphone/thread/112374424/upgrading-to-android-11-killed-my-4a?hl=en",
    "title": "Upgrading to Android 11 killed my 4a",
    "content": "I had a 4 week old Pixel 4a.   It had been nagging me to upgrade to Android 11 since I bought it.    I kept putting it off.   It seemed that a couple of days ago it decided on it’s own to start the upgrade.   Here’s an order of events:\nI noticed that the Date/Time format on my lock screen had changed.   It now showed temperature.   Seemed odd.\nLater that day, I tried to download an app from the play store.    All I got was the “pending” message followed by an error daying download failed.   Tried several other apps…all the same.\nSearched online and deleted Caches and Data for Play store.   No improvement\nDeleted Caches and Data for Google Play Services.   No improvement\nAt some point the upgrade to Android 11 started.   It took a very long time, but always ended with a never ending activity describes as “Updating 0 of 1”.    This would continue with no apparent progress nor end.\nTried restarting the phone to see if that would get it out of the “updating 0 of 1 situation.      After the restart, it found another Android update.    Restart, then another, restart then another for about 8 times.  All this time there was the consistent “Updating 0 of 1” notification\nAt some point in this mess, the navigation buttons stopped working along the bottom of the screen\nThe phone was usable…but barely.\nDuring a subsequent phone call, the bottom left corner of the display started to turn purple and then black.    This area was like it was “alive” and continued to grow.\nThe unresponsive area of the touch screen started heading north.  At this point I was unable to even get a response from the Enter button on the unlock screen…so the phone was useless.\nThis morning I woke to a completely dead display.   Just displayed a bunch of garbage\nPhone is now on it’s way back to BestBuy for a full refund.\n\nI’d go back to Samsung in a hurry if I could.    The only locally available stock is to replace the 4a with another 4a.        If it dies, I’ll have to return it too.    In the meantime, I’ll take the time to look for a refurbished Samsung to have as a backup.    Can’t say I’m impressed with the Pixell 4a, but I am impressed with BestBuy’s return process.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-06-04T17:12:00.572924+00:00",
    "reply": "7 Replies"
}