{
    "url": "https://support.google.com/pixelphone/thread/94797062/notification-status-bar-only-pulling-down-on-home-screen?hl=en",
    "title": "Notification/Status Bar ONLY pulling down on Home Screen",
    "content": "Hello, about two days ago my phone started behaving strangely. By that I mean, the notification pull-down bar is ONLY accessible from the Home Screen. If I try to pull down the notification shade while using an app, nothing happens. I also noticed the touch response is a little finicky.\n\nMy phone has no physical damage, and did not fall or get wet prior to this happening - it literally started happening while using the phone, for no perceivable reason.\n\nI am on the latest version of Android (11), with the January security update installed. It was installed about a week before this problem arose.\n\nThings I have tried several times, but the problem persists:-\n1 - Removed my case and screen protector.\n2 - Clean the screen.\n3 - Rebooting the phone (both soft and cold boot).\n4 - Letting the battery completely die, recharge, reboot.\n5 - Reboot into Safe Mode.\n6 - Cleared Pixel Launcher cache and data.\n7 - Tried Microsoft Launcher (in this case, the notification tray couldn't be pull down on the Home Screen either).\n8 - Removed SIM card.\n\nNone of these things have worked. The only thing I have not tried is a full Reset. I am apprehensive to do this, because it is timely to reconfigure the phone, and I have seen two other users report an issue like this (one on this support community), and they both tried full resets with no luck.\n\nDoes anyone know what is causing this exactly? Because everyone seems to be stumped. It does not seem like a hardware problem, at all. How many other reports of this are there? Is there any known fix? Is Google aware of this problem, and are they looking into it?\n\nAny solid assistance/support will be sincerely and deeply appreciated. Thank you.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-01-23T17:45:41.208404+00:00",
    "reply": "1 Reply"
}