{
    "url": "https://support.google.com/pixelphone/thread/14757764/pixel-2-noise-cancelling-during-phone-calls-not-working?hl=en",
    "title": "Pixel 2 noise cancelling during phone calls not working.",
    "content": "Hi, everyone! So this isn't a question so much as an answer that I hope Google takes notice of, or at least will allow to stay up for others to reference, because I believe it's the source of a variety of audio issues users are experiencing.\n\nSo after a couple of years of apparently annoying all my friends and family with my painfully loud and unfiltered phone calls on my Pixel 2, I finally figured out why: those tiny holes on the top and bottom of the phone are ambient mics that WORK TOGETHER to cancel out background noise.* My phone case has openings for the mics, but apparently the HOLES IN MY PHONE CASE WERE TOO SMALL for the mics to work properly. \n\nSo basically I've been calling people with no noise cancelling functionality, and the tiniest of sounds were apparently getting picked up and amplified by the Pixel 2's impressively sensitive front-facing mics (they could literally hear me swipe on the phone, no matter how softly I touched it).\n\nSo tonight during a phone call with my long-suffering BFF, I took my phone out of its case. She immediately noticed a difference. She could no longer hear my shoes on the pavement, nor the boxes I was moving, nor the tap-tap-tapping on my phone. And for reasons unbeknownst to me, it even improved the audio when I used the mic on my Bluetooth headphones. I suspect the Pixel continues to do noise-cancelling through its ambient mics even when using an external mic.\n\nSo if you're having a problem with your end of the phone conversation being garbled, try removing your phone from its case and see if it helps.\n\nI'm gonna need to try and drill bigger openings in this case...\n\n*So this is just a hunch, but I think the way it works is since there's two front-facing mics next to the top and bottom speakers, those tiny holes filter out ambient noise for the adjacent main mics. Which is why you need to make sure both are clear of obstructions.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 2",
    "post_time": "2019-09-19T08:35:09.173246+00:00",
    "reply": "1 Reply"
}