{
    "url": "https://support.google.com/pixelphone/thread/16518923/downgrade-from-android-10-back-to-android-9-verizon-locked-bootloader?hl=en",
    "title": "Downgrade from Android 10 back to Android 9? (Verizon Locked Bootloader)",
    "content": "Not super happy with the Android 10 upgrade so far. Huge hit on the battery life of my Pixel, so much so that I thought the battery itself might've gone bad. Used to be able to make it through a full day on two charges, but now it's more like 3 or 4 times a day. Took it in to a certified repair shop and had them replace the battery, but no change. Looked online for possible fixes, as this appears to be a rather common problem, and found some information about the new location permission settings associated with the upgrade. Adjusted all my app permissions to limit location access to the recommended bare minimum (Maps and Home). Definitely better, but 45 mins of active screen time scrolling through Facebook still knocked my battery from 100% to 65%. The phone does not feel any warmer than usual and the battery usage settings don't report anything unusual such as a funny background app. Went for a factory reset to see if that would solve the issue.\n\nNope, no change. Double-checked with the repair shop to make sure they did indeed install a new battery and didn't accidentally put the old one back in or something. They assured me they replaced the battery with a brand new OEM battery. The technician suggested it might be a software move by Google to encourage Pixel users to upgrade to the newer phones. Tried out the security update today just in case the issue was patched, but no change. Considering the money I just shelled out for the battery replacement and how much I love my Pixel as it is, I'd prefer not to upgrade just yet. \n\nAll that being said, I just want to go back to Android 9. Seems significantly more stable for the original Pixels, but it seems I'm trapped in a box. I have a Verizon version of the phone, even though I use it on T-Mobile, and a locked bootloader. It seems that the previous exploit that allowed us to remove the bootloader lock was either intentionally or unintentionally patched in the Android 10 update. No luck flashing any of the approved 9.0 OTAs.\n\nAny other options to roll back? That or maybe we can get a patch addressing the issue? My sister also noticed the issue on her Pixel, but being less tech savvy, invested in an external battery pack to make up for the issue. I guess I have that option, but would prefer not if we can just get an update that gets the phone back to normal battery operations. That or maybe there is another way to unlock the bootloader? Any help is appreciated.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-10-11T00:50:35.679446+00:00",
    "reply": "1 Recommended Answer"
}