{
    "url": "https://support.google.com/pixelphone/thread/75567706/cannot-transfer-content-from-pixel-2-to-pixel-4a?hl=en",
    "title": "Cannot Transfer Content from Pixel 2 to Pixel 4a",
    "content": "Been trying endlessly for two weeks to transfer content from my Pixel 2 to my new Pixel 4a, both from Verizon.\nThe cord to cord transfer did not work (myself and the Verizon store tried ten different cords)\nVerizon Content Transfer app did not work.\nSamsung Switch app did not transfer.\nVerizon Cloud did not work.\nSMS Backup and Restore does not work... gets to 94% backed up, then suddenly shuts off and restarts my phone.\n\nMy Pixel 2 has 64 GB and I was able to delete enough content to get it down to 11% available, somewhere between 55-57 GB storage used... and when I start the SMS Backup app, supposed to be backing up to my Google Drive, it maxes out my storage and suddenly I am now back at full 64 GB capacity and an error message comes on top of my notifications and tells me 'system not functioning due to low storage' or something...\n I have been running around in circles trying to transfer my content. The main content that is most important to me  :::\n\nmy Smart Recorder saved recordings (the app did get transferred over to my Pixel 4a but says I have no recordings). \n\nMy TEXTS are the most important. I use Textra which automatically backs up texts to my stock android Messages app.... both of which apps have transferred over to the 4a but without any texts. \n\nDownloads in Files.. on the new phone, nothing is in Files... \n\nAll of my gaming apps or really any app, that transferred from the 2 to 4a, got reset and the app thinks I am brand new, even though it's all through my Play account, same email, same logins... I could live without the games as long as I get my recordings, downloads, and my texts.\n\nI could go on and on and explain... but I hope you understand that NOTHING is working and I am at my wits end.\n\nPlease help........... I am not tech savvy... I've been in the Verizon store every other day for the last 14 days... they can't figure it out... I come home and spend 3-6 hours a night on the phone with Verizon tech support, and most recently even Google support... and nobody can tell me how to get my texts and content transferred.\n\n\n**When I go into Settings, Google, and Backup.. it only ever says \"waiting to backup\" under Messages and Call logs... no matter how many times I click \"back up now\" it continues to read \"waiting to backup\" and never progresses**",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2020-10-08T02:16:47.991079+00:00",
    "reply": "4 Replies"
}