{
    "url": "https://support.google.com/pixelphone/thread/108609952/pixel-5-volume-inconsistent-from-app-to-app?hl=en",
    "title": "Pixel 5 volume inconsistent from app to app",
    "content": "Hey folks, I've been searching around for a solution to this with no joy, so I'm hoping someone can help. I have searched around quite a bit, including in this community, and while I've seen other sound issues there's nothing exactly like this, but apologies in advance if I missed it somewhere.\n\nI just switched to Pixel 5 from a well-loved Pixel 2. After a couple of days, there's one weird issue I have not been able to figure out. Some apps' volume is noticeably lower than others. I can play a video in reddit or a song on Spotify and hear it loud and clear, and then switch to play a game and have to turn up the volume - but if I have an in-game ad the volume is significantly louder than the volume of the game itself. There's no volume sliders in the games I'm playing, just an on/off toggle.\n\nThis is happening consistently across a number of apps. Expected volume: in-app ads, YouTube, Spotify, Reddit Is Fun. Quieter than expected: games (Aggretsuko, Time Princess, Idle Slayer), Instagram,\n\nThis was not something I experienced with the Pixel 2, so I don't think it's the sneaky crap where ads are just louder, unless this is a 5 \"feature.\" And it doesn't just happen with ads, that's just the most noticeable contrast I've seen. I've read up on the volume issues the 5 had at launch and it doesn't sound like that either, since the sound is consistent within single source and doesn't cut in and out - plus this has all its system updates which should have solved that months ago. Adaptive sound is off. I checked out of curiosity to see if some things are managing to access the top speaker while others are using the bottom speaker but that's not what's happening.\n\nIt's almost like there's a volume mixer where some things are turned up and others are turned down. It's very, very weird.\n\nI have now performed another factory reset that has not fixed the issue. It doesn't happen in Safe Mode that I can identify, because I can't access any of the third-party apps this is happening on. I've disabled or uninstalled a few apps that might affect anything at the system level - no joy. I think my only next step is to uninstall everything, install one by one, and see if it works, but I'm desperate to avoid this if I can.\n\nDoes this sound familiar to anyone? Any suggestions?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 5",
    "post_time": "2021-05-04T14:31:25.522632+00:00",
    "reply": "1 Reply"
}