{
    "url": "https://support.google.com/pixelphone/thread/25554626/returned-2x-pixel-4xl-in-oct-2019-no-refund-yet?hl=en",
    "title": "Returned 2x Pixel 4XL in Oct 2019, no refund yet",
    "content": "I ordered the new pixel 4 xl for myself and my girlfriend during the launch event. Excited to be part of the pixel family for another year. After reading and watching underwhelming reviews, we decided to return the phones as soon as they were delivered and buy another brand for this year.\n\nOct 23rd 2019, devices delivered and I requested for an RMA. Shipped both back to Google with RMA numbers. Dropped off packages at local UPS store and figured all is well. Except, I still don't have my refund. Nov 2nd, 2019, I receive an email from \"Jeff\" with no contact details saying: \n\n\"Thank you for your continued patience while we’ve looked into this with our logistics team for you. \n\nAfter further investigation, we’ve found that our warehouse received Micro USB cable instead of the Pixel Phone 4 XL White 64gb expected per your RMA02414606 . We need to receive the defective device before we are able to send the replacement to you.\"\n\nI have called 8-10 times, every single time at least an hour of wait time, going through different levels of support, no one can give me a straight answer. All they tell me is: \"There is an investigation going on and we'll let you know.\" I cannot begin to describe how frustrating this has been for me and my girlfriend. We have $2550 on credit card still, I don't know when I will hear back, if ever. Last 2 times I called, I was told someone would get back to me within 24-48 hours. No one has ever called or emailed.\n\nThis has been quite disappointing, frustrating and traumatising experience with Google so far, I can't talk to anyone who can get me a proper Answer, so many levels of customer service/support. \n\nSomeone, Please help...",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-01-13T19:23:39.718106+00:00",
    "reply": "2 Recommended Answers"
}