{
    "url": "https://support.google.com/pixelphone/thread/107076177/why-is-my-pixel-4a-5g-intermittently-disconnecting-from-my-mobile-network?hl=en",
    "title": "Why is my Pixel 4a(5G) intermittently disconnecting from my mobile network.",
    "content": "Hello, I recently upgraded from the Pixel XL 2 to Pixel4a (5G). The problem is that the phone keeps dropping its connection to my mobile carrier. Its happening throughout the day intermittently. I know when it happens as I can see the mobile symbol at the top of the screen flicker off and on again .  When I'm not using the phone  I know its happening because the phone makes a sound indicating its not connected to mobile. Also it happens when I try and make a phone call. Basically when I attempt to make a call it fails the first time and immediately afterwards when I try the second time it works.  The same goes when I try to text somebody using Google Message app. When I try and send the text message it immediately fails. If I tap the message it will try and send the message again resulting in it working the second time.  So same pattern is occuring when I try to make a phone call or if I try and text using standard SMS. Basically fails the first attempt and works on the second attempt.  I have contacted my carrier Rogers and they say the problem is not on their end. They are now recommending I contact Google so that is what I'm doing here. So any help would much be appreciated. \n\nUp to this point these are the things I have tried to do in order to fix this issue. None have made any difference as the problem is still occuring.\n\n1. I have tried restarting my phone \n2. I have tied turning off Adaptive Connectivity (Settings-->Network and Internet-->Advanced)\n3.I have tried turning off VoLTE  (I'm in Canada)\n4. I have tried turning of Adaptive Battery. (Settings-->Battery)\n5. I have tried turning off 5G and using standard 4G\n6. I have tried  doing the Reset WiFi, mobile and Bluetooth option. (Settings-System->Advanced)\n7. I have tried the Erase all data (factory reset) option. (Settings-System->Advanced)\n\nThanks for any advice you can provide. \nEd...",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a (5G)",
    "post_time": "2021-04-22T01:04:20.194231+00:00",
    "reply": "1 Reply"
}