{
    "url": "https://support.google.com/pixelphone/thread/74924694/while-off-and-charging-pixel-2-xl-is-stuck-in-a-weird-infinite-unsuable-loop?hl=en",
    "title": "While off and charging, Pixel 2 XL is stuck in a weird infinite unsuable loop",
    "content": "A few days ago I upgraded to android 11. and I've had tons of problems, but this is by far the worst, and I don't know if it's hardware or software or both.\n\nWhile trying to charge my phone with the OEM charger today, it wasn't charging at all, so I had to let the phone die. Now, I've replugged in the phone and the following loop happens\n\n1. Charging logo (Bolt and white battery) pops up for 1-2 seconds \n2. The lightning bolt disappears and the battery greys out, making it seem like the charger was disconnected (it isn't)\n3. At about the same time, a white bar appears at the top of the screen, about halfway across. Then it quickly 'loads' across the screen, and the screen turns black for about 10-15 seconds, and the cycle repeats.\n\nI've waited a bit, and when I try to turn on the phone, it boots to the G logo, then turns off, presumably it doesn't have a charge. I've tried another charger and the same loop happens. \n\nThis all seems like a charger issue, but this only happened when upgrading to Android 11, and the loop sequences makes it seem like a software one. Any ideas? My phone is 100% unusable as is.\n\n\nEDIT: After trouble shooting more, using a slow charging method works fine, but only when the phone is powered off. However, my battery is now draining super fast and plugging in any charger when on literally instantly turns off my phone, lol. This is a horrendous update if it makes any charger instantly make your phone stop working and crash. From reading around a bit, it looks like I'm not alone, but mine seems even a bit worse than other peoples. Since I'm out of warranty I might be out of luck, but I feel like pushing an update that attempts to soft brick your phone should be a crime, no?",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-10-04T19:43:14.053137+00:00",
    "reply": "0 Replies"
}