{
    "url": "https://support.google.com/pixelphone/thread/21152900/headphones-cause-volume-up-down-mic-press-ok-google-replaced-headphone-jack-and-didn-t-fix?hl=en",
    "title": "Headphones cause Volume up/down + mic press + ok google - replaced headphone jack and didn't fix?",
    "content": "Im having a interesting issue. Having a earbud headphone plugged in with a microphone on it results in the volume (most often) going down to mute automatically, sometimes up.....and with the ok google / google assistant being throttle triggered. This behavior persists with the phone screen off and with various permissions removed.\nThis issue is not the result of dirty or malfunctioning headphones and doesn't appear to be a faulty headphone jack either. Headphones work perfectly fine in mulitple phones including my wife's identical original pixel running the same exact OS version (android 10). I also tested with multiple different branded headphones all have caused the same issue. I went and grabbed a non-mic 99 cent pair of headphones (harder and harder to find) and the issue does not persist.\n\nI ordered a replacement headphone jack that appeared brand new (ebay purchase) and replaced it and thought that would be the end of my problems. The issue persisted after replacing with a new jack.\nSince I replaced the jack, as well as tested multiple headphones and confirmed the issue does not exist with a non-mic headphone, this must mean that there is some software confliction going on that is driving my phone crazy due to mic input.\n\nI have spent the last week googling various situations (faulty headset, ok google randomly occuring, volume up/down during audio playback, etc) and tried a dozen + different solutions.\nIf I remove microphone permission from the \"google\" it does not resolve the issue. It does prevent me from using voice to text however, which to me is a essential function of the phone. This part confuses me. There must be a separate permission that handles the microphone through the headphone. I've looked up the various ways to disable the \"ok google\" function but none of them appear to stop the behavior.\n\nHere are some screenshots showing exactly how annoying this issue is -\nhttps://imgur.com/a/xwOayZU\n\nThe first two images are examples of what happens when I deny google microphone permissions. Instead of just blocking it, it just constantly nags me to enable permissions but not only does it nag in the notification pull down it also nags with audio....so it is impossible to listen to music. I installed volume lock to prevent audio volume from being changed thinking I was being smart, only to find out that the constant ok google nag interrupts the audio.\n\nThe 3rd image is what happens if I disable voice assistant from google > settings > assistant tab > assistant device (pixel)\n\nIt still does the same thing, except instead of giving me the standard ok google response it just pops it up and asks for me to enable permission. Such a worthless feature (permission management) if the same exact problem occurs when you refuse to give it permissions.\n\nIf anyone has any idea's for me to try, please advise, I've spent weeks on this now and im completely out of idea's. I love the phone. I love my headjack port. I don't want a new phone....I can replace this phone's screen for $25 if I break it, parts are dirt cheap and its a easy phone to repair. It works great and serves all my purposes and runs the latest android OS to boot.",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel",
    "post_time": "2019-11-25T20:53:15.106839+00:00",
    "reply": "5 Replies"
}