{
    "url": "https://support.google.com/pixelphone/thread/89540723/what-is-going-on-with-google-photos-on-android-11-i-m-having-multiple-issues?hl=en",
    "title": "What is going on with Google Photos on Android 11? I'm having multiple issues.",
    "content": "These are fairly recent things, in about the past month or so for me. \n\nISSUE 1:\nI am unable to organize my photos in Google Photos, because if I move the photos to another device folder that I create, then I can't upload them in other apps. This means any photo I take I have to leave in the \"Camera\" folder to be able to upload the photos in say, Facebook. This also is the case for any photos downloaded from apps into app created folders like PicsArt, Snapchat, etc. \n\nThey are visible in Google Photos and are backed up. They're just not being found in any other apps after they are moved device folders. Also, if I move them back to the original folder and reupload/redownload, they still can't be found in other apps, but are still visible in Google Photos.\n\nI have tried re-uploading and re-downloading the photos, clearing my data/cache, restarting my phone, signing out and into my Google account... Pretty much everything I've found I've tried. \n\nEx 1: Took photo on phone. Moved it to a new device folder named \"random\". Go into Facebook to upload photo and it can't be found. It doesn't matter what other app it is. No matter what menu option the app gives, the newly created folders AND moved photos are not being seen in the directories of the app I'm trying to upload the photos to once they get moved from their original device folder. \n\nEx 2: I download a photo from Snapchat. Move it to a new device folder named \"random\". Go into say, Instagram to upload it and the \"random\" folder and the photo are no longer seen by Instagram because it was moved out of the original \"Snapchat\" folder that was created when the photo was downloaded. \n\n\nISSUE 2:\nI am ALSO having an issue with random photos that are in Google Photos cloud albums that are backed up not having an option to download them back to my phone. I am starting to regret this phone purchase.\n\n\nSorry for the novel and super explained examples. I've searched constantly and can't find my exact issue and nothing for other issues works. This is driving me nuts. I'm starting to regret this upgrade.  🤣😭🤣😭",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 5",
    "post_time": "2020-12-20T04:31:01.285749+00:00",
    "reply": "2 Replies"
}