{
    "url": "https://support.google.com/pixelphone/thread/9035385/text-message-simply-disappears-%F0%9F%A4%AE?hl=en",
    "title": "Text message simply disappears?🤮",
    "content": "I have contacted Google about my , 800.00$ investment .( Google pixel2) of Wich I purchased about 2 years ago and original was Stolen within the first 2 months. Had insurance and payed the deductible and was sent a....Fantastic !!Right out of the Box, Brand New .....! Refurbished phone for my replacement.👌That's right!😘 NICE !!  Shiat !!! ! Anyway, That son of a refurbed phone that....I ended up with., having to deal with Google, a Hacker, a AHole ..made it so that I couldn't use  either one of my emails, and PW's for  me to get into my Google account. Lost all of my Shiz niz and had to create a new G account, new user I'd and pw. Make a long story short, I used my text message 2 is as a reminder so I text myself my passwords whatever that I may not be able to remember and I'm back up and going on my phone and I go to retrieve the password to my brand new account and it's not there!!! just that one and only text was gone this time you know, the first time everything was messed up this time just my text message to me and all of that information was gone and still is! I was wondering if anyone knew how to get that back and I really would like to know if anyone knew, how someone or if someone is capable having access to your phone! Only, the info and or the text that I sent to my self!!! Is GONe,DONE, Vanished!! Google can't tell me what and why!! Pixel department!! Oh yeah?? So, that means I've called the wrong department. Because when and if any of us have a problem with our product that we purchased and bought and paid for then there is always someone on the other end that made or so that product that, will tell you you've called the wrong department or you have to get in touch with a special person! Bunch of BS! SO NOW I HAVE go to THE\"GOOGLE ACCOUNT EXPERT WEBSITE\"👌\nBut if anybody out there knows how I can find out who has access to my phone?... Please let me know I would appreciate it.",
    "is_img": 1,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-07-01T07:11:22.63284+00:00",
    "reply": "1 Reply"
}