{
    "url": "https://support.google.com/pixelphone/thread/81932496/google-rma-lost-my-phone-and-now-giving-me-runaround-for-2-months?hl=en",
    "title": "Google RMA lost my phone and now giving me runaround for 2 months",
    "content": "Shipped out Pixel 4XL on September 9th, got a delivery notification from UPS on the tenth but no indication from google. Repeatedly contacted Customer service but all gave me the same useless and repetitive response to wait for 5-10 business days and I should get it. Really how it went is I told them I'm worried about  not getting an indication from google on receiving the phone, they tell me to shut up and wait ten days. This happened three times. So I decided to wait for the ten business days and once I don't get anything. I then contact support telling them this and they \"launch an investigation\" within 2 weeks they reach the conclusion that \"the box we received was empty and so system will not allow us to send out a replacement device\". Ok so I understand this the first time around and I immediately refute it by sending them the proof of delivery showing that the box was not empty when I sent it as it weighed 1 KG. They tell me to contact UPS and I do. UPS tells me that I am technically not the shipper and so cant open or file a claim because I used googles shipping labels and google and UPS have to figure it out internally. They tell me to ask google to file a claim with UPS. I ask google to file a claim with UPS and I kid you not the response I get is \"the box we received was empty\". Fast forward a month and a half, through multiple case ID's, Multiple interactions with customer service through email, chat and call as well as many \"escalations\" and \"product specialists\" and \"Support Tiers\" I get the same response over and over again really pissing me off until I apparently reach the highest tier of support. I still don't see progress and I'm becoming really emotionally distressed now, I feel so helpless because Google basically has robbed me of my phone and then rubs more salt in the wound by forcing me to repeatedly interact with horrible customer service. At this point its no longer a matter of IF I will get my phone but  rather when. I really want them to hurry up on this and don't know how to get that done . I don't think it is unreasonable to expect compensation for 2 months of wasted time and so much playing around with me and causing me undue stress for  an error I had and have no part in. Any advice?",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-11-09T18:27:08.780188+00:00",
    "reply": "7 Replies"
}