{
    "url": "https://support.google.com/pixelphone/thread/104449322/how-long-does-the-warranty-replacement-take?hl=en",
    "title": "How long does the warranty replacement take?",
    "content": "I am one of the people who have had the battery stuck at 50% issue. I have been dealing with the problem for a few months and it finally got to the point where the phone would die almost instantly after being taken off of the charger. I am trying to get my phone replaced but it is taking way too long! \n\nI started the warranty process with Google Support through the support chat and they created my claim and had me start by taking my phone to a local UbreakIfix store. I took the phone in for repair on 3/24/21. After calling for an update on 3/27/21, UbreakIfix informed me that my phone was unrepairable and that I would need to contact Google for a replacement phone under warranty.\n\nI contacted Google Support on 3/27/21 and they confirmed that my phone is still under warranty and can be replaced either through their standard exchange or the advanced exchange programs. I was chatting with them about other options because I needed a phone the same day because my phone is my only way for 2-factor authentication for my class for my Master's Degree that I am currently enrolled in. The person told me that they could only offer me the two exchange programs. I then asked to speak to a supervisor since the person that I was talking to was offering me all that they could in their position. They kindly escalated my case to a supervisor but then I was told that the supervisor would get back to me within 24 hours. I feel like there should be more urgency when a situation is escalated to a supervisor but it is what it is. \n\nWell, the supervisor took the full 24 hours to get back to me and sent me one email repeating what the original person told me. I reluctantly agreed but asked if they could overnight the phone because I could not wait 2 - 7 BUSINESS days to get my phone back because I would miss a second consecutive week of grad school because of this issue (I know that it is dumb that my school doesn't have a back-up method, but I can't do anything about that). Once again, it took the supervisor another 24 hours to get back to me to tell me that they can't do anything else and then asked for my information. I gave them my information and once again asked if they understood my urgency after again explaining the grad school situation. \n\nIt took me calling Google Support two more times before I even received a response email from the supervisor. When I called Google Support, I was told that they could not help me because I had started the warranty process through chat/email and not through the phone. When I asked for the phone number of the supervisor that was handling my case so that I could talk to them in person, I was told that they could not give me that information. Really? A few hours later I received the email asking for my information. Side note, I am not convinced that humans are really on the other side of even the \"supervisor\" email.\n\nSo again, my main question is How long will it take to get my phone replaced? I currently don't have a phone with my phone number and thus can't access my class or turn in my assignments.\n\nIf Google does read this, I want you to know that your Support system and warranty procedure is making me seriously consider going back to Apple and buying an iPhone from them because of how much easier it is to get the phone serviced, repaired, and replaced.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2021-03-30T18:48:32.708106+00:00",
    "reply": "1 Reply"
}