{
    "url": "https://support.google.com/pixelphone/thread/93647228/cannot-hear-any-calls-unless-i-m-on-speaker?hl=en",
    "title": "Cannot hear any calls unless I'm on speaker.",
    "content": "I'm not sure why but I cannot hear any calls unless I'm on speaker phone. Not sure is this common issue after software update at the beginning of this month?\n\nHere is the situations\n- I cannot hear any callers unless I'm on speaker, in any apps (e.g. Phone, Line, Grab, etc.) Starting few days ago.\n- when connected to wireless audio gadgets, airpods, bluetooth speaker I can still hear anything just fine.\n- At first two days, rebooth the phone solved the problem, even though after that the issue still persists.\n- Today, reboothing doesn't save it any more. The issue seems to persist permanently. \n\nHere is the actions I've taken.\n- Turn off bluetooth/ Wi-Fi\n- Restart the phone.\n- Rebooth in Safe Mode.\n- Clear cache in Phone app.\n- Try 3rd party Phone app.\n- Remove my screen protector and case.\n- Blow dry my USB-C port. (Even though I haven't drop the phone/ and haven't used it in humid atmosphere at all.)\n- Factory reset.\n\nQuite desperate now. If the issue persists even after I restart the phone in the first place then I understand it's a hardware issue. But in the first few days, restarting the phone solved the problem just fine. But now no matter how many time I restart or reset it, the issue seems to persist for good. Now sure how to explain this. Is there any suggestion to the issue?\n\nP.S. I understand that checking with repair center is the most rational choice. But we don't have google service in where I live now (Bangkok, Thailand) so taking my chance here might be easier for me to understand whether this issue is just a bug that can be solved with a software update or it needs fixing.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 5",
    "post_time": "2021-01-15T18:58:17.62375+00:00",
    "reply": "1 Recommended Answer"
}