{
    "url": "https://support.google.com/pixelphone/thread/105380884/issues-connecting-to-t-mobile-over-cell-network?hl=en",
    "title": "Issues connecting to T-Mobile over Cell Network",
    "content": "I'm having connection issues with T-Mobile and a brand new Pixel 4a 5G.  I recently received the phone and this past weekend set it up (Saturday April 3rd).  The phone worked fine until sometime around Tuesday April 6th, where it only connected to Wifi calling and had intermittent connection to the T-Mobile network (texts had trouble getting in and out and there was no way of making calls using the cellular network.\n\nI took the phone to a T-Mobile store, where they tried different things, all ending with the same issues:  the phone connects for a minute or two (here I can get some texts coming in), but it disconnects from the network.  The SIM Card was changed in the store for a brand new one (no charge).  They also reset the network settings to no avail.  The last thing they told me to try was a factory reset, which once I got home.\n\nI tested the new SIM Card in the old phone, and it works fine.  I did a factory reset of the phone, checked for updates (got the April 5, 2021 update), put the SIM card back into the Pixel 4a 5g, but the problem persists.  I called T-Mobile again and they told me to contact the manufacturer (Google) for the warranty and/or to try other alternatives with the phone.\n\nThe phone is brand new (less than one month old) and I have no idea what might be the problem.  Among the things that have been tried:\nReset network settings\nFactory reset\nmanually connect to cell network (disabled automatic connect to network and I have seen at least 7 different t-mobile networks in different places, but cannot connect to any of them)\nchange preferred network type (tried all, restarted phone, no connection)\ndisabled wifi calling\n\nAny help will be appreciated.  If the phone is defective, I would appreciate an exchange.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a (5G)",
    "post_time": "2021-04-07T17:57:45.040213+00:00",
    "reply": "9 Replies"
}