{
    "url": "https://support.google.com/pixelphone/thread/9712762/rma-process-for-physical-damage-was-completely-useless-what-options-do-i-have-now?hl=en",
    "title": "RMA process for physical damage was completely useless, what options do I have now?",
    "content": "Over two weeks ago, I dropped my 3 month old Pixel 3 and the phone landed on the side with the power button and the volume rocker. Unfortunately, both buttons were left jammed in because the metal housing surrounding both buttons was pinched in, so my phone was at first stuck in a boot-loop situation and then eventually started up to downloader mode. Other than that, the phone was completely fine, i.e. no cracks in the screen, and before that no issues at all to speak of.\n\nSo, I ordered a mail-in repair through the Google store and claimed I needed housing damage to be repaired. To my surprise, the 'specialist team' that analyzed my device claimed I had a broken screen, housing damage, audio problems, battery problems, and charging problems. \n\nLogically, how is it possible that this kind of assessment can be made? Unless Google fixed the physical problems with the buttons, they wouldn't even be able to boot the phone. How do they know my device has battery and charging problems, and also audio problems? \n\nI raised an issue to Google support to investigate this, because I definitely did not send the device in in the state that they claim. I asked for simple proof somehow before I agreed to pay 2.5 times what I originally expected. After having back and forth emails for 14 days, where basically every comment I made was replied with \"I'll relay this to our specialist team and give you their response\", the device was automatically shipped back even though it was still being investigated (apparently). \n\nSo now, 14 days wasted, my device is being shipped back and I have to start the RMA process over again. I asked the support why they didn't put a hold on the return because the case was being investigated. They responded verbatim: \"Since there is a physical damage to the device, we wouldn't be able to help you with warranty options.\" What does this have to do with anything?! I was paying for a mail-in repair, I was never trying to use any kind of warranty options. \n\nI have the feeling that Google support did absolutely nothing for 14 days, which is just a complete waste of time. \n\nAre there really no ways to escalate the RMA process? Because the support team said they had escalated the issue, but this clearly did nothing whatsoever.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-07-11T21:56:52.145128+00:00",
    "reply": "2 Replies"
}