{
    "url": "https://support.google.com/pixelphone/thread/18451797/3-1691000028028-very-poor-support-from-india-pixel-support-team?hl=en",
    "title": "[3-1691000028028] Very poor support from India pixel support team",
    "content": " Case ID [3-1691000028028] Created on 05.10.2019.\nI have purchased a Google pixel 3a phone on 03.10.2019 and since third day of usage, I have observed following defects in the phone.\n1) The device was not holding charge. I set the brightness to lowest possible and could not get even 4 - 4.5 hours of screen on time with only factory installed apps installed and used. Did all trouble shooting mentioned by your agent and None of them worked. Later on I shared the screen with Google support agent and he checked and confirmed the problem and assured me replacement \n\n2) Device was turning off itself many times during usage and when restarted, a good amount battery percentage was lost when turned On again.\n\nAfter I have send the device to B2X for replacement, They have informed me that the device is perfectly OK and they could not identify any defect in the device.\n\nI would like to insist that there is no point or advantage to me in sending a brand new phone to you on 3rd day and fighting with you unless I am 100% convinced that there is a problem. I don’t know why your technicians could not find any abnormality.\n\nThey send the device back reporting me that  No defect found.\nKindly clarify me one good reason where I have an advantage for which I should send a new phone to you on 3rd  day without facing an actual problem ?\nI have spent about 15 days sending you the phone and again fighting with you guys with many as 30 Emails and phone calls and chats tracking the handset due to negligence from your B2X support team. But no proper support or explanation has given from them so far.\n But most devastating thing happened after I received the device back from Google support team. Since last two days again I'm facing same issues mentioned above. I'm highly disappointed on the support I'm getting after spending Rs 40000 for this device. \nI request you to look into the case and do the needful to get me the device replaced.\n\nEdit on 04.10.19: after facing the issue, I have sent more than four E mails to pixel India support team and escalation team. Till now, No reply, No calls I have received. Today I have contacted one supervisor named Akanksha sthough a chat request and she promised me a callback before today 7.00 pm with a resolution.\nNow it's 9.00 pm and end of day and no calls or reply to Emails. India pixel support is a disgrace to Google brand. They never keep word or keep promises they make. Everytime. \n\nI'm planning to put forward legally this as I'm totally frustrated after spending 40K for this phone. \n\nNever ever won't purchase this phone. Even though phone is good, Support I'm getting from India pixel team is terrible.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-11-03T15:19:18.661597+00:00",
    "reply": "1 Reply"
}