{
    "url": "https://support.google.com/pixelphone/thread/106395035/pixel-5-loudspeaker-problems-and-warranty-issues-in-belgium?hl=en",
    "title": "Pixel 5 loudspeaker problems and warranty issues in Belgium",
    "content": "Hi everyone, \n\nI am a bit desperate and need help. I am not even able to contact Google Directly (never fond any chat button ou contact option like mentioned on the Google Pixel Support pages). \n\nI bought a Pixel 5 on a well known Belgian retailer called Fnac on November. Since beginning of January, I have got at once loudspeakerss issues : sound was completely unclear and very low. Putting phone calls on loudspeaker made it unable to hear anything. I have tried several things by my self but nothing could solve the problem. \n\nI than decided to send back the phone to the retailer under warranty. \n\nTwo months later, I received a note from the retailer saying that Google refused to repair because there is a little scratch on the back camera protection window. (I can send a picture of it, it's ridiculously small and insignificant). The retailer ask me 418€ to replace my phone by a new one. Off course, this is not even legal as European and Belgian laws and regulations in that case force retailer to prove that the problem finds its origin in a wrong usage which they never did. In fact, I got even the confirmation that they never opened the phone or made any kind of diagnosis. \n\nSince then, I desperatly try to contest their position without success. In brief, I have a unasable phone that I paid 600€ and could properly used for just a month and no other proposal from the retailer. \n\nCould someone help me with this issue, send it to Google or show me the way to get in touch with Google in order to introduce an official claim about this ?\n\nThank you in advance. \n\nKind regards, \n\nArnaud Helinck\n+32 491 15 85 51\narnaud.helinck@gmail.com",
    "is_img": 0,
    "category": "Other, Google Pixel 5",
    "post_time": "2021-04-16T08:56:40.968676+00:00",
    "reply": "1 Reply"
}