{
    "url": "https://support.google.com/pixelphone/thread/113029304/pixel-4a-5g-screen-black-phone-still-works-how-to-cast-to-tv-so-you-can-still-use-your-phone?hl=en",
    "title": "Pixel 4a (5G) screen black, phone still works - how to cast to TV so you can still use your phone",
    "content": "My pixel 4a (5G) developed purple color bleed, which was the death knell for the screen. The purple spread rapidly and the screen turned almost completely to black within 48 hours. The phone itself still worked and the screen still responded to my touches normally, I just couldn't tell what I was pressing. Once my replacement phone arrived, I wanted to copy the data from my old phone to my new phone and I had to figure out how to mirror the screen form the dead phone to another screen so I could see what I was doing. It was incredibly tedious, but doable.  How I did it:\n\nI took screenshots of the menu screens needed to get my old phone to \"cast\" to a device that I already had setup to accept casting, so that I could touch my dead screen in the approximate right places to turn on casting. You phone will look different than mine depending on what devices you have set up, etc so the most important thing is to know how to connect a USB-C cable from the phone to the computer so you can retrieve screenshots you take on your dead phone (screenshots still worked on the dead phone). After connecting the USB-C cable, you'll hear a little beep to let you know that your phone is connected. First swipe down from the top on the dead screen to bring the top menu. Underneath the top menu will be the USB notification, you'll want to touch this notification. Keep in mind that if your phone pushes you notifications frequently, these other notifications will be higher up on the screen than the USB notification, so clear them all away by swiping them to the right so only the USB notification is underneath the top menu. When you have successfully touched the USB notification, the next menu that comes up asks what you want to do with the USB cable. From the area labeled 'Use USB for,' select \"file transfer/Android Auto.\" You should then be able to open your phone's internal files from your computer and view the screenshots on your computer. \n\nOnce you have this capability, then you can go to settings (wherever that is on your phone). In the settings menu (screenshot 1), select 'connected devices'. At the bottom of the 'Connected Devices' menu (after whatever bluetooth devices you have previously connected to your phone), select 'Connection Preferences.' From the 'Connection Preferences' menu (screenshot 2), select \"Cast\" --> select which device you want to cast to (this will be different on your phone than mine based on what devices you can cast to, so I did not screenshot this). Once you have selected the device to cast to, a screen will come up that asks if you want to to \"Start casting or recording?\" (screenshot 5). Select 'Start now.' You will then be able to manipulate the dead phone using the screen that it is casting to as a reference. \n\nHope this helps some people!",
    "is_img": 1,
    "category": "Other, Google Pixel 4a (5G)",
    "post_time": "2021-06-10T04:11:55.582204+00:00",
    "reply": "2 Recommended Answers"
}