{
    "url": "https://support.google.com/pixelphone/thread/85780937/pixel-xl-boot-loop-with-locked-boot-loader-how-to-save-at-least-the-data?hl=en",
    "title": "Pixel XL boot loop with locked boot-loader - how to save at least the data?",
    "content": "Hi,\n\nMy wife's Pixel XL (gen 1) is stuck since one week in a boot loop that started suddenly when she was simply shopping online - on a trusted website. The bootloader was never unlocked and the phone never rooted, so this is stock kernel on stock HW. She was using the latest FW (QP1A.191005.007.A3) since some time without issue.\nAfter the boot loop started, I tried to side load the official OTA image. The loading worked, but it didn't change anything to the boot loop. I did it a second time, no change. I then factory reset the phone through recovery mode, no change. Side loaded OTA again, no change.\nI know the factory reset worked, since if I let the phone shut down long enough (or put it in the fridge), then it starts and attempts phone setup, but freezes while acquiring its IP address, and the boot loop soon restarts. I am thus unable to unlock the boot loader.\nSince the boot loader was never unlocked (only USB debugging was activated),  it seems I have no way to flash the factory image or any recovery ROM that would allow me to backup the phone. Is there any way to get back the data that was on the internal storage? We don't care about app settings, but pictures and documents. adb backup doesn't seem to work in side loading mode, and adb wait-for-device never fires while booting, so no way to have a shell to manually backup.\n\nIs there any hope? Either to get back the data, or to get a usable phone again.\n\nI just hope this is not the same issue as https://support.google.com/pixelphone/thread/2235808\nThere are no official repair centers in Switzerland or around, so this is not an option.\nI know that by factory resetting, the personal data was erased. But it is still mostly recoverable if able to dd the flash out of it.\n\nThanks in advance for your help!",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2020-11-28T21:37:34.180589+00:00",
    "reply": "1 Reply"
}