{
    "url": "https://support.google.com/pixelphone/thread/38874568/how-do-i-fix-pixel-is-starting-message-that-s-stuck-on-screen?hl=en",
    "title": "How do I fix \"Pixel is Starting\" message that's stuck on screen?",
    "content": "Hope all reading are healthy and safe...\n\nPixel 3 on verizon still on Pie (9) with PQ3A.190801.002 build, which I believe is from August 2019. \n\nOne morning the other day turned phone on and stuck with a \"Pixel is starting\" message.  I can access settings and receive calls, when connected to BT in car can make calls too.  Cannot receive messages though receive \"You have new messages\" notifications, got an alert about a VM that I was able to access.\n\nI realize I can likely do a Factory Reset to fix THOUGH I do not want to go down that path without giving it a go trying to at the very least pull some data off the phone (texts, photos, videos). Yes, everything *should* be backed up...\n\nI tried connecting to computer to see if could recognize as drive and transfer files onto computer (Pixel and MTP USB drivers would not install- tried on two laptops running Win7). I know I should probably be updating to Android 10 and am fine doing so, but would like to recover files first. \n\n I posted some potential solutions below and am curious if there is anything I should attempt to do before/instead of possibly going with one of the 2 below.  \n\nThanks SO much in advance,\nMatt\n\nPossible easier solution: \nFrom _Ra1n_ on xda forums\n\"I couldn't fix the \"Pixel is starting...\" issue. Factory Flashing (after removing -w) QQ1A.191205.008 resulted resulted in being stuck at the \"G\" screen. I flashed the QQ1A.200105.002 factory image (again with -w removed) and was left in the same \"Pixel is starting...\" state.\n\nHere is where things get interesting:\n\nOver adb I launched the Settings app:\nCode:\nadb shell am start -a android.settings.SETTINGS\nNext, I went into \"Security,\" which prompted for my PIN, and then removed the screen lock. After doing this, I was able to get into /sdcard in the ADB shell, something that was not possible before.\n\nBack in the settings app, I enabled USB File Transfer and copied all my files & photos off. I was also able to launch apps from within the apps list in Settings. This let me export settings/data from other apps that allowed it. \n\nSo it seems that entering your PIN in the Settings app also unlocks the phone!\n\nPossible more complicated solution:\nFrom sic0048 on XDA forums\n\"Is you bootloader unlocked? If so, you can flash the factory image and remove the \"-w\" command as suggested above, but if your bootloader is not unlocked this will not be an option. If you are on a locked bootloader, you can sideload an OTA image (which really is a full factory image). This will not wipe your phone or do a factory reset. It will however replace your OS with a clean version. Hopefully that fixes the issue. If not, then you will have to do a factory reset in order to \"clean out\" the problem.\"",
    "is_img": 1,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-04-09T06:44:52.055471+00:00",
    "reply": "8 Replies"
}