{
    "url": "https://support.google.com/pixelphone/thread/12860144/how-to-get-warranty-information-w-o-a-phone-number-from-a-supported-country?hl=en",
    "title": "how to get warranty information w/o a phone number from a supported country",
    "content": "Hi,\nI bought a Pixel 3a in the Italian Google Store,\nbut now I'm not in Italy or in a covered country (Estonia).\n\nMy phone has \"dead touch zone\" and I would like to use the warranty.\nI tried to follow the instruction in here \nhttps://support.google.com/pixelphone/answer/7109524 ,\nbut I'm asked an Italian phone number which I don't have (anymore).\n\nI turned to the \"Made by Google\" on Facebook,\nbesides copy/pasting links they have made the arguments:\n-  try again \"when you're back in the country of purchase\";\n- \"ask a friend\".\n\nAs I pointed out that:\n- even if I was in Italy, I still don't have an Italian phone number\nso I can't follow the instructions anyway;\n- even if I ask a friend he/she cannot forward the request without my phone,\nor authenticating with my phone.\n\nWhat if my screen just went black? I could not use the phone\nto contact the support, so another way to contact the warranty must exist.\n\nI also tried to contact the Assistance Chat using a VPN,\nbut besides sending the initial message I'm technically not able to reply.\n\nI really don't know what else to do!\n\nI understand and accept that the warranty have to be used\nin the country where the phone is purchased and I'm wiling to\nsend my phone to Italy (or to Finland, which is closer to me),\n\nbut what I don't accept being unable to contact the assistance just\n*to have the information needed to send the phone an authorized repairer*\nor whatever solution Google plan to adopt.\n\nI really don't know what else to do.\n\nThank you for reading 'till here,\nhave a good day.\n\nFrancesco",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-08-26T13:01:12.730185+00:00",
    "reply": "1 Recommended Answer"
}