{
    "url": "https://support.google.com/pixelphone/thread/104818903/echo-during-calls-%D0%AD%D1%85%D0%BE-%D0%BF%D1%80%D0%B8-%D1%80%D0%B0%D0%B7%D0%B3%D0%BE%D0%B2%D0%BE%D1%80%D0%B5-%D0%A1%D0%BF%D1%96%D0%B2%D1%80%D0%BE%D0%B7%D0%BC%D0%BE%D0%B2%D0%BD%D0%B8%D0%BA-%D1%87%D1%83%D1%94-%D0%B5%D1%85%D0%BE?hl=en",
    "title": "Echo during calls. Эхо при разговоре. Співрозмовник чує ехо.",
    "content": "Echo problem on my Google  Pixel  3 XL 128gb imei 990012011057590.\n\nWhen calling people, sound quality on my end is fine but the quality on the receiver's end is hearing echo. It disappears after 30 sec when speaking with Phone app. It also works with Signal call, Signal video call, Viber call. And it is least annoying  for my receiver when I down the volume of the call.\n\nI tried -\n1. Change sim card\n2. Check for latest updates apps and android\n3. Take off any cases\n4. Turn off Bluetooth\n5. Reboot into Safe Mode\n6. Factory reset\n7. Updating Android with a help of ADB and USB cable and flashed A and B slots. So unlock and then lock bootloader.\n8. Tried different aps which tested hardware and no problems find.\n9. Changed LTE to H+ also in Ukraine ower operators doesn't have VoLTE so any manipulation with it will not work too.\n10. The Phone did not drop.\n11. I checked and read all messages -\n\nhere\nhttps://support.google.com/pixelphone/forum/AAAAb4-OgUsYCbNdF9b1ts/?hl=en&gpf=%23!topic%2Fphone-by-google%2FYCbNdF9b1ts%3Bcontext-place%3Dtopicsearchin%2Fphone-by-google%2Fcalls%257Csort%3Adate\n\nhere\nhttps://support.google.com/pixelphone/thread/78393240?hl=en&msgid=78393240\n\n\nhere\nhttps://www.reddit.com/r/GooglePixel/comments/9w30ee/call_quality_issues_pixel_3_xl/\n\n\nhere\nhttps://support.google.com/pixelphone/thread/1414303\n\nhere\nhttps://4pda.ru/forum/index.php?forums%5B%5D=863&topics%5B%5D=915369&act=search&source=pst&query=%FD%F5%EE\n\n12. *#*#4636#*#* and change protocols\n\nNothing help.\n\nWhen i close down mic and speaker more echoing on another side(receiver side). So i speak a little time with rear mic out of face and then 30 sec later use as normal. I think it is issue with software. Because hardware checked and it is alright.\n\nMy mother using Pixel 2 XL and she is very happy, no problems with it. I bought my (new) month ago and have this issue through the box. I like everything of this Pixel  3XL but this thing is killing it as phone  so  not working as actual telephone. It has call quality issues.\n\nI live in Ukraine so i cannot send phone to google to change it or repair. Our repairing masters dont know what issue.\n\nI like this phone very much and believe that Google will do something with new Android 12. I think also can do app that will turn off(with myself programally) some of the speakers or mic when calling. I think it can help too. Find out what speaker or mic has issue and turn it off in Phone app with a help of another app. So maybe create something this. You have this app(button https://www.youtube.com/watch?v=2_rRFsZCAFk  4. Locate and go into the \"Developer Options\" menu [01:40] 5. Scroll down and tap on the \"Quick Settings Developer Tiles\" option [02:07] 6. Enable the \"Sensors Off\" toggle) in developers mode...but it turning off all sensors and mics. We need to turn off only one and the problem will solve i think. Need a fix for echo during calls!!! This phone are too good for this little bag.\n\n\n\nПроблема с эхом на моем  Goggle Pixel 3 XL 128gb imei 990012011057590.\n\nКогда я звоню людям, качество звука на моем конце хорошее, но качество звука на стороне получателя слышно эхо. Оно исчезает через 30 секунд при разговоре с приложением \"Телефон\". Проблема также есть с Signal вызовом, Signal видеозвонком, вызовом Viber.\n\nИ меньше всего раздражает моего  получателя, когда я уменьшаю громкость разговора.\n\nЯ старался -\n1. Поменять сим-карту\n2. Проверял последние обновления приложений и Android.\n3. Снимите все кейсы.\n4. Выключал Bluetooth.\n5. Загружал в безопасном режиме.\n6. Восстановление заводских настроек\n7. Обновление Android с помощью ADB и USB кабеля и прошитых слотов A и B. Так что разблокируйте, а затем заблокируйте загрузчик.\n8. Пробовал разные приложения, проверял оборудование(железо) и никаких проблем не обнаружил.\n9. Сменили LTE на H +. Также в Украине у других операторов нет VoLTE, поэтому никакие манипуляции с ним тоже не работают.\n10. Телефон не ронял.\n11. Проверил и прочитал все сообщения -\n\nздесь  https://support.google.com/pixelphone/forum/AAAAb4-OgUsYCbNdF9b1ts/?hl=en&gpf=%23!topic%2Fphone-by-google%2FYCbNdF9b1ts%3Bcontext-place%3Dtopicsearchin%2Fphone-by-google%2Fcalls%257Csort%3Adate\n\nздесь https://support.google.com/pixelphone/thread/78393240?hl=en&msgid=78393240\n\nздесь https://www.reddit.com/r/GooglePixel/comments/9w30ee/call_quality_issues_pixel_3_xl/\n\nздесь https://support.google.com/pixelphone/thread/1414303\n\nздесь https://4pda.ru/forum/index.php?forums%5B%5D=863&topics%5B%5D=915369&act=search&source=pst&query=%FD%F5%EE\n\nНичего не помогло.\n\nКогда я закрываю нижний микрофон и динамик, на другой стороне (стороне собеседника) большое эха. Так что я немного говорю с отодвинутым микрофоном, а затем через 30 секунд использую как обычно(держу ровно). Думаю, проблема в программном обеспечении. Потому что оборудование проверено, и все в порядке.\n\nМоя мама использует Pixel 2 XL, и она очень довольна, никаких проблем с этим. Я купил свой (новый) месяц назад, и у меня проблема с коробкой. Мне нравится все в этом Pixel 3XL, но эта штука убивает его как телефон, поэтому он не работает как настоящий телефон. У него проблемы с качеством звонка.\n\nЯ живу в Украине потому выслать на ремонт или замену телефона нет возможности. Местные мастера не знаю причин этого бага.\n\nМне очень нравится этот телефон, и я верю, что Google что-то сделает с новым Android 12. Я думаю, что также может сделать приложение, которое отключит (программно) некоторые динамики или микрофон при звонке. Думаю, это тоже может помочь. Узнать, с каким динамиком или микрофоном возникла проблема, и отключить их в приложении \"Телефон\" с помощью другого приложения. Так что, возможно, создадим что-нибудь это. У Вас есть приложение(подменю https://www.youtube.com/watch?v=2_rRFsZCAFk  4. Locate and go into the \"Developer Options\" menu [01:40] 5. Scroll down and tap on the \"Quick Settings Developer Tiles\" option [02:07] 6. Enable the \"Sensors Off\" toggle) в режиме разработчика которая отключает все сенсоры и микрофон. Но надо отключить только один забагованый микрофон и проблема решиться. Нужно исправить эхо во время звонков!!! Этот телефон черезчур хорош для таких мелких проблем.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3 XL",
    "post_time": "2021-04-02T19:30:45.057262+00:00",
    "reply": "0 Replies"
}