{
    "url": "https://support.google.com/pixelphone/thread/12996464/google-customer-service-not-standing-by-their-product-within-warranty-ridiculous-customer-servic?hl=en",
    "title": "Google Customer service not standing by their product within Warranty !!! Ridiculous customer servic",
    "content": "Customer Service Sucks !!! Totally not upto Google Standards !!! Also not willing to stand by their products !!!\n\nI've an unlocked Google Pixel 2 phone which I was using in Sprint for past 8 months. The phone went dead all of a sudden & it will not turn on. Contacted the customer service & got a replacement. All good so far. Now the fun begins. The replacement phone that I received was a refurbished but also locked device to another carrier (Verizon, which I was told later after a week). I tried contacting Sprint to activate my new replacement device & to my surprise this was not compatible. I raised a ticket with Google customer service & Was asked to wait for 24-48 hrs & then will manually add it to sprint server. I was also promised a call back. Since I didn't receive a call back, I called the customer service & was confirmed that the ticket is still open & has been assigned to the senior technician to fix the issue. Was asked to wait for another 6-8 hrs & then call back. Now called 3rd time & the representative is recommending me a solution ...which is as follows : \n1) Despite being a Sprint Customer, with my active number with Sprint, I need to take a new Verizon account (Prepaid / Post paid)\n2) After fulfilling Verizon's unlock policy requirements, request for an unlock code from Verizon & get the device unlocked. \n3) come back to Sprint now with my original number (possibly after 2-3 months) to start using the original number. \n\nAll of this just because the Google customer service is not able to get an replacement unlocked / Sprint compatible device !!! They don;t seem to care about Customer service experience in the above process of changing carriers. \n\nThis is not an acceptable solution or answer from a trust worthy & a reputable company like Google. Need help with priority resolution of the issue as I am still paying for my service & without a phone for almost 3 weeks now. \n\nHope someone at the leadership level understands the urgency of this situation & help resolve this issue.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-08-28T04:25:35.399708+00:00",
    "reply": "7 Replies"
}