{
    "url": "https://support.google.com/pixelphone/thread/55712290/how-many-months-to-replace-hot-as-f-phone-it-s-going-on-7-k-thanks?hl=en",
    "title": "HOW MANY MONTHS TO REPLACE HOT AS F PHONE. IT'S GOING ON 7 K THANKS",
    "content": "Why does google continue to disappoint?\n\nPixel 3 - people couldn't hear me well on calls. It's a phone that was known for not doing the one thing it's designed to do: be a phone.\n\nPixel 4 - got mine Dec 2. It started running hot as hell, especially when copy pasting in to the Google search bar. It would freeze and crash, I would copy paste again into the Google search bar and it would freeze and crash, then we got hot as hell, then say \"Google keeps stopping\" crash, then I could paste. This happened every time without fail. At minimum google as a company has one main function, that is to search. Now the phone is just hot all the damn time. Half the screen is slightly blue, it flickers on chats, this is all good stuff. I'm using the cases on your guys'website. When I take off the case the phone is so slick it just slides off, off of anything, doesn't matter. Voice texting went to trash REAL fast. Thanks. This phone is too hot to hold and voice texting doesn't work. (You guys sent a replacement btw after 6 months and it didn't stay on, I had to send it back. You guys signed for the return on Monday, it's Friday...why am I the one checking in on the status of the new replacement? The specialist has to wait for me to notify them before they investigate?)\n\nSINCE IM HERE:\n\nGoogle maps: There also should be away to turn off those road rage inducing traffic notifications. I KNOW it thinks it is the fastest route, it better be that's the default program in the app. I KNOW there's traffic, I KNOW how long it takes. I LOOKED it up before I said to start navigation. I can SEE the traffic. That's what the red bits on the map is for. Why do I need 3 announcements once I start?! Shut it! It is SO loud and SO jarring, waiting for turn by turn navigation then \"THERE'S A SLOW DOWN AHEAD\" yeah I am in real life too! I see the traffic. I live in Los Angeles, every few minutes is THERE'S A SLOW DOWN AHEAD, yeah bud we know that. This is not defcon 3 scenario stop distracting me while I drive to tell wtf I should be SEEING when I drive. Doesn't this contribute to the problem of people not paying attention to the road when they are driving because they expect technology to do it for them? Waze lets us turn off those alerts and keep the turn by turn only, you guys own Waze, figure it out please. \n\nNotification volume: Why did the ability to reduce the volume of specific notifications go away when you guys \"simplified\" the sound bar over a year ago? Everything is either one set of sounds is way too quiet and the other is LOUD, it actually hurts my ears, but we can't change it anymore. The navigation \"soft\" voice is ridiculously loud compared to any other sound operating at the time of use in my phone or the buds, this also used to be a stand alone volume option. \n\nPixel Buds: I'm not super thrilled with the pixel buds (they completely fell apart, the silicone outside pulled away and the mesh fell out. The notifications sounds are deafening, it doesn't read my texts when I ask it too after it tells me there's a new one). I just got the pixel buds 2 to replace my torn apart ones and they are comically staticky. The audio remixes on it's own. Sudden echo on a podcast, awesome ðŸ‘ðŸ½\n\nGoogle podcasts app: how do you go from a usable very basic feature that already exists in play music and then make a worse stand alone app??? \n\nMini: I'm so glad I got this for free because I only use it to tell me the weather and set timers. Google assistant is not learning as promised. The home mini (everyday asking the exact same sequence of questions \"what's the weather\" > \"will it rain\" > \"what's the humidity\" > \"YES\" I've had this since launch and it has yet to figure out I want the whole weather report, nor can I make it a default). Also my assistant devices do not work well together. The devices still fight over which one will answer my question, sometimes the answer is read out loud when I'm looking right at my phone but when I'm in car mode, driving, or not touching a device on purpose with the screen locked it'll give me the \"here's a webpage\"  response, great cool thanks. I wasn't looking at my phone on purpose, now I have to look at it. When I ask a question to look up, maybe as simple as webpage I do want to see or an address, it's read out loud what the hell y'all?\n\nGoogle photos: Selecting multiple photos is tedious as hell. Come on. Building a collage is not flexible. Editing a photo in phone takes unnecessary hurdles, I should just click the photo, click edit and have ALL the edit options right there.\n\nWear OS: Also fights with the other assistants. Deleting inaccurate work out logs not possible. It freezes alot, crashes, overheats, all on par with the slick, impressive, google pixel 4. \n\n-I can import information from sheets to my calendar but not my calendar to sheets?\n\n-Why can't I limit which devices people have control over in my home network? I want to let my guests use the cast without also having control over my home mini speaker that is in my room. \n\nWho are your focus groups? Do they want to unify their lives with google because the current (lack) of inter-connectivity in the whole google world of apps and devices sure as heck doesn't feel like it. What on earth is happening over there? I'm giving up my data for this? At least make my life easier if you're going to collect data, put that collection to use. Run a test group of normal google users. People who rely on these things working to literally do their job, this is an investment for occupation, life management, not for just having shiny gadgets. Make them, make sense. This is costing us a lot of money for you guys to be so chronically disappointing. \n\nYour rep who keeps telling me everything will be fine, and the phone isn't that hot, it's not that bad so I sent ya'll a video of me using a thermometer on my phone showing it's 109F TO THE TOUCH...no thank you. \n\nAlso get a damn phone number. It hurts to hold my phone, so thanks for keeping this whole experience very physically painful.\n\nShout out to Andy G, the only rep who felt my pain of how stupid this whole experience has been. Too bad they're not a specialist so they can't help me ðŸ™ƒ",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2020-06-26T18:47:09.279907+00:00",
    "reply": "1 Reply"
}