{
    "url": "https://support.google.com/pixelphone/thread/9060929/calendar-notifications-on-lock-screen-won-t-away?hl=en",
    "title": "Calendar notifications on lock screen won't away",
    "content": "I'm going to assume this is a bug, but just in case I'll ask.\n\nFor my calendar events that I have notifications set up for, as the time approaches and I have it set to remind me, and for the event itself, the notification will come up on the lock screen and I cannot remove it except for rebooting the phone.\n\nLet me give an example to clarify my above statement.\n\nIf I have a doctor's appointment for Wednesday at 1 pm, with a reminder 1 hour before, my Pixel 3a will pop-up a notification on my lock screen at 12 pm reminding me of my doctor's appointment.  Well, I don't really want anyone who glances at my phone to see about my doctor's appointment, so I want to clear it from the lock screen, but I can't.  I select the notification reminder and unlock the phone, and it doesn't come up.  I pull down from the top of the phone for my notifications and the reminder appointment is not there to be dismissed.\n\nNow comes the even stranger part.  After the reminder period has passed, and let's say it's now the actual appointment time (so 1 pm), the reminder is gone but the actual appointment is now showing.  I now unlock the phone, swipe down on the notification bar, and there is my appointment now showing up, so I now dismiss it, lock my phone, and it's still showing up on my lock screen.  I have dismissed the item at this point, but it's still showing on my lock screen.  I felt I needed to say that twice.\n\nThe only way I was able to get rid of it was to reboot my phone, and now it's gone.\n\nI feel this has to be a bug, but I want to ask in case there's something I'm missing.\n\nDoes anyone have any ideas to this?\n\nThanks in advance!",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-07-01T16:09:55.770973+00:00",
    "reply": "1 Recommended Answer"
}