{
    "url": "https://support.google.com/pixelphone/thread/21144303/recover-photos-suddenly-lost-from-photos-app?hl=en",
    "title": "Recover Photos Suddenly Lost From Photos App?",
    "content": "Since I can really only find one other post on this and Google support by phone had no clue what happened I'm going to post here.\n\nLast night my wife asked me to email a picture to her. I opened the photo from the camera album in photos and shared the photo to gmail and sent it to her, which she said she didn't have an attachment. I tried again as watched as I did it. When gmail opened it said, \"file could not be attached\". I then opened the photo from the album again and swiped up to see the details. The file size was 0 bytes, which seemed very strange. I then did a normal restart on my phone and went back to the same photo. This time when I swiped up to see the file size my phone starting quickly flashing through photos, about one each 1/4 of a second. When I finally got my phone to go to the home screen I went back in to my camera album and every photo from the last year was gone.\n\nTo answer, no, my backup was not turned on so please move beyond that. Google support by phone last night had no answer other than to have me search for a video on YouTube that ended up being an ad for some software, which I thought was pretty unprofessional. They honestly act like this had never happened and have no idea what occurred. \n\nThere must be a way to run a legitimate data recovery on my phone, right? My storage dropped by about 15Gb when this happened. The data has to still be there. I tried a basic recovery app from the play store and as it ran I could see thumbnails of the missing photos but the app was so garbage it either didn't complete or is a basic version to have you buy the upgrade one. \n\nHas anyone else seen this situation or know if there an actual way to run a recovery on the data?",
    "is_img": 0,
    "category": "Camera, Google Pixel 3",
    "post_time": "2019-11-25T19:11:07.994668+00:00",
    "reply": "4 Replies"
}