{
    "url": "https://support.google.com/pixelphone/thread/107965265/do-not-validate-enterprise-wifi-option-no-longer-available-will-this-feature-arrive-on-all-androids?hl=en",
    "title": "Do not Validate Enterprise WiFi option no longer available, Will this feature arrive on all androids",
    "content": "I recently switched from Pixel 2 to the new Pixel 4a. It got updated to Android 11 quite early but then this weird nightmare started. After installing the December update (Build ID: RQ1A.200720.009), Google made an official policy that it would not allow users to connect using the DO NOT VALIDATE option in the wifi settings (link for this information: https://support.google.com/pixelphone/answer/2844832?hl=en scroll to the bottom to see this) because of security reasons mentioned in the aforementioned link. I want to know that will this change be brought to ALL android phones that have OS update support?\nThis request may sound absurd but there’s a very valid reason for this. In my country, a lot of people on samsung’s, and that applies to my university as well. The IT dept. at my uni was not ready to make such a big change to their enterprise wifi because only 2 people owned a pixel in the whole place, the rest own samsungs, which aren't running the latest pixel updates yet, and iphones which don't have this problem. Now before I change my phone, which I bought from my hard earned savings, I want to know whether if Samsung phones, and other android phones, have or will likely receive that particular update, because if that’s the case, I can wait till this becomes a widespread update and my university is forced to change their wifi system. After all, this is the very reason why google released this update: to push organisations to push for higher security measures. I would be SO GRATEFUL of someone can help me with this.\nI want to know that such deeply embedded system changes in android APIs, do they always arrive on other android phones which receive the latest updates? Sooner or later?\nThanks in advance, bless you!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a",
    "post_time": "2021-04-29T02:26:49.491272+00:00",
    "reply": "2 Replies"
}