{
    "url": "https://support.google.com/pixelphone/thread/2456747/my-1st-gen-pixel-xl-reading-no-sim-card-now?hl=en",
    "title": "My 1st Gen Pixel XL reading no SIM card now?",
    "content": "I purchased a second-hand 1st gen Google Pixel XL 'Really Blue' (such a beautiful phone btw) about 1.5mo ago and everything was working 100% when I purchased it. I was primarily going to use this phone simply because of the camera, which 1000% better than my Note 8 daily driver. However, after a week of reminiscing of when I owned the smaller Google Pixel in the same color. The UI, the quality, honestly the overall everything of the phone is just so pure and far more enjoyable than any phone I have used to date. This meant going back and forth between using my Note 8 and the Pixel XL as my daily drivers, which meant I would be able to use the phone for calls, text messaging, and data. All of that worked good and fine up until about 2 weeks ago now. It is tragic to say the least, but it is far worse: now I cannot use the phone period anymore since having the issue aforementioned as my title.\n\nI have literally tried everything under the Sun for troubleshooting, even going as far to unlock the bootloader, flash previous versions of Pie and I went as far as flashing 8.1 Oreo. I figured it was a software issue hence why I went that far and the reason I went that far is because the other day, I inserted my Verizon SIM from my Note 8 and I say the service icon in the status bar show up for a split second, and then disappear as soon as it popped up. So, something is sort of working, but not. It could be hardware; it could also just simply be software. Oh, no water/moisture damage and I have not dropped it since I had it. The previous owner did, but again, it worked fine even so.\n\nAgain, I purchased this second-hand as a private sale, not through my carrier. Going to them would be futile in essence simply because Verizon enjoys making their customers jump through hoops. I digress... I have referred to XDA and Google Search in an attempt to find someone with the same issues I am having and then I stumbled across the Pixel Community Hub (this wonderful place) and found that my issue is apparently a big issue. I am posting another thread simply because I was not satisfied with the answers I was reading. I am looking for a somewhat more advanced answer I guess, if I can even get one. I am considering to root my device and see if that helps and try to dig through system phone/modem apps and sort out the issue (if even possible). Honestly, the SIM reader could just be broken, but this was a last chance effort before I give up 100%.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-03-15T15:23:13.311878+00:00",
    "reply": "1 Recommended Answer"
}