{
    "url": "https://support.google.com/pixelphone/thread/18495105/pixel-4xl-docked-to-pixel-stand-ambient-light-changes-wake-the-phone-unintentionally?hl=en",
    "title": "Pixel 4XL docked to Pixel Stand: Ambient light changes wake the phone unintentionally",
    "content": "Cant reach towards the phone without it waking up which makes using the stand apps useless and just makes this an expensive charger.\n\nPrevious title was \"Pixel 4XL motion sense turned off but it still works when the phone is docked to a Pixel Stand.\"  Now discovered to be how the ambient light sensor works only when docked.\n\nFirst i setup my 4XL the way I preferred which was to have no face unlock attempt done without pressing the power button first to get the lock screen (ambient display always on, lift and reach to check phone off, show display when nearby off, with motion sense on so i could snooze alarms and skip songs using the pixel stand special screens with hand swipes).  I set it up this way so i choose when the lock screen appears as opposed to an automatic sensing option.  I noticed with most of the pixel stand utilities when docked that moving my hand close to it woke it up to the lock screen and then seeing my face since i was right there on my nightstand and going to my home screen when it wasn't wanted when i simply wanted to interact with the pixel stand utilities.  It happens on the photo frame, sunrise alarm when it would start to light up 15 mins before the alarm, and with the media controls that pop up for supported apps like when I'm running google play music.  I would move my hand close to snooze the alarm or change tracks with motion sense swipes but on many occasions it would register the same as a \"reach to check phone\" which brings up the lock screen and again unlocking it and removing what i wanted to interact with. \n\nGetting frustrated with this I tried a quick test.  I went into settings>system>motion sense and turned it off completely as you can see here.\n\n\n\nThis issue only happens when docked to the stand and no motion sense features work when the phone is just in my hand.  Even with this option turned completely off when my docked phone would show the pixel stand special app screens, moving my hand towards the phone and not touching it at all would still pull up the lock screen so the motion sense radar is still on and registering movement.  Of course with motion sense off i couldn't swipe anymore to snooze the alarm or change music tracks defeating why i bought both items but somehow the \"reach to check phone\" ability is still working.  I've forgotten the pixel stand in connected devices and set it up fresh and the behavior continues. \n\nUltimately I just want to use all the features the pixel stand provides without the phone going to the home screen. I want the stand to do more than just charge given its abilities.  If you have a pixel stand turn off motion sense and try this for yourself.  I can reproduce it everytime.  On a side note i'm really curious if this behavior happens in those countries where motion sense is turned off.  Even with motion sense off, is the radar still emitting using power and just not registering the gestures?  I really like the motion sense gestures and want them to work with the stand apps without it unlocking the home screen over and over again.  Any help would be appreciated.",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2019-11-04T03:53:25.4759+00:00",
    "reply": "6 Replies"
}