{
    "url": "https://support.google.com/pixelphone/thread/3987897/can-a-non-admin-user-sign-onto-device-without-requiring-the-admin-pin-first?hl=en",
    "title": "Can a Non-Admin user sign onto device without requiring the admin PIN first?",
    "content": "I have a Pixel 2XL that I plan to provide to my daughter. I don't want her account to be the admin on the phone, I want it to be mine so that I can apply parental controls without the possibility of her disabling it. I have setup the phone as follows:\n\n1. Logged onto the device using my google account. I then add her google account as well (because we're using google fi and can only have one line per google account, so I need her account on my admin user so the line works).\n2. I go to Settings -> System -> Advanced -> Multiple Users and create a new user for my daughter, turning on phone calls & SMS as well.\n3. I setup her user by signing into her google account. She has her own PIN, different from the admin account.\n\nSwitching between users, phone calls and text messages all work fine. The problem is when the phone is restarted. The phone demands I enter the \"admin\" user account PIN before I can do anything else. I try swiping down on the top menu, selecting the \"person\" icon, and I can see her user account as an option, but it's grayed out and tapping it does nothing. The only thing I can do is select the admin user and enter that PIN. After this is done, I can then switch to her user without issue.\n\nNeedless to say, my concern is if she's out and happens to restart the phone (runs out of battery, perhaps a software glitch crashes the device, whatever), that I would have to provide her the admin pin in order for her to use the phone again. This defeats the purpose of creating an account for her to begin with.\n\nIs there any way to allow her to sign onto the device post-restart without having the admin enter a PIN first?",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 2",
    "post_time": "2019-04-11T15:20:13.608192+00:00",
    "reply": "1 Recommended Answer"
}