{
    "url": "https://support.google.com/pixelphone/thread/70312024/pixel-connectivity-to-hearing-aids?hl=en",
    "title": "Pixel connectivity to hearing aids",
    "content": "My ReSound LiNX Quattro hearing aids connect fine.  Tthey were the only android supported when I purchased back in Jan, that is why I bought them.  My audiologists told me that ReSound had a 6month exclusive agreement with Google and I can see that there are now more supported HAs.  I was hoping in that time period Android support would improve but does not appear so.\n\nI am having two really annoying issues.\n1-when connected I do not get alerts.  sometimes I will get the last nanosecond of an alert in my hearings aids OR the hearing aids will go momentarily quiet.  I'm guessing that the alert is getting issued before the connection can be completed.  When I disconnect the HAs the alerts come thru loud and clear.  Most of the time I will not get ring tone for an incoming call and for an outgoing call will not hear anything until the connection is made with the person or their VM.\n2-When my car is connected (via BT) the sound is inconsistent.  Sometimes it will come thru the HAs and sometimes it will go thru the car spkr.  Calls as well.  The result is that I have to manually disconnect the HAs for the sound/calls to come thru the car.  You would think there would be a setting to automatically do this, ie, why would I want sound to come thru the HAs in the car especially when an incoming call does NOT turn off an media sound to the car.  When I use Android Auto (via USB/BT) the issue is the same.\n\nI just tried google support - totally worthless.  Had me forget all BT devices and dropped off the chat before I could reply.  \n\nI think these issues just reflect very limited support for HAs.  So disappointing.  I am not an Apple person but can tell from my wife's phone there are much more support options.\n\nIs there a forum where we can lobby Goggle for better support?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a XL",
    "post_time": "2020-09-10T16:07:30.932852+00:00",
    "reply": "0 Replies"
}