{
    "url": "https://support.google.com/pixelphone/thread/24570682/issues-with-phone-calls-voice-and-not-on-apps-like-whatsapp?hl=en",
    "title": "Issues with phone calls (voice and not on apps like WhatsApp)",
    "content": "Hi\n\nAnyone experiencing continued problems with voice calls?\n\nSo the problem i'm getting is that when i'm using the phone in my office (and many other locations too) people can't hear me.  They complain that i'm either too quiet or in a tunnel, so i have to find a decent spot, don't move and shout to be heard.\n\nBut's it's not the network.  Am also having to use an old Samsung Galaxy S5 and it's as clear as anything, no issues.\n\nI had a situation yesterday when a customer couldn't hear me on a normal voice call and we had to switch to a WhatsApp call, which was totally clear.\n\nAnd it's not a one off Pixel 3 phone either.  Been in touch with support, who are all very friendly and help out but all i end up is going through various steps like updating the phone, go into safe mode and then reset the phone.  Still with no solution in site.\n\nAnd so i've followed the next step of sending it back to them and getting a replacement.  Three times!  So i've had four Pixel 3s with exactly the same problem.\n\nAnd today's offer by the support team, who promised to \"look at all the options available once we've gone through the process\", is to yet again offer another replacement.\n\nI'm not sure when this will get resolved, if ever.  10 phones?  15 phones?  Or perhaps wait until it goes out of warranty and then it's not a Google problem any more.\n\nBeen told that as i bought it through a retailer, nothing else can be done.  Of course something else can be done (they make a few billion profits don't they?!?!) but that's the standard line i'm being fed.\n\nI'm really not sure anyone can help but here goes a post anyway!\n\nCheers\n\nNigel",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3",
    "post_time": "2020-01-03T16:02:00.213712+00:00",
    "reply": "0 Replies"
}