{
    "url": "https://support.google.com/pixelphone/thread/111778932/audio-will-play-in-the-right-channel-only?hl=en",
    "title": "Audio will play in the right channel only",
    "content": "I prefer to have my music downloaded to my phone. I'm not sure when this problem started, but I first noticed it a while ago. My music will only play on the right audio channel. Let me correct that. It will play maybe 5% on the left.\n\nHere is a screen recorded example of what happens https://imgur.com/gallery/fGOvESY \n\nIn that video I am playing over the built in speaker. When I used Bluetooth headphones all the audio is the right headphone. When I connect to my car, same thing. When I plug in and connect to my wife's brand new car and play via USB-C Android auto, all the audio goes to the right side speakers. Attempting to move the balance to the left side only results in the audio fading away.\n\nI initially thought the problem happened when I transfered the music from my plex server to my laptop so I could organize it. But after checking all the tracks I checked had no issues with balance and played fully on both or either channels.\n\nI did some googling, saw some people had some success with doing a factory reset. But before that I tried asking Google for help. Went through three levels of support before they eventually hung up on me.\n\nDid the factory reset, and still have the problem. Decided to download a track from my phone back to my laptop to see if maybe in the transfer/sync the file got altered. Nope. Plays perfectly on the laptop. \n\nThe issue occurs in three different Bluetooth headphones and two cars. It happens with youtube, YouTube music, VLC, and media monkey.\n\nWeirdly, it doesn't happen with downloaded podcasts on podcast addict.\n\nOK. That's everything I've tried to troubleshoot and figure out how and where this is happening.\n\nAny help is welcomed. Thank you.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-05-30T19:21:44.413579+00:00",
    "reply": "2 Recommended Answers"
}