{
    "url": "https://support.google.com/pixelphone/thread/88694991/why-are-selfies-still-being-retouched-with-retouching-disabled-on-front-camera?hl=en",
    "title": "Why are selfies still being retouched with retouching disabled on front camera?",
    "content": "Selfies taken using the front camera on my Pixel 5 are being noticeably retouched during image processing, despite face retouching being disabled on my device. It's unclear if this is a bug or intended camera behavior.\n\nI've done some testing on my own and observed that selfies taken with the front facing camera undergo the following changes even with retouching disabled:\ngeneral loss of sharpness (smoothing of skin)\nremoval or reduction of visible blemishes\nconsiderable lightening of skin tone\n\nThe result, after processing, is a photo that often looks unnatural, waxy, and overcorrected.\n\nIn my own testing, enabling retouching caused the same changes listed above, but moreso. I've also determined that this is not due to the portrait lighting feature, since turning this feature off in google photos produces the original retouched photo.\n\nIn addition to feeling like unintended behavior, since the change is highly noticeable and fairly drastic,  it also flies in the face of Google's recent, highly-publicized decision to disable retouching by default on its devices. Unwanted facial retouching can be highly damaging to users' self-image, and it's also causing a general lack of image fidelity—my face looks less detailed, as if the image quality has been downgraded by the device.\n\nI'm including some samples of my testing here:\n\nThe first photo is a side-by-side comparison of the before and after images. The top photo is the original image, pre-processing (Screenshot taken from the gallery). The bottom image is the retouched selfie.\n\nThis is the processed and visibly retouched image, by itself:\n\n\nNote the general lack of fidelity when comparing the final image to the original.\n\nFinally, I have attached a recording of my camera app, documenting the process of taking a photo, viewing it in the gallery app, and the image dramatically changing when processing is complete. Note that my face is a completely different tone.\n\nI've discussed this with other pixel users, who have described similar results with their own photos: a loss of image quality, unnatural looking photos, feeling like a mask is being applied to their photos taken with the front-facing camera. This is a worrying trend for me, and for these other users, because it suggests google has incorporated facial retouching directly into its HDR+ image processing where it cannot be disabled by the end user.\n\nIs this behavior intentional? It seems antithetical to google's own public positions on facial retouching. I'd appreciate feedback from other users about this.",
    "is_img": 1,
    "category": "Camera, Google Pixel 5",
    "post_time": "2020-12-15T06:36:09.178997+00:00",
    "reply": "0 Replies"
}