{
    "url": "https://support.google.com/pixelphone/thread/43600848/i-cannot-change-or-add-any-custom-notification-sounds-in-android-10-on-my-pixel-3?hl=en",
    "title": "I cannot change or add ANY custom notification sounds in Android 10 on my Pixel 3",
    "content": "Title says it all. Please note that before I updated to Android 10, this worked just fine with the exact same custom tones.\nPixel 3, Android 10, latest security/Play patches, all apps up to date\n\nI already know how to make and add my own ringtones and notification tones, have been doing it on every Android phone I've ever owned going back to my Moto Droid. Adding custom ringtones works fine, but I cannot change a single notification tone (Messages, GMail, etc.) away from the default; even the builtin sounds don't work, only the single default one (which is Popcorn on my phone).\n\nI can create and add custom notification tones to the phone itself, and they even show up under \"My Sounds\" when going to change the tone, but when I tap on the new sound, nothing plays (should play a preview of the tone). Moreover, if select any of the builtin Google tones, same result: no sound. If I tap back to the default, it plays the preview sound. If I leave it set to my custom sound (or another builtin that isn't the default), I simply get nothing when that particular notification comes in. I tested this in Messages, GMail, Outlook, and Discord, so it is also not specific to only GApps.\n\nIt seems like the issue is with the new Notification system in Android 10.\n\nWhat I've already tried:\nFactory reset, whereby I immediately tested this before restoring anything, so none of my apps can possibly be causing this. This should have fixed if it was an issue I caused; this points me towards Android 10 itself as the culprit\nPrior to my factory reset, I tried the following:\nI've tried .mp3, .ogg, .flac, and .m4a formats for the custom tones, all the same result\nI cleared all cache/data of every app I could think of (Messages, GMail, Sounds, etc.)\n\nAny help is greatly appreciated....having custom notification sounds for the different apps has always been one of my favorite things about Android, and now that every app has the same notification sound...ugh.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 3",
    "post_time": "2020-05-01T02:21:36.541933+00:00",
    "reply": "7 Replies"
}