{
    "url": "https://support.google.com/pixelphone/thread/67459640/battery-charge-level-and-hotspot-usage?hl=en",
    "title": "Battery charge level and Hotspot usage",
    "content": "Pixel 4 XL has some issues with charging and hotspot (always on LTE). My observations are as follows:\n\n1) The phone was at 100%, and still present on the wireless dock (Pixel Stand). Turned on Hotspot and was downloading a few things (at a speed of 1-2 MB/s for most of the time, sometimes beyond 5MB/s). After some 10 mins, the charge starts reducing to 99%, 98% and keeps going down (and also the device heats a little, I agree with heating using hotspot). But even when the heat is negligible, wireless charging is unable to go forward. I was at least expecting it to stay at 100% because Pixel Stand outputs 11W.\nTried this many times with different charge levels, all the time the charge reduces.\n\n2) The phone was at 20%, plugged in the wired charger. For the entire 90 mins duration of hotspot usage, the charge increased from 20% - 23%. This is frankly shocking, given the output is 18 W charger and it managed to raise only 3%. Repeated this numerous times at 50%, 35%, all the time the maximum increase during hotspot usage is 5%.\n\nBefore buying the Pixel 4 XL, was using the HTC U11. It also comes with an 18W charger. I remember my HTC charging fast enough as I use the hotspot. I wanted to repeat it again and tried with my HTC U11. At 20% turned on the hotspot and connected wall charger. It went to 50% in approx 35 mins and it continued to fast charge. \n\nAs I type this right now, have been using Hotspot over the past 2-3 hours, the device is on PIxel Stand and the charge is now at 40%, the original charge level was 92%.\n\nRight now using Android 11 beta 3 on Pixel 4 XL. But, I have been observing this issue right from Day 1 of Pixel 4 XL.\n\nSuggestions please and is anyone else facing this issue?",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4 XL",
    "post_time": "2020-08-27T18:33:22.126601+00:00",
    "reply": "2 Replies"
}