{
    "url": "https://support.google.com/pixelphone/thread/109726480/files-app-has-taken-over-in-app-image-browsing?hl=en",
    "title": "\"Files\" app has taken over in-app image browsing?",
    "content": "Starting this morning, when I try to browse/send an image file from an app that \"extends\" to an external image browser (ex. Discord, Hangouts) instead of the normal prompt to choose an app to browse with (Photos, Gallery, assorted gallery apps, etc) I just get bumped right into the default Android \"Files\" app and am forced to browse through there.\n\nStuff I tried:\n-Checked that Files app to make sure it's not set as default in any way\n-Attempted to set any of the other photo-viewing apps as default (couldn't find a way to do so in Android Settings or their individual app settings)\n-Un-installed and re-installed both Discord and a few gallery apps\n-Checked inside Discord and Hangouts to make sure they didn't have a setting to default to the files app (they don't)\n-Attempted to disable/roll-back/uninstall the \"Files\" app (did a roll-back, but no change)\n-\"Reset app preferences\" from the Android SETTINGS menu\n-rebooted the phone multiple times in between these steps to make sure it wasn't holding onto cached data\n\n\nNone of these seemed to have any effect.  When bumped into Files from Hangouts, I do see a few options along the top bar to \"Browse Files in Other Apps\" with other gallery apps listed, and tapping one of those brings me to a screen is more in-line with what I want, but that option doesn't appear in Discord.  Initially I thought it might be a Discord-specific problem, but since Hangouts does the same thing I'm inclined to think it's deeper in the system.\n\nI generally don't keep a 'default' app for opening several kinds of options as I prefer to be prompted so I can choose the right tool for the job, but now I'm defaulted to a rather limited view with a layout that isn't ideal for browsing.  I haven't installed any system updates for a week or so, and I don't see any auto-updates from the Play Store to Files, so not sure where this came from.  Maybe some sort of library update on the back end?  Anyone else see anything similar, or know of a workaround?  Thanks!",
    "is_img": 0,
    "category": "Other, Google Pixel 4a (5G)",
    "post_time": "2021-05-13T18:09:56.594043+00:00",
    "reply": "1 Reply"
}