{
    "url": "https://support.google.com/pixelphone/thread/18897323/pixel-3a-bluetooth-audio-problem-with-car?hl=en",
    "title": "Pixel 3a Bluetooth Audio Problem With Car",
    "content": "My Pixel 3a will stop playing audio in my two Mazda cars with Google Play Music if I leave the car and return in greater than 4 hours, possibly less. It has consistently failed to play audio under those circumstances even though everything works fine if I leave the car for shorter periods of time. The music will then pick up right where it left off from with audio. With longer periods of time the track will show but with no sound. I can change the track on the car system and the phone will reflect the change but again with no sound. I can pause the music and that will also be communicated to the phone as well or vice versa. In other words the phone and the car are connected via bluetooth for everything but audio. This didn't occur with my older Samsung S7 Edge over a five year period with one of my Mazda cars and a 3 year period with another one.\n\nIf I restart the phone the audio will come back. If I force stop the bluetooth system app and hit play again the audio will start but will have drop outs and be of lower quality until I stop and restart bluetooth again. Clearing the cache and data from the music app does not fix the audio.\n\nI have discussed this with Google support and am running the Pixel 3a in safe mode and will check tomorrow to see it the audio works when I restart my car. This might indicate a 3rd party app may be responsible for the problem. Beyond that, I would have to do a factory reset again and have diagnostic work done at an Ifixit store (hardware?).\n\nI am not confident that Mazda would be of much help and doubt the cars are a problem based on my past history with my Samsung phone. I have spent a lot of time isolating this problem and determining the \"fix\" (restart or force stop bluetooth). I have also rebooted the firmware in both cars and could possibly call Mazda and also check for firmware updates for my cars but this as well as using the older Samsung phone are unlikely or impractical solutions as I don't want to keep using an older phone. By the way, I have also unpaired and re paired both cars with the Pixel 3a.\n\nI know having a Pixel 3a and the Mazda cars narrows my chance of someone else having the same problem with the same equipment. I'm hoping someone else has also experienced this problem with either the same or another combination of equipment. So far, I have not found anyone else on this forum with the same problem.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a",
    "post_time": "2019-11-08T01:05:14.47261+00:00",
    "reply": "3 Replies"
}