{
    "url": "https://support.google.com/pixelphone/thread/59931132/how-do-i-get-a-new-phone-off-of-warranty?hl=en",
    "title": "How do I get a new phone off of Warranty?",
    "content": "Hi, I'm extremely frustrated, disappointed, and feel totally helpless. I'm appalled by the lack of support given by Google to their customers. Three weeks ago, my Pixel 3 (less than a year old) randomly stopped turning on. I contacted Google through their Chat, and they took me through the reboot process, which didn't work and determined I'd be eligible for a new phone with my warranty. Halfway through the chat, I realized my browser was logged in on my University e-mail. The rep assured me this wouldn't be a problem. A few days later, July 1 had passed and it turns out my University e-mail switched from Google to Microsoft. I got back on the chat, and they told me that my phone's ownership had be switched from my original email account to my university account (the rep must've done this when I was logged into that on my browser). I requested they change it back to my personal e-mail, and two weeks later it still hasn't been switched. There was a couple of days I couldn't access my university email due to them changing platforms, and the reps told me they couldn't verify I was me without me having access to that e-mail...even though they switched ownership (i don't understand how or why this matters) to that email without telling me. Now I do have access, and have verified that I am me but the rep keeps saying that she's waiting for her team to change it back to my personal email. I have requested twice for my case to get escalated and she tell me she won't escalate it...2 weeks without my phone....thank god I have an old iPhone that I've been using for work. \n\nCan someone PLEASE help me get a new phone. If this were an Apple phone that had randomly stopped working then Apple would've had a new one on my doorstep the next day...I like the Pixel phone but after this nightmare of support, I regret making the switch away from Apple. \n\nI have no clue what to do, I need a new Pixel that works. Please help!!!",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-07-19T22:52:23.680788+00:00",
    "reply": "8 Replies"
}