{
    "url": "https://support.google.com/pixelphone/thread/14920605/google-refurbished-pixel-2-is-always-defective-bootloader-unlock?hl=en",
    "title": "Google Refurbished Pixel 2 is Always Defective (bootloader unlock)",
    "content": "There is an obscure feature that few phone makers other than Google include in their phones. According to the internet forums and my personal experience so far, this feature is broken in most of the warranty replacement phones shipped by Google. Nobody but Google can repair it. Because of its obscurity and technical nature, few support personnel are understanding or sympathetic. I think there may be some kind of bureaucratic disconnect that is preventing this issue from being addressed, or Google has decided the number of affected users is too small to be worth the resources needed to fix the flaw in their refurbishment process. The name of the feature is \"unlockable bootloader\".\n\nGoogle has shipped me 2 broken phones so far in their attempt to remedy an unrelated defect in my original Pixel 2. I just finished the phone call to have the second replacement exchanged for a third replacement. Both times the support technician has in the end told me that there's nothing they are allowed to do for me other than fill out an order form for another refurbished phone and leave a comment in the order for the fulfillment team to read. Requesting an unlockable bootloader in the comment didn't work the first time and, based on the forum posts I've seen, I have my doubts that it will ever change anything.\n\nI don't know what else to do, so I intend to keep sending them in for a replacement until I receive one that isn't broken.\n\nFor community reference, I can see on the RMA information that the refurbishment is being handled by an external company, \"Cynergy\". A quick web search shows that this is probably their website: http://www.cynergyus.com/. Anyone else interested in devices with unlockable bootloaders should probably be wary of manufacturers that partner with Cynergy.\n\nTechnical log:\n--------------------------------------------------------------\n\nC:\\Program Files (x86)\\Android\\android-sdk\\platform-tools>fastboot flashing get_unlock_ability\n                                                   (bootloader) get_unlock_ability: 1\nOKAY [  0.001s]\nFinished. Total time: 0.003s\n\nC:\\Program Files (x86)\\Android\\android-sdk\\platform-tools>fastboot flashing unlock\n                                                   FAILED (remote: 'Flashing Unlock is not allowed\n')\nfastboot: error: Command failed\n\nSteps to reproduce:\n--------------------------------------------------------------\n\n1. Acquire a refurbished Google Pixel 2. (GA00126-US-RA)\n\n2. Power it on without inserting a SIM card and skip everything in the initial setup.\n\n3. Unlock the secret \"Developer options\" by tapping 7 times on \"Build number\" in the \"About phone\" settings page.\n\n4. Enter the \"System\" settings page, enter the \"Developer options\" sub-page, and find the \"OEM unlocking\" setting near the top.\n\n5. Because OEM unlocking is greyed out and says \"Connect to the internet or contact your carrier\", connect the phone to a Wi-Fi. (Set the connection to \"metered\" while adding the Wi-Fi to prevent it from wastefully downloading updates.)\n\n6. After some time, reopen developer options and enable OEM unlocking. (Note: I have found that the setting of this slider and the state of get_unlock_ability persists across factory resets. At this step after doing a factory reset, you will find the slider is already enabled from the last time. The setting being greyed out or not does not affect get_unlock_ability.)\n\n7. Completely shut down the device by holding the power button for a few seconds and selecting \"Power off\".\n\nhttps://source.android.com/setup/build/running#booting-into-fastboot-mode\n\n8. Enter fastboot mode: \"Press and hold Volume Down, then press and hold Power.\" Let go of the power button once the phone vibrates but keep holding the volume button. (If you continue holding the power button you will accidentally trigger the \"Start\" command from the fastboot menu.)\n\n9. Connect the device to a PC with \"Android SDK\" and \"Google USB Driver\" installed.\n\n10. Open Command Prompt on the PC.\n\n11. Run a command to navigate to the SDK platform tools folder: cd /d \"C:\\Program Files (x86)\\Android\\android-sdk\\platform-tools\"\n\n12. Run the command to verify that you have enabled OEM unlocking: fastboot flashing get_unlock_ability\n\nCommand response should be: (bootloader) get_unlock_ability: 1\nIf it responds \"get_unlock_ability: 0\" then OEM unlocking was not enabled properly at step 6.\n\n13. Run the command to unlock the bootloader: fastboot flashing unlock\n\nInstead of initiating the bootloader unlock process on the phone screen, command response is: FAILED (remote: 'Flashing Unlock is not allowed')\n\nIf you boot back to the normal system at this point, you will find the \"OEM unlocking\" slider is greyed out again no matter what the internet state is. get_unlock_ability is still 1. It can only be un-greyed by doing a factory reset and starting over from step 1, but you will find at step 6 that it is already enabled. Disabling, rebooting, and enabling again does not help.\n\n\nFurther reading:\n--------------------------------------------------------------\n\nRMA phone from Google is not unlocking the bootloader\nhttps://forum.xda-developers.com/pixel-2/help/rma-phone-google-unlocking-bootloader-t3937931\n\nOEM Unlocking Grayed out on non-VZW Pixel 2.\nhttps://forum.xda-developers.com/pixel-2/help/oem-unlocking-grayed-vzw-pixel-2-t3776763\n\nPSA: RMA refurbished Pixel 2's can NOT be bootloader unlocked.\nhttps://www.reddit.com/r/Android/comments/9xcdle/psa_rma_refurbished_pixel_2s_can_not_be/\n\nCannot unlock Pixel 2 bootloader\nhttps://issuetracker.google.com/issues/73217322\n\nWeb Search: \"get_unlock_ability: 1\" \"Flashing Unlock is not allowed\"\nhttps://www.google.com/search?q=\"get_unlock_ability%3A+1\"+\"Flashing+Unlock+is+not+allowed\"\n\n(Unrelated bug: This message board does not support links ending in a quote mark, even if you manually set the link target in the editor.)",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 2",
    "post_time": "2019-09-21T06:31:52.837124+00:00",
    "reply": "19 Replies"
}