{
    "url": "https://support.google.com/pixelphone/thread/112450933/pixel-device-activation-issues-on-sprint-3-weeks-of-problems?hl=en",
    "title": "Pixel Device Activation Issues On Sprint, 3 Weeks Of Problems.",
    "content": "This has been a long ongoing issue for three weeks now, and I can provide more details if necessary, but the gist of it is that my Pixel device simply will not activate on my Sprint account. \n\nI have owned multiple Pixel devices ever since 2017, and I've had zero issues with activation before. I've utilized both physical SIM cards and the ESIMs before, all without issues.\n\nHowever, three weeks ago I went to activate my new Pixel, as my previous one that I just activated in April of this year was badly damaged. The damaged device was activated via physical SIM, as Sprint decided to send me one, and that activation took about five minutes total in order to be successful. Yet, I received an error on Sprint's website when attempting to activate my new Pixel. I called in to customer service, and they explained that somehow both my old and new Pixels were active on my line at the same time. Hence, their system messed up during the activation process.\n\nThey claimed they would clear this up, yet the new Pixel is still refusing to activate despite clearly showing compatibility on their BYOD (Bring Your Own Device) query. They are receiving a \"trace error\" in the system, which contradicts their initial successful BYOD check.\n\nWhile speaking with technical support yesterday, they claimed that if my device still isn't working after Monday then I should return it to Google.\n\nI've never had this problem before, but the technician claims they've run into this numerous times before with phones from \"third parties\", including Google. Obviously, there's no reason why a Google phone shouldn't work with Sprint, either via ESIM or a physical SIM card, and I'm honestly wondering why this is even an issue.\n\nIf this latest support ticket doesn't fix the issue via Sprint, then I'm honestly at a loss for what I can do anymore. Nothing is making sense here, and there's certainly no reason for why my Google device should have to be returned.\n\nI'm simply looking for advice and guidance here as to what my next steps should be, and whether any of what I have so far been told makes any sense or sounds accurate.\n\nThanks.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 3",
    "post_time": "2021-06-05T10:43:57.568771+00:00",
    "reply": "0 Replies"
}