{
    "url": "https://support.google.com/pixelphone/thread/85300476/google-pixel-3a-audio-still-pauses-stutters-randomly-after-android-11-update?hl=en",
    "title": "Google Pixel 3a, audio STILL pauses/stutters randomly after Android 11 update",
    "content": "According to other forum posts I've browsed, this problem is NOT exclusive to spotify (i've seen users report the same issue with audible), but spotify is really the only music app I use on my phone so that's what I'm having the most issues with.\n\nSo this problem has been happening ever since the Android 11 update came out.  Randomly, the music will pause, then stutter until I close the spotify app and restart it.  I'm able to compromise with my wired earbuds at work, as it happens maybe 5 times during an entire 8 hr shift and I'm able to quickly restart the app and have it play properly for another 30 mins - 2 hrs or so (just an estimation, I don't keep track and it happens super randomly); however, I discovered yesterday while trying to play music in my friend's car, that the problem is even WORSE and way more common with bluetooth.  During our 1.5 hr round trip, my music stopped countless times at random times and I had to restart the app so many times I lost count. \n  I can confirm it wasn't her bluetooth device, because I have the same exact problem with my own bluetooth headphones.  Today, with my own bluetooth headphones, I was listening for less than 30 minutes and I had to restart the app at least twice in that time period.\n\nI'm having a similar problem with the youtube app and bluetooth.  While I'm watching youtube videos with my bluetooth headphones, the entire phone will randomly freeze for a few seconds at a time then resume the video.  It's hard to pinpoint how often it happens because it happens at random times.\n\n1. It happens both on Wifi and 4G, and offline mode with downloaded songs.  And last time I checked, the same problem happened on the spotify web player and the spotify test account as well.\n2. I have \"play in background\" enabled in the Spotify settings.\n3. I've tried disabling battery optimization for the apps, no difference.\n4. It's NOT just my phone, as I've seen so many other people with Pixel phones have this same exact issue after the Android 11 update with no answers.\n5. I've restarted my phone, restarted the app, and logged off before uninstalling then logging back in after reinstalling.\n\nThis has been going on for way too long (literally MONTHS) and google has done absolutely NOTHING about it.  At this point I really, REALLY want to switch to a samsung, but I'm broke and already paying off this phone month-by-month, so I'm basically stuck with it.\n\nHey, Google, if you're not going to fix the issue, at least GIVE US OUR MONEY BACK so we can get a phone that DIDN'T release a broken \"upgrade\" that you basically forced users to update to.\n\nGoogle claims that they read all the feedback they get, but I find that VERY hard to believe, as users have been reporting this issue ever since the update rolled out MONTHS AGO, and y'all have done NOTHING to fix it, not even acknowledge that there's an issue that's in the process of being solved.\n\nFIX.  IT.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a",
    "post_time": "2020-11-25T23:00:06.235482+00:00",
    "reply": "3 Replies"
}