{
    "url": "https://support.google.com/pixelphone/thread/70483575/my-face-unlock-doesn-t-work-after-i-changed-the-backcover-adhesive-help-not-in-us?hl=en",
    "title": "My Face Unlock doesn't work after i changed the backcover Adhesive. Help (Not in US)",
    "content": "Hello. I recently changed my backcover adhesive, due to it starting to break up and i could literally look into the back of the phone since it had broken on the top half. As many of you probably are aware of.\nSo i decided to try to change it myself. No problems, cut up rest of adhesive, remove broken/old adhesive, take off the wireless charging cable, put on the new one and boom, good to go right? Wrong. My face Unlock does now not work, The front camera works fine, and other sensors like the lift to wake, swipe song etc works. So i'm guessing the sensors specifically for the face unlock are broken. Maybe this happened during the time the phone was \"open\" from earlier, it went a while between when i first saw the adhesive coming apart until i changed it. So maybe it got broken that way. Regardless, i'm wondering if any of you here know anything?\n\nThere is a website offering replacements of the Front-Camera Module, which includes all sensors etc, at least from what i can see: https://www.mytrendyphone.no/shop/google-pixel-4-xl-frontkamera-modul-20gc20w0020-252963p.html\nMaybe you could take a look on that. Do you guys thinking a repair like that would work? They offer to do it.\nThen i get a little worried that they would not switch the new adhesive i put on in the same go, therefore drastically weakening the adhesive i already put there. Making me having to swap adhesive again later on (water resistance etc would go out the door i imagine, when just opening up and closing it back up on same adhesive?).\n\nThanks in advance. I do not live in the US, so RMA doesn't work i believe? Could potentially call Google and ask if they want to look at it, but thought i'd ask here first what you guys think!",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-09-11T12:40:19.075135+00:00",
    "reply": "1 Recommended Answer"
}