{
    "url": "https://support.google.com/pixelphone/thread/70086140/duplicates-or-loss-of-location-info-when-transferring-photos-on-android-11?hl=en",
    "title": "Duplicates or loss of location info when transferring photos on Android 11",
    "content": "Hi Everyone, \n\nWe’re aware of issues of duplicates and location info lost when setting up your Pixel phone running Android 11 and transferring your Google Photos content using a cable. We’re working quickly to resolve this, and expect this to be resolved shortly. \n\nTo troubleshoot this issue in the meantime, please follow these steps:\n\nIf you have duplicate content in your Google Photos account and have already set up your new Pixel phone:\nGo to https://photos.google.com in a web browser.\nClick in the search field and select “Recently added” from the bottom of the list.\nDuplicate copies (the copies without location info) will be grouped at the top \nSelect the duplicate photos or videos without location info and delete them. If you’re unsure, open an individual photo and click the info (i) button. The location, if present, will appear on the bottom right of the screen.\n\nNote: Deleted content will remain in your Trash for 60 days.\n\nIf you have not yet set up your new Pixel phone, or if you are able to factory reset your new phone before starting over:\nOn your old phone, install the Google Photos app from the Play Store, if you don’t have it already.\nOpen Google Photos and enable “Backup & sync” when prompted.\nWait for backup to complete. You may need to be on a WiFi network.\nSet up your new Pixel phone as you would normally, connecting the cable. When you see the “Choose what to copy” screen, unselect photos & videos.\nComplete setup. The other items will copy over.\nOnce setup completes, open Google Photos and confirm your photos are there.\n\n\nThanks,\nThe Google Pixel team",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device",
    "post_time": "2020-09-09T16:08:02.622203+00:00",
    "reply": "0 Replies"
}