{
    "url": "https://support.google.com/pixelphone/thread/21583406/google-does-not-honor-pixel-warranty?hl=en",
    "title": "Google does not honor Pixel warranty",
    "content": "I purchased a Google Pixel 2xl on eBay, and then the camera stopped working (the main reason I bought the phone). I contacted Google who confirmed that my phone was originally bought from Google Fi and was still under warranty, and therefore eligible for replacement. Google transferred ownership of the phone from the original owner to me in their computer system, which is required to process a replacement. They requested my proof of purchase, which I provided. However, since filing my warranty claim 38 days ago, Google has refused to send me a replacement phone. \n\nI have been transferred continuously from their tier 1 support to tier 2 and tier 3 support, all who will not give me a valid reason why they will not send me a replacement. Most recently, I have been told by two different tier 2 support representatives that Google will not issue a replacement because my phone was bought on eBay. However, I have confirmed with 7 Google phone representatives and 6 Google chat representatives that a Pixel phone that was originally bought from Google Fi and then resold on eBay retains its warranty. According to Google policy, reselling a Pixel phone on eBay that was originally purchased from Google does not void its warranty. Still, Google is denying my warranty claim for this reason, which is a violation of my warranty, Google policy, and my rights as a consumer.\n\nRecently my IMEI was mysteriously blacklisted, and I could not use my phone for one week, whereas it had no such problem in the 6+ months I had owned it. Since Google is the original seller and service provider of my phone, they are the only company that could blacklist my IMEI. After contacting Google, my IMEI was suddenly and mysteriously removed from the blacklist. Google has confirmed that my phone is not blacklisted, and that my phone has not been reported lost or stolen. But Google has not said they were responsible for the blacklist, even though they are the only company capable of this.\n\nI have spent upwards of 25 hours working on this matter, on the phone with Google support and corresponding with them by email. On two occasions I called Google Home and the representative was attempting to transfer my call to Google Fi, but Google Fi declined my transferred call. They refused to speak to me two times, with two different representatives. Recently I have experienced my support calls and chats suddenly disconnecting without explanation, something that has never happened before. Something strange is going on at Google support, and it seems the support representatives are acting manipulatively and dishonestly.\n\nI am simply trying to get my phone replaced due to a hardware malfunction, which is covered under warranty. I am the owner of the phone in Google's computer system, I have provided Google my proof of purchase, and my phone has not been reported lost or stolen. There is no reason for Google to deny my warranty claim. However, I have been manipulated and misinformed by Google support staff, given conflicting information, ensnared in endless bureaucratic delays and excuses, and had my IMEI temporarily blacklisted. This is the worst experience I've had with any consumer product in my life.\n\nI seem to have exhausted all my options to pursue this matter with Google support. What should I do next?\n\n(Attached are screenshots of emails from two different Google support representatives denying my replacement because my phone was purchased on eBay. I have also attached a screenshot of an email from Google confirming that my IMEI is not blacklisted, and my phone has not been reported lost or stolen.)",
    "is_img": 1,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-11-30T19:22:44.223346+00:00",
    "reply": "5 Replies"
}