{
    "url": "https://support.google.com/pixelphone/thread/9449060/pixel-2-quality-issues-and-support?hl=en",
    "title": "Pixel 2 quality issues and support",
    "content": "Dear Google,\n\nI am a proud owner of a Pixel 2 phone that I received as a X’mas gift from my parents.  I was extremely happy to receive my first ever phone and I was further excited when my parents said they got me a Google Pixel 2, as I always wanted a Pixel phone.\n\nWhen I first opened my Pixel 2, I was honestly amazed. The phone was fast, smooth, had a nice keyboard, and an amazing camera. For a few months, the phone worked flawlessly, keyword being a few months. However, around the 3rd or 4th month of using this phone, I noticed something was wrong. I kept getting glitch lines and my phone would sometimes crash out of nowhere. The fear of my phone breaking soon became a reality as one day when I woke up, I noticed a small text that was highlighted in yellow saying “Slot unbountable, Load error”. I thought that my phone is permanently broken and I was in a state of panic. However, I remembered that the warranty on a Pixel 2 is two years. I contacted Google Support and they agreed to send me a replacement device. I was very happy that Google had a two-year warranty for pixel phones, because 1) it saved my phone and 2) It's great for consumers if they run into an issue with their device.\n\nWhen I got my replacement device, everything seemed great and there were no issues until I put in my sim card. My pixel 2 could not read my sim card even though I placed it in properly. I contacted Google Support and the representative on chat tried many troubleshooting steps but in the end, none of them were successful. Google Support advised me to get another replacement device which I agreed to. The process was relatively fast and easy.\n\nMy second replacement device was disappointing as it had a heating issue where my phone was getting extremely hot after using it for only around 10-20 minutes. I contacted Google Support and after another round of trying troubleshooting steps, I was again advised to get yet another replacement device.\n\nI got my third replacement device that I am currently using now. However, to my dismay, the battery life on this Pixel 2 is short. It would drain and even die in around half an hour of use. I tried booting into safe mode, I always turn off Bluetooth when I am not using it and I only use one app at a time with no apps running in the background. Despite my best efforts to conserve battery use, none of steps seems to help my phone’s battery life. Now, I had enough with the replacement device process and decided to contact Google Support for a full on refund on my phone but was informed to follow-up on a trade in option.\n\nThe trade in process estimated that my Pixel 2 was only worth $188, which is far below the cost of a new Pixel 2 phone even in 2019. I truly cannot understand how this will help with my situation in getting a “working” Pixel 2 phone. This has been an extremely frustrating process and completely unacceptable on part of Google Support.\n\nI am frustrated and disappointed in the quality of Pixel 2 and the replacement process. Is there any hope in resolving this issue? \n\nThank you.\n\nAaran Gobi (frustrated Pixel 2 user)",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-07-07T21:49:04.689631+00:00",
    "reply": "0 Replies"
}