{
    "url": "https://support.google.com/pixelphone/thread/29777238/pixel-2-verizon-physical-sim-not-recognized?hl=en",
    "title": "Pixel 2, Verizon, Physical SIM not recognized",
    "content": "Issue: Phone randomly stops recognizing physical SIM card. I do not and have never used Google Fi or any eSim. In fact, I think the Verizon SIM in my phone has been there since both the SIM and phone were brand new in December 2017, and I haven't removed it.\n\nI have been having this issue for months, since I think middle of November 2019. Pixel 2 on Verizon. All suggested and patches up to date always. No recent updates have fixed the issue.\n\nSometimes I can use the phone for days without any issue, other times it will only last an hour or less before it stops recognizing the Sim card. Sometimes toggling airplane mode fixes the issue, sometimes it doesn't. \n\nI found another post where an engineer recommended entering *#*#794824746#*# into the dialer. This switches between physical SIM and eSIM. So I have to enter it once, wait for the pop-up that eSIM is enabled, then enter it again, wait for the pop-up that the physical SIM is enabled, then wait for my physical SIM to be recognized. This usually works, but occasionally will not work.\n\nIt seems that the issue happens more frequently after a restart, which is unfortunate because sometimes I need to restart to fix the issue.\n\nHow is such a core functionality broken, after 2 years of no issues prior? How has this not been fixed in 3 or 4 patches? I see some bug tracker for a similar issue, but where the user had Google Fi and Verizon at the same time, and people are reporting that the issue is no longer present. Unfortunately I'm still having my issue.\n\nI hope this post will get the right attention and this issue can actually be fixed. I love my pixel 2 and rave about how it's been so good for so long, but this is really a problem.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2020-02-25T12:19:24.923729+00:00",
    "reply": "5 Replies"
}