{
    "url": "https://support.google.com/pixelphone/thread/103734657/an-update-regarding-app-crashes-and-system-webview?hl=en",
    "title": "An Update Regarding App Crashes and System Webview",
    "content": "Hello Pixel Community,\n\nOn March 22, we began to receive reports that several Google apps, including Gmail and Chrome, and partner apps began to crash unexpectedly on Android. After conducting an investigation, we identified that the issue was related to a recent update to the WebView system app. We halted the update and have posted a new version of WebView (89.0.4389.105). If your device was impacted, the steps below will walk you through your options to resolve this issue.\n\nTo resolve this issue, Android System WebView and Google Chrome need to be updated. Google Play will soon download the update to these apps on affected devices, or you can update manually to resolve the issue immediately. Some devices do not have WebView pre-installed and only need to update Chrome.\nTo manually update Android System WebView and Google Chrome right now:\nOpen the Play Store app.\nSearch for “Android System WebView.”\nSelect Update. If it doesn't say “Update”, skip this step.\nRepeat these steps for Google Chrome\n\nLearn more about updating Android apps\nNote: We do not recommend manually uninstalling updates to WebView. It may result in loss of data from some apps.\n\nIn some rare cases in Android 10 or 11, a manual update of WebView or Chrome may fail to complete. Here are additional steps users can take to resolve the issue:\nOpen your phone’s Settings app.\nTap Apps & notifications > Google Play Store > Storage & cache > Clear Data\nPlease note that doing this will clear some of your Play Store settings like parental controls, auto-update preferences, etc.  Please recheck these settings after following these steps.\nRepeat the steps above to update WebView and Chrome",
    "is_img": 0,
    "category": "Other",
    "post_time": "2021-03-24T18:46:51.754564+00:00",
    "reply": "0 Replies"
}