{
    "url": "https://support.google.com/pixelphone/thread/90654379/my-pixel-4-turned-off-while-it-was-on-the-pixel-stand-while-reading-and-it-won-t-turn-back-on?hl=en",
    "title": "My Pixel 4 Turned off while it was on the Pixel stand (while reading) and it won't turn back ON : (",
    "content": "I bought my Oh so Orange  [Pixel 4 128GB] on Black Friday 2019 directly from the Google Store.\nSo this past Black Friday (Nov 2020) I was trying to purchase the Pixel 5..\nLong story short when I checked online (store.google.com) it was sold out already Bummer...\nand to top it off My Pixel 4 stopped working while on the Pixel stand (while I was reading an article) about 2 days after Black Friday... which completely sucks because not only did I miss out on the Pixel 5 deal that day but also the 1 year warranty is OUT!!!\nCoincidently and mysteriously my Pixel 4 just completely dies on Me for God knows what reason.\nI was like .. \"I've been iPhone'd!\"\n(since they came up with that controversial \"We'll make your phone slower etc.. with software so You have to buy the new one deal) But I get neither..\nI have been without a cell phone since then because of lack of funds.. And I'm not trying to settle for a weaker phone so I'm using my PC for communication along with the Telegram Desktop App.\nI also lost my job at Universal due the pandemic recently so Yeah..\nMy original plan was to Sell my Pixel 4 to a friend who was actually interested that day (Black Friday 2020) but instead I got a Lemon out of my Oh so Orange.\nI've tried watching videos on it and also reading the forums here but no Cigar.\nI doubt Google will help me at all since i did read some pretty F'd UP stories from other customers with a similar scenario complaining about Google's customer care etc..\nI've always bought these phones ever since the NEXUS and now this is what I get?\nI've recommended and even had friends\\Family switch from iPhone\\Samsung to a Pixel for what..??\nI can't stand iOS so if no solution I'll probably go with another brand and do the Lineage OS thing.\nI'm a systems administrator so I know a thing or 2 about Technology, but I don't know about even trying to\nopen this thing when I'm not sure what the problem is to begin with.\nI take care of my stuff the phone is in awesome condition so again.. What the hell?\nAny help\\pointing me in the right direction would surely be appreciated.\n\nThank You for your Time\n\n\n-  Raul X",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4",
    "post_time": "2020-12-27T14:09:49.768679+00:00",
    "reply": "2 Replies"
}