{
    "url": "https://support.google.com/pixelphone/thread/93102249/massive-standby-battery-drain-on-pixel-3a?hl=en",
    "title": "Massive standby battery drain on Pixel 3a",
    "content": "Sometime in the late summer or early fall of 2020, right around when Android 11 dropped (although I'm not sure if it perfectly coincided with upgrading to Android 11), I started to notice a pretty heavy standby battery drain on my Pixel 3a (2-3% per hour). Instead of lasting two days with 6-8 hours SOT, as it had for the first year I owned it, my battery was discharging so quickly on standby that it would die in about two days with the screen off.\n\nI dealt with the battery drain for few months on stock Android 11. Eventually I was at my wits end trying and failing to find solutions, so I decided to downgrade to Android 10 and switch to CalyxOS (a private near-stock Android ROM) with the thought that removing Google's spyware might help. Unfortunately, the drain persisted. I have since upgraded to Android 11 on CalyxOS and the drain is still here. My battery stats constantly show high usage from Android System (usually more than the screen), Wi-Fi, Standby, and sometimes Android OS.\n\nLet me give you a rundown of some of my settings to make it clear how ridiculous this battery drain is:\nBluetooth and Wi-Fi scanning off.\nWi-Fi on, but with Mobile Data Always Active off.\nBluetooth off.\nNFC off.\nLocation services off.\nAmbient display off.\nHotspot/tethering off.\nVPN off.\n\"Ok Google\" off (the Google app is actually uninstalled).\nAll gestures off (e.g. Lift to check phone).\nCell signal is great. It's consistently three or four bars in my apartment.\nOnly 9 apps registered for push notifications (turning off push notifications doesn't solve the drain): Bitwarden, Duolingo, GroupMe, Nanoleaf, Photos, ProtonMail, Signal, YouTube, YouTube Music\nOnly 7 accounts syncing (turning off auto-sync doesn't solve the drain): Two DAVx5 accounts (for contact/calendar sync), Duolingo, Google, GroupMe, NextCloud, and Signal\n\nHere are some of the things I've tried that haven't stopped the drain:\nBattery saver mode\nSafe mode\nFactory reset\nReverting to Android 10 (I did this before moving to Calyx OS and then ran Calyx OS on Android 10 for a month or two before upgrading to Android 11 again)\nSwitching to microG for Google Play Services (bundled with Calyx OS)\nSwitching to 5GHz Wi-Fi (I usually connect to 2.4GHz)\n\nThe one thing I've done to successfully stop the drain has been the following:\nTurn off Wi-Fi.\nRestart the phone.\nLeave Wi-Fi off.\n\nHowever, I only have a 4GB data plan and I use probably 20-30GB of Wi-Fi data per month. This is at best an extremely short term workaround. I also don't think this has worked every time, but I know it's at least worked a couple of times for me.\n\n----\n\nThe following screenshots are battery stats from two days ago. To get these, I turned on safe mode, charged my phone to full, and then just sat it on my desk with the screen off all afternoon (aside from turning on the screen once in the middle to check the battery). I had 1 minute of SOT over the entire charge and I lost 17% battery. There are an insane amount of wakelocks going on, leading to almost two hours of screen-off uptime of the ~6.5 hours it was sitting on my table. Almost all of these seem to be coming from the Wi-Fi radio.\n\n\n\n---\n\nAny suggestions of things to try or solutions would be very welcome. I'd also be happy to share more stats from this charge (or a non-safe-mode charge) if that would be helpful.\n\nI'm just so tired and frustrated at this point. The longer this goes on, the more charge cycles get added to my battery, and the worse my battery life is going to be over time. This same exact thing massacred my old Nexus 5's battery and I really don't want to have that happen again :(",
    "is_img": 1,
    "category": "Battery and Power, Google Pixel 3a",
    "post_time": "2021-01-12T06:23:19.660991+00:00",
    "reply": "1 Recommended Answer"
}