{
    "url": "https://support.google.com/pixelphone/thread/106926856/pixel-4a-frustration-after-upgrade-from-pixel-2?hl=en",
    "title": "Pixel 4a frustration after upgrade from Pixel 2",
    "content": "I upgraded from a Pixel 2 to Pixel 4a (on Google Fi) 6 months ago and have had constant trouble with the new 4a ever since. I wonder if others have had similar experiences, and if they have figured out what's going on?\n\nThe biggest issue I have is my 4a's poor choices of wireless connections. I am constantly having to manually tell it to connect to WiFi, or to a better cell tower than the one it has chosen. For example, it will set up an almost uselessly slow \"Edge\" connection with a sprint tower 3 km away instead of an LTE connection with a T-Mobile tower that is 800 m away, and I have to force it to switch (*#*#34866#*#*) before I can send or receive data. Or it won't find and connect to the closest WiFi access point in my home without me telling it which one to connect to.\n\nOther frustrations I didn't have with the Pixel 2 (I realize some of these might be software problems related to newer Android versions):\n\n1/2 hour from text to notification of text\nblanks where texts should be at the bottom of a conversation in Messenger; I have to leave the conversation and return to it to see the texts\ntext to speech ignores punctuation sometimes, sometimes inserts \"{question mark}\" instead of \"?\" often doesn't capitalize proper nouns or days of week or months.\ntext to speech word recognition doesn't work as well as on my Pixel 2\nGoogle Assistant:\nIt often takes two tries, sometimes three, to get the google assistant to wake up with \"OK Google\"\nThe GA sometimes just drops requests after transcribing them correctly\nThe GA sometimes confirms audibly a request like \"set a timer for one hour,\" sometimes it doesn't, even though it does set the timer.\nThe GA sometimes tells me the weather report when I request it, sometimes just pulls up a page with the weather report and refuses to read it.\nThe timer sometimes goes past the set time (by 5+ minutes) without actually ringing.\nPoor sound quality on recipient's end of calls when calls go over WiFi.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a",
    "post_time": "2021-04-20T19:56:03.540111+00:00",
    "reply": "5 Replies"
}