{
    "url": "https://support.google.com/pixelphone/thread/105613641/pixel-2-screen-is-blank-but-phone-appears-to-be-on?hl=en",
    "title": "Pixel 2 screen is blank but phone appears to be on",
    "content": "My phone was operating normally today, but when I went to check it at some point, I found the screen stopped working. It appeared to attempt to turn on, where I would see a flicker of a patch of faint light blue horizontal lines in the lower half of the screen, but nothing more.\n\nIt appears the phone is still operational in some form, as:\nThe normal chime and vibration occurs when plugging in the phone.\nTapping the power button, swiping up from the bottom of the screen, and performing my usual unlock method (drawing a pattern of lines across the dot grid), I can feel the usual vibrations I associate with this action.  This doesn't seem to work consistently but that may just be due to mistakes I'm making from the screen being blank.  I'm sure I've been successful at least some of the time though, as the \"feeling\" of the grid caused by phone vibrations has disappeared after I've done my usual pattern.\nDouble-tapping the power button makes the usual vibration of the camera turning on, and tapping the portion of the screen where the shutter icon would be makes the camera sound effect and even activates the flash (which I had left on from the last time I took a photo).\nWhile the camera is open (thus the phone is definitely active), holding down the power + volume down buttons triggers the screenshot sound effect as expected.\nPlugging the phone into my computer usually makes the device appear in My Computer\n\nHowever, despite all of the above, when I attempt to call the phone, it goes straight to voicemail, as if the device is turned off.  I'm also unsure if something weird is happening with the power button, since there's been several points where I'm SURE I've held it down long enough to force a shut down, then later I discover that opening the camera/attempting to unlock still works.\n\nA lot of the screen troubleshooting advice on Google's help pages has been unhelpful, as the advice seems to consider the issue of a blank screen and an unresponsive touch screen to be interchangable for some reason (and sometimes even points you towards other articles that assume the screen is working).\n\nMy main concern here is whether I can get my files off of this thing in any way.  The fact that my computer recognises it but I can't access my files without a screen to activate USB file transfer is very frustrating - so near yet so far. If I order a USB to HDMI converter to display the pixel on another monitor, will plug n' play just work for that? Google help pages suggest that like USB file transfer, I'll need to activate permission to cast the screen to another device - which I can't do without a working screen!\n\nIt's an old phone now so I accept these things aren't built to last anymore and it's time to get a new one. With that in mind, returning to factory settings isn't an option (even if I'm able to with my limited input to the device).  My goal is just to get my files off.\n\nSo, key questions:\nCan the pixel 2 cast to another monitor simply by plugging it in?\nAre there any other options for getting files off of a device without a visible screen?\nIf all else fails:\nCould someone provide screenshots of the step by step process of opening the USB notification and allowing USB file transfer?  I might be able to navigate my way there blind with screenshot reference, but most how-to videos I've found go the long way through the phone's settings menus (and I can't even remember what location of the screen my Settings icon was on).",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2021-04-09T16:30:40.216548+00:00",
    "reply": "1 Recommended Answer"
}