{
    "url": "https://support.google.com/pixelphone/thread/100577843/warm-hot-pixel-5?hl=en",
    "title": "Warm/Hot Pixel 5",
    "content": "Hello,\n\nI bought this Pixel 5 in early Jan and had it shipped to Singapore from USA. Over 1.5months of usage I have noticed 3 main issues: \n\n1. Warm phone when using regular apps like Telegram to text, and even now when I am writing this feedback message. The area of warmness is the top half of the phone especially at the rear). The phone gets hot when surfing Chrome sometimes. When I use wireless Android Auto, the phone gets hot and the battery drains plenty too (See below), This is not the experience I expect from a brand new phone. \n\n2. Battery Drain is quite severe. I do not use the phone a lot since I am a student (I absolutely do not game on it; I just mostly use the phone for texting and the occasional Youtube) and I still always have to charge it before the day ends. Leaving the phone unplugged overnight when I sleep, it drains about 6% over 5 hours, which is quite severe considering that the Always-on display is not on. When connected to Bluetooth earphones, the drain is even more severe, much worse than my old LG V30 which I had for almost 4 years. I even turned off Always-on Display soon after getting the phone. I use the adaptive smooth display and do not have it forced on all the time. The adaptive battery feature is also on. I see almost no difference between that old battery and the Pixel 5's, which is rather extremely disappointing given that I bought this phone for its claims and online reviews about its battery life. This is not the battery experience I see others having. \n\n3. The auto-rotate feature is slow and takes about 5-10s before it rotates the screen (e.g. in youtube). This was not a problem with my old LG V30 (which is already almost 4 years at this point). \n\nI have factory-resetted the phone once already and both problems did not go away. I am quite disappointed that my first Pixel experience has turned out so badly. Please advise on the steps I can take.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 5",
    "post_time": "2021-03-03T15:00:07.668101+00:00",
    "reply": "3 Replies"
}