{
    "url": "https://support.google.com/pixelphone/thread/21666357/my-pixeln3-has-been-auto-restarting-has-a-broken-charging-port-and-the-touch-screen-not-working?hl=en",
    "title": "My Pixeln3 has been auto restarting, has a broken charging port and the touch screen not working",
    "content": "I paid $830 for nothing but issues since the second or third month of owning this device. Money has been wasted. You got me like you fooled those with Stadia.\n\nFirstly, my charging port on my Pixel does not work. There is nothing wrong with my cords or my headphones, but if I want it to work I have to shove the cord deep down in there for it to even connect and once that happens I let go and it disconnects. It takes a few minutes to get it in the right position and when I get a text or notification that makes my phone vibrate, it completely disconnects and I have to do this process again. \n\nAnother issue is the touch screen will randomly stop working. I will press the side buttons, get notifications and things will move. The phone doesn't freeze, the touch just doesn't work. I can't even restart it. I have to let it figure it's self out which can take up to half an hour before I can even reboot it unless my next issue happens.\n\nThe next issue is that my phone will randomly restart on its own. Sometimes back to back after doing it. The only time I'm okay with this is when the touch screen stops working and it's the only solution other than letting my phone die. \n\nNow, you might say I should send it in and pay for it to be fixed, but why? I have paid a lot of money for a product that shouldn't have these kind of issues. Especially multiple issues. Maybe just one of these, I'd be okay with paying for it, but clearly there is something wrong with this Pixel 3. I do not know if there are other cases of people having these issues. I have a case on my phone and I don't even drop it or do anything that would make this phone act up in such a way. \n\nIf anyone, hopefully Google in particular, could help me out on what to do to fix these issues or let me send this thing in to be fixed without me putting more money out than the initial cost of the device, that's be great. I usually had Samsung, I took a gamble on the Pixel and I am highly dissatisfied with the device. \n\nThanks in advance",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-12-01T19:04:45.722016+00:00",
    "reply": "0 Replies"
}