{
    "url": "https://support.google.com/pixelphone/thread/22187061/replacement-phone-not-received-in-4-motnhs-any-help-please?hl=en",
    "title": "REPLACEMENT PHONE NOT RECEIVED IN 4 MOTNHS! ANY HELP PLEASE?",
    "content": "Ive been a Pixel phone fan since I purchased the pixel 1 when it came out! So naturally i was so inclined towards the phone, my brother got me the pixel 3 as a gift which I gifted to my wife. She had an issue with the software where the phone did not switch on after an update. Luckily it was within the warranty period and after communicating with the google team they set me up with instructions to do a replacement and i was notified that i was eligible for a replacement. Below you will find the first image showing that my phone i sent to google was received and the replacement phone has been shipped. After which a few weeks passed and there was no news of my replacement phone. When i checked the tracking number with the parcel service company they said it was delivered. Once i got the delivery address it was not the address i had given to google. Later i posted in this community and someone helped me with a customer support telephone number. Which i spoke to and mentioned the situation they checked and admitted to the replacement phone being shipped to the wrong address. After which they said they will 'ESCALATE' the issue and i will get a call from google etc. Weeks passed nothing happened no call no email nothing and i called again then they said the same thing again that its been 'ESCALATED'. Then again i waited but to no use. After sometime i called again they said your replacement phone is ready and about to be shipped and you will receive the tracking number again. This email conversation has been attached below. It has been 4 months now and still they do not have a solution to their mistake. Its simple either send me a new phone or provide a refund. Now they have been coming up with excuses even after i have mentioned all the details previously many times, such as asking me for an invoice over and over again when I've already told them it was a gift i received. For a data driven company they can't seem to keep track of their customers complaints and work towards it. \n\nAs far as i can tell google customer support is there only until things go smooth, after which there is no actual support. They waste time and don't give you solutions. It has been a real waste of time and resources. At this point there is no actual help or solution provided. I hope someone here can help me. Ive got more email proof of the conversations from the beginning of the replacement procedure. \n\nDeeply upset customer,\nAmjad",
    "is_img": 1,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-12-07T12:03:32.088747+00:00",
    "reply": "3 Replies"
}