{
    "url": "https://support.google.com/pixelphone/thread/55138488/pixel-3a-photos-disappearing?hl=en",
    "title": "Pixel 3a photos disappearing?",
    "content": "I have a Pixel 3a that is just 62 days old now. I gave it to my wife as a gift before our baby was born so she could take and store better photos of our baby.\n\nThis morning we discovered that the phone made all of our photos more than two days old completely disappear. They are not deleted, they are not in the trash, they are just simply gone.\n\nI have gone through Google Support who tried to help but we weren't able to recover the photos nor we were able to confirm it won't happen again.\n\nHere is all of the information that we can give up front:\n- I have only the native apps on the phone (Google Camera and Google Photos).\n- I did not do a backup to Google photos. I will do it in the future but realistically it shouldn't be necessary on a 62 day old phone. I'd like to keep my photos stored on the device so I can view them regardless of data or Wi-Fi connection.\n- I have restarted the phone a couple of times.\n- I have deleted the cache for the Photos and Camera apps, as well as I uninstalled the updates and reinstalled them.\n- I have searched for the photos through the \"Files\" app and through \"Storage\". I found some of the old thumbnails but they were deleting themselves quickly as well.\n- The photos were not in the trash. A bunch of photos that were supposed to be there (that I put there just yesterday) were there. When I went back in to make sure the photos I wanted weren't in there, trash had deleted all of the photos on its own, even ones only a few hours old.\n- I have checked the app permissions and they are all good.\n- So far Google's only advice is to wait to see how frequently our 62 day old phone fails. I am of the opinion that just once in 62 days is too often but apparently Google thinks that's acceptable.\n- Both Photos and Camera had updates just 16 hours ago.\n\nHas anyone else had this issue? Did you resolve it? If so, how? Can we expect it to continue to fail?\n\nWe have very little confidence in this product now.\n\nAny help at all would be greatly appreciated.\n\nThank you,\n\nBernie (and Christine)",
    "is_img": 0,
    "category": "Camera, Google Pixel 3a",
    "post_time": "2020-06-23T19:09:01.52062+00:00",
    "reply": "0 Replies"
}