{
    "url": "https://support.google.com/pixelphone/thread/1653085/outline-of-my-worst-customer-experience%E2%80%A6-and-it-is-still-in-progress-with-google-of-all-companies?hl=en",
    "title": "Outline of my WORST customer experience… and it is still in progress. With Google of all companies.",
    "content": "Outline of my WORST customer experience… and it is still in progress. With Google of all companies.\n\n• January 31\n• Purchase a brand-new Google Pixel 2XL from Target\n• That evening I begin setting up all of my apps and notice that there is a pink line running vertically on the right hand of my screen.\n\n• February 1\n• I contact Target about the screen issue. They inform me that my phone what the last one in their store and that they recommended I work with Google to get a replacement.\n• I contact Google support for assistance. They say they will send me a replacement after I send mine in via RMA. This process takes FIVE TO TEN BUSINESS DAYS. So no phone that whole time. I agree and plan to send out on the following Monday (February 4). \n\n• February 2\n• I reach out to the Google rep who helped me to find out if there was anything he could do to help make this a better experience for me, such as expediting the processes.\n\n• February 3\n• A different rep writes back not about anything in my February 2 email, but reassuring me that the refurbished phones are of good quality.\n• This seriously concerns me as I believed I should not be getting a refurbished phone to replace my brand new one. I send an email stating that.\n\n• February 4\n• Upon not hearing back from Google, I reach out again via phone and reached a different rep, Cali. Over the phone, she was great and agreed that I should not be receiving a refurbished phone to replace my brand new one. She was unable to take care of the issue herself, so she escalated my new case to Google product specialists, saying they would follow-up in 1-2 business days. She also promised to provide me a daily status update.\n\n• February 5\n• I send Cali an email, requesting an update since I hadn’t heard anything yet that day as promised.\n• Didn’t get a response.\n• I contact them via phone (Reps through this are always random and they are not able to do anything to help other than post a note in the case for Cali to get back to me). So I ask them to put a note in for me to get an update.\n\n• February 6\n• I reach out to Cali again for an update via email.\n• Cali calls me in the evening with a solution from the Google product specialists that would require me to return my phone to Target, purchase a new phone on the Google Store, take out the Google financing (credit card), and wind up spending more than I did through target. That is even with the discount they were willing to give. Cali and I both agree that this solution isn’t reasonable. She requests that I send her my Target receipts and she would take them to the product specialists to press for a different solution. She said that we should have a solution by end of day on the 7th. I send her everything.\n• I get another email from that rep from February 3 wanting to reassure me about a refurbished device again.\n\n• February 7\n• I reach out to Cali for a status update via email as she told me she was going to be out the 8th and 9th. I didn’t want this going on much longer.\n• I don’t hear back\n• I reach out via phone for a random rep again and asked them to put a note in the case.\n• I tweet about this experience and Google reaches out and ensures me that someone would be reaching out to help me that day. No one ever calls.\n\n• February 8\n• I reach out again for a status update via email. I requested she contact me via phone.\n• Cali responds via email that evening stating that she escalated this to the product specialists again and to wait 1-2 business days for a response…. AGAIN.\n• I respond via email, asking Cali to call.\n• No phone call.\n• I reach out via phone for a random rep again and asked them to put a note in the case.\n\n• February 12\n• I reach out again for a status update via email.\n• Cali responds via email that due to the delay in response she has provided me a credit to my account for Google Store. I look and this is nowhere to be found.\n• I ask Cali via email how this credit works since I cant find it.\n• I reach out to customer service via phone after Cali doesn’t respond and they bounce me around to a few different reps and discover that the credit has not been added to my account like Cali stated.\n\n• February 13\n• Cali reaches out via email for my address so they can send me a new phone. WOOHOO… finally, but I have no idea what is going on. Like, what do I do when it arrives, still don’t know how to get the balance on my Google account as promised, do I take my phone back to target or send to Google, etc.\n• I send her my address and a request for her to give me a call to talk through what is going on.\n• Upon not hearing back, I reach out via phone for a random rep again and asked them to put a note in the case.\n\n• February 14\n• Cali reaches out just after midnight via email, asking when would be a good time for her to contact me.\n• I reply with several options.\n• I receive a shipping confirmation that my new phone is on the way.\n• I send a few follow-up emails to confirm she is calling.\n• I never hear from her.\n• Instead of trying to call for a rando rep again who cant do anything to help, I reach out via chat. Same result. No help. They even tried saying they could confirm Cali was going to call me. We are near midnight and still no call.\n\nSo after 14 days (several hours of emailing and phone calls), I am getting a new phone. But have no clue what is going on other than it is being shipped to me. What I have learned is that Google doesn’t give their customer service associates enough authority to provide a timely and helpful experience to their customers. Either I talk to Cali who has to submit escalation requests to a different department that takes a couple days for a response or I talk to a rando rep who doesn’t even have access to my case to do anything themselves either. They aren’t even able to reach out to Cali directly to get her to reach out to me.\n\nI wish I could say my Google experience was great and talk up my phone to others. Not a chance with how things are right now and not sure what Google is able to do to change that.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-02-15T05:16:57.635014+00:00",
    "reply": "2 Replies"
}