{
    "url": "https://support.google.com/pixelphone/thread/79703424/pixel-is-broken-and-no-help-from-google?hl=en",
    "title": "Pixel is broken and no help from Google",
    "content": "I sent the below text to google already, but I am looking for help.   RMA and chat ID numbers have been struck out.  \n\nI purchased a Google Pixel 4 for my wife in November of 2019.   Last month the phone began randomly rebooting frequently.  We made sure it had the latest software updates on it and the issue did not get better, so we tried a factory reset of the phone.  It still did not improve.   On Monday 10/26/2020, The phone screen went black, and then started flashing green.   It will not reboot, or do anything other than flash green when pressing the power button.   \n\nI requested a call from Google support on 10/26/2020.  Unfortunately, I do not have a transcription number for that call since I believed the issue was going to be fixed promptly.  After describing my issue, I was advised to take the phone to ubreakifix.  I took the phone to ubreakifix on 10/27/2020.  After looking at the phone, ubreakifix apparently entered a google rma of XXXXXXX.   ubreakifix advised that they were unable to repair the phone and recommended that I recontact Google to have the phone sent in for a replacement.   I contacted Google support via the chat feature the evening of 10/27/2020.  That chat ID is   XXXXXXX.  I was on the chat line for 1 hour and 44 minutes with no resolution.   \n\nToday, 10/28/2020 I rechecked the warranty information on the pixel, and when I did so I noticed that an RMA had already been authorized.  However, I had no email or other documentation describing what to do with the RMA.   SO I contacted Google support via phone again on 10/28/2020.   This call transcript number is XXXXXXXX.  While on the phone, I was informed that the RMA had been entered with the issue of a cracked screen on the phone.   This is not correct.  There is no crack whatsoever on the phone, and the issue is as I described earlier in this email.   The person I was talking to for support today said they were unable to resolve my issue and I would have to wait an entire day to receive a call back to see if the phone can be fixed.\n\nI find this absolutely crazy.   I have had to RMA a few items in the past with other companies, and I have never been treated like this.   Customer service was always prompt, and I received a RMA authorization within a day.   I have no idea why Google, one of the  largest companies in tech has such horrible customer service.   \n\nMy wife needs a phone.   Our son has autism, and she has to make and receive calls and texts every day regarding his treatment and therapy.   Because I am receiving no help whatsoever from Google, I have had to purchase another phone for my wife just to make sure our son is receiving the care he needs.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2020-10-29T00:01:48.940427+00:00",
    "reply": "1 Reply"
}