{
    "url": "https://support.google.com/pixelphone/thread/112711025/another-boost-of-helpfulness-from-google?hl=en",
    "title": "Another boost of helpfulness from Google",
    "content": "Your Pixel is about to get smarter and more fun, while helping you feel safer, with the latest Feature Drop*[1]. From making a video of the night sky with Night Sight*[2] to protecting photos and videos in a Locked Folder to alerts reminding you to look up while you’re out walking, your Pixel is now more helpful than ever. \n\nThe features will begin rolling out to Pixel devices starting on June 7, continuing in stages over the next two weeks*[1].  Update to the latest Android version and update your Android apps to receive the latest features. Once updated, look out for a notification from the Tips app to learn more about the ways your Pixel just got more helpful. \n\nCapture the stars in motion\nAstrophotography in Night Sight lets you take beautiful photos of the stars. Now you can take it a step further and create a video of the stars moving across the night sky in the app*[2]. It all happens during the same exposure, so you get an amazing still photo as well as a video you can easily share.\n\nUse your phone safely while walking\nStay alert when using your phone while you’re out and about. With Digital Wellbeing, your Pixel can detect that you’re walking and periodically remind you to look up from your screen so you can be mindful of your surroundings.\n\nA hidden space for photos and videos\nSome photos and videos need extra privacy. You can move photos and videos to your Locked Folder in Google Photos, or save them to the Locked Folder right after taking them and they’ll stay on your device. Images and videos in your Locked Folder won’t show up in shared albums, memories, or any other apps on your devices, and can only be viewed using your device passcode or fingerprint.\n\nYour Pixel can call for help, even if you can’t\nWhen car crash detection is turned on in the Personal Safety app, your phone can help detect if you’ve been in a severe accident*[3]. If a crash is detected, your phone will check in with you to make sure you’re OK. If there’s no response, Pixel can share your location and other relevant details with emergency responders. Car crash detection is now supported in Spain, Ireland, and Singapore, in addition to the UK, Australia, and the US.\n\nFind out who’s calling before you pick up\nCall Screen helps you avoid spam calls. Google can answer unknown numbers and find out who’s calling and why, so you can decide whether to pick up. And now, it’s available in Japan*[4].\n\nTranscribe in more dialects of English\nRecorder lets you instantly transcribe audio into text so you can search, edit and share your recordings*[5]. It’s fast, it’s easy and it will soon be available in more English dialects, including Singaorean, Australian, Irish, and British English.\n\nShow your pride on your Pixel\nCelebrate Pride on your phone with new wallpapers and ringtones. Three bold, joyful designs, each created especially for Google by artist Ashton Attzs, join our growing Curated Culture wallpaper collection. And new Pride-themed ringtones and notification sounds created by LGBTQ+ artists and YouTube Creators can be found in your settings.\n\nUse your voice to answer or reject calls\nReceive calls hands-free, whether you’re driving, cooking or just want to work without interruptions. Just say, “Hey Google, answer call” or “Hey Google, reject call” *[6].\n\nCut and paste essential info even faster\nCutting and pasting important information just got easier with Gboard. When you copy text that includes things like a phone number, email address, or URL, you’ll see the important pieces of information suggested in the clipboard*[7]. You can easily drop them into places like Messages to share contact information quickly, or Maps to get started on your road trip faster.\n\n\nSummary of Availability per Device:\n\n----------------------------------------------------------------\n\nDisclaimers\n*[1] Your Pixel phone will receive feature drops during the applicable Android update and support periods for the phone. See g.co/pixel/updates for details.\n*[2] Available only on Pixel 4, 4a, 4a (5G), and 5 phones. See g.co/pixel/astrophotography to learn more.\n*[3]  Not available in all languages or countries. Car crash detection may not detect all accidents. High-impact activities may trigger calls to emergency services. This feature is dependent upon network connectivity and other factors and may not be reliable for emergency communications or available in all areas. For country and language availability and more information see g.co/pixel/carcrashdetection.\n*[4] Not available in all languages or countries. For more information, see g.co/help/callscreen.\n*[5] Transcription and search are available in English only.\n*[6] The Google Assistant and some related features are not available in all languages. See g.co/assistant/languages for updates to language availability.\n*[7] Not available in all languages or countries. See g.co/gboard/clipboard for more information.",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2021-06-07T16:03:36.443737+00:00",
    "reply": "0 Replies"
}