{
    "url": "https://support.google.com/pixelphone/thread/60706127/can-the-pixel-resolve-local-hostnames-via-mdns-during-normal-dns-resolution?hl=en",
    "title": "Can the Pixel resolve *.local hostnames via mDNS during normal DNS resolution?",
    "content": "Greetings! I'm posting here because I've been Googling this issue for 2 days and haven't found an answer.\n\nHere's my issue: I have a NAS running on my local network at mynas.local. When I visit that URL in any web browser (Firefox, Chrome, IE, Edge) from my Windows PC, iPad, Windows laptop, or Mac laptop, the NAS's login page is displayed as expected.\n\nHowever, when I attempt to visit the same URL in a web browser on my Pixel 3 it does not resolve.\n\nTroubleshooting:\n- I made sure my Android device was on the same WiFi network as my other devices.\n- I turned off mobile data.\n- I disabled Private DNS.\n- I am able to cast to Chromecast devices on my network from my phone (which also use mDNS) so it is able to receive/send multicast packets.\n- My roommate who also has a Pixel 3 confirmed it does not work for him either.\n- I've tried Chrome, DuckDuckGo, Firefox, Firefox Beta, and Firefox Nightly with no success.\n\nI have come across the Network Discovery Service for Android, which provides tools for app developers to allow their apps to do exactly this - use mDNS to find *.local hostnames, which begs the question: do normal DNS resolutions on the Pixel 3 not know to do *.local domain lookups via mDNS?\n\nAnd if not:\n- Is there any way to enable it?\n- Is there any plan to support it in upcoming Pixel updates?\n- Are there any web browsers that use the NDS Android API to enable this functionality?\n\nThanks for your time, I know this is a tricky question, but I've been troubleshooting it for several days, and really can't find answers on Google. But with the number of consumer devices that run on *.local addresses I'm sure someone out there must know whether this is possible/supported or not.\n\nThank you very much for your time!\n\nPS- I've seen some workarounds: setting up a private DNS server, adding a hosts file entry, etc. I may use those as a last resort, but I'm interested in allowing my roommates/friends to access things on my network while they're visiting, and I can't do special configuration on all of their devices if they happen to be using Pixel phones.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2020-07-23T23:18:16.138857+00:00",
    "reply": "1 Recommended Answer"
}