{
    "url": "https://support.google.com/pixelphone/thread/2063737/google-service-sucks-water-damage-to-pixel-2-xl?hl=en",
    "title": "Google Service SUCKS - Water Damage to Pixel 2 XL",
    "content": "Problems:\n• USB-C port malfunctioning (since few weeks ago)\n• Water damage from a momentary fall into 1m pool (yesterday)\n* Now I can't ask google to call since my country (Sri Lanka) is not listed. And I cant find an email through which I can contact them.\n--------------\nMy friend bought a Pixel 2 XL from Google in May 2018. He returned it and got a replacement since it was charging slowly. I bought that replacement phone from him in August 2018. I changed the ownership to my account and verified that this phone has international warranty from a Google agent. (I have screenshots).\n\nWithin few weeks, the phone fell down and the camera was broken. I contacted Google, they connected me to CTDI, the google-authorized repair agents. They charged me $400 to replace the camera. They promised the waterproofing would be intact after the costly repair (I have screenshots).\n\nThen I moved to my home country: Sri Lanka in December 2018. Within weeks, the USB-C port started malfunctioning. I raised the issue and Google promised to send a charger through my friend (which I have yet to receive).\n\nNow (March 2019), I accidentally dropped my phone in the shallow end of the swimming pool (about 1m depth). I immediately recovered the phone. It worked for 30 minutes and then it shut down. I thoroughly let it dry in air and tried again. Now the phone shuts down immediately after I switch on. Even then, the screen has a permanent pink line when switched on.\n\n-----------------\n\nThe phone is supposed to be IP67 (30 minutes at 1m depth), but it is not. I believe the AUTHORIZED agents who repaired the camera have screwed up the CERTIFIED water resistance AGAINST THEIR PROMISE.\n\nSince I have the INTERNATIONAL WARRANTY, kind help me to repair the phone. Please contact via email for more details.\n\nI am willing to pay for the postage to send the phone overseas for repair. I just want google to listen to me and find a way to help me here.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-03-05T14:43:57.522991+00:00",
    "reply": "1 Recommended Answer"
}