{
    "url": "https://support.google.com/pixelphone/thread/10885832/quality-call-issues-other-side-cant-hear-me-for-the-first-2-3-seconds?hl=en",
    "title": "Quality / Call Issues - other side cant hear me for the first 2-3 seconds",
    "content": "Hey everyone,\nI'd appreciate some help with this issue, because the Google Support team has not helped at all unfortunately:\n\nThe issue:\nEvery time I make a call or receive one - in the first few seconds of the call the other party/side can't hear me. I say \"Hey\", but they can't hear me. They say \"Hello?\", and I reply \"Hey!\", and only then we can start the conversation.\n\nThe Google Support solution:\nI was told to try and turn on the phone in Safe Mode. Once I did, the issue seemed to have been resolved.\nThe CSR said this is probably due to an App that I have installed that's causing this, however - there is no way of knowing which. I have so many that it doesnt make sense to uninstall one-by-one and check if that helped or not.\n\nMy Solution (didn't work)\nFactory Reset. Very annoying, as its a pain in the A**. I had to make sure that once I log in to my google account after the Reset - it doesnt re-install the apps automatically. I did some test calls and it seems to have worked for a while. so I thought the issue was fixed, so I installed all my important apps when I needed them.\n\nAfter a while, I started experiencing the old issue again and again. No idea which app is causing it (if an app is even to blame, that is), or if it is and issue with the software of hardware. This SHOULD NOT HAPPEN in any case. Why does Google approve apps to its Google Play Store if they are (in theory) not compatible with the Google Phones or OS? \n\nI had the Nexus 6P before that and had call issues that were never resolved. I had hoped replacing it with the Pixel 3 would do the trick but it didnt. I am very frustrated and really like the Google phones, but I might not have a choice but to switch to and iPhone...  :(\n\nPlease prevent me from switching to and iPhone by helping my find a solution....\nThanks a lot in advance :)\nOri",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3",
    "post_time": "2019-07-29T21:38:26.143914+00:00",
    "reply": "7 Replies"
}