{
    "url": "https://support.google.com/pixelphone/thread/7787846/pixel-xl-battery-drain-shutting-off-at-20-black-screen-after-android-9?hl=en",
    "title": "Pixel XL battery drain, shutting off at 20%, black screen... after Android 9",
    "content": "Hello !\nMy Google Pixel XL 1st Gen of 2 years now started acting up. I did the Android 9 update back in March but only started to experience very annoying problems a month ago.\n\nAfter the update, I first noticed the battery drain, it wasn't much at first and since my phone isn't recent I was kind of not surprised but now it's at the point that my phone will be completely drained after 2 hours without even using it ! If I use it, for example in the commute to work (45min), Spotify + browsing social media it's drained before I get to my office ! I have to walk around with a bunch of power banks or pray I'll find a plug when going out so I can charge my phone. Sometimes it shut down at 20% or more.\n\nThere's also another issue, when it's battery drained it will shut down \"normaly\" with the turning off message BUT sometimes I will have 20%, 30% or even 50% left and the screen will turn black.... Even worse if I try to turn it back on, sometimes it will work but the battery will somehow be at 1% or sometimes I can't turn it on at all (sometimes I manage to turn it on again after a few try but battery will be at 1% anyway) THEN when I will plug it to charge it will start normally and the battery will magically be back at the same % before the blakc screen... It's really stressful because it happens literally on random, when I open an app, take a picture, unlock my phone \"too fast\", receive a msg... \n\nAnyway, I saw a lot of people complaining of the battery drain since the Android 9 update but haven't found a lot of related issues with the black screen thing, so I'm not sure if my problem is because of the update or just my phone being \"too old\"\nShould I wait for the new Android ? Change the battery ? Or just buy a new phone ? Any tips on how to save battery ? :(\n\nThanks for the help!\nGood day, evening, night !",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel",
    "post_time": "2019-06-10T21:30:02.614532+00:00",
    "reply": "1 Reply"
}