{
    "url": "https://support.google.com/pixelphone/thread/13670154/android-10-update-on-pixel-2-xl-breaks-wifi?hl=en",
    "title": "Android 10 update on Pixel 2 XL breaks WiFi",
    "content": "UPDATE 12/18/19:\nMight have a workaround for us. Reset your network settings, reboot in safe mode (power off, power on, hold volume down button), open wifi and I attached to an older 2.4ghz only router. It still said \"no internet\" but I set the advanced settings MAC to my phone's MAC, and that didn't immediately work, but I then changed it to an \"unmetered\" network setting and boom....full network activity.  This has survived 2 reboots so far.\n\nUPDATE 12/15/19:\nIssue has returned after the \"Phone\" app was updated on 12/15/19.  No wifi's work...2.4ghz, 5ghz, nothing. And I'm actually connecting to a google fiber box. Reset network settings, reboot phone, reboot router....nothing. I need wifi to work or this fails to be a useful device in my life!\nGoogle Engineering.....please fix this....quickly.\n\n\n\nAndroid 10 update on Pixel 2 XL caused a WiFi issue where all wifi networks report \"Connected, no internet access.\"\n\nTried to connect in Safe Mode to eliminate apps and antivirus (NOD32 ESET) from being a culprit...no change. I'm on Google Fiber with a google fiber router and I wondered if that had something to do with it. Reset router twice. Rebooted phone multiple times. Wiped network settings and restarted.  Tried an alternate router (but same WAN). Set MAC to fixed device mode. Toggled airplane mode on and off. Flushed DNS.\n\nResolution:  Factory Reset  :(\n\nFurther discussion: I am wondering if ESET had something to do with it as it had no permissions for device location and was flagging all my home networks as an \"open\" or \"public\" wifi hotspot. This error occurred immediately after update to Android 10, and after factory wipe. Changing location permission to allow fixed it. Consider uninstalling it BEFORE updating the OS....",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-09-05T20:33:05.480748+00:00",
    "reply": "3 Recommended Answers"
}