{
    "url": "https://support.google.com/pixelphone/thread/23392388/pixel-warranty-refurbished-crap?hl=en",
    "title": "Pixel warranty = Refurbished crap",
    "content": "Had my 3rd online chat session with Pixel support yesterday which ended much like the first two.  I pasted a copy of the session below but the backstory is my original 2 XL had numerous issues but it was within warranty, so I contacted Google and a polite but know-nothing tech tried to fix my phone with more cowbell.  If you’ve been through a Pixel support session then you know the absurdity of it.  Minutes then hours roll by while the tech earnestly insists “just a few more steps” and “this will get resolved to your complete satisfaction” and it all leads up to the big ask:  Factory Reset.  This is the go-to move for level 1 tech support everywhere, but never in its sad history has factory reset fixed a phone or anything else.  It is barely above malware and everyone and their dog knows it.  Google’s playbook though says you must engage in their skit all afternoon if you want another phone, because their tech works cheap and they don’t give two beans about your time.  And when factory reset does nothing but burn another hour the tech finally admits with grave sadness that cowbell did not fix your phone, and a new one will be sent.  It’s finally over and you are flushed with relief but then it gets worse.  After the rest of your afternoon is spent restoring passwords and whatever else got flushed in the reset, come to find your replacement is nothing but a refurbished phone.  Refurbs are never and I mean NOT EVER without issues, no matter what garbage they tell you.  So I had a second go at Google but they refused to send a new phone.  They insisted though on billing my credit card $1,100 in case I kept the original and sold it on eBay for twenty bucks out of spite.  Anyway the refurb arrived and worked for about a week before connection issues started popping up.  I spent a small fortune on headsets and ran several online fixes but it kept getting worse and then the ringtone became a distorted mess which soon spread to every other sound function.  So here we are back at square one and after many more hours they are still very sorry for my troubles and would like to help but no new phone…\n  Google Support\nStephen\n10:26 AM\nThanks for contacting Google Support. My name is Stephen.\n  Craig\n10:26 AM\nHi Stephen\n  Stephen\n10:26 AM\nHi Craig.\n  Stephen\n10:26 AM\nIn case you need to refer to this chat interaction in the future, please take note of the following ID: 5- 9238000028654\n  Craig\n10:27 AM\nThank you\n  Stephen\n10:27 AM\nI apologize for the inconvenience caused and thank you for helping me with the detailed information.\n  Stephen\n10:28 AM\nI've read through the description, and I understand that your device is experiencing distorted sound, is that correct?\n  Craig\n10:30 AM\nCorrect. My original Pixel was having problems so they sent me a refurbished model as a replacement, which are rarely in perfect condition, and this one is no different. I would really like a new phone and not have to go through this time and time again\n  Stephen\n10:30 AM\nThanks for confirming. I can definitely understand your situation.  This is the rare situation that the issue persists on replacement device. I will look it to this and get this take care.\n  Craig\n10:32 AM\nIn my experience refurbished phones and other electronics are problematic and not worth it. The original problem is rarely addressed by the manufacturer, they look at it for 5 mins and send it back out to another customer.  I don't want to keep doing this with Google, please send me a new phone\n  Stephen\n10:33 AM\nI certainly understand your concern. Rest assured, I'll do my best to help you get this sorted.\n  Craig M\n10:34 AM\nthank you\n  Stephen\n10:34 AM\nYou are most welcome.\n  Stephen\n10:34 AM\nCould you please help me with the best number and a preferred time along with timezone to reach you at, in case our chat gets disconnected?\n  Craig\n10:34 AM\nMy cell is ** deleted **.  To be clear, I am asking for a new phone per my warranty, and not another refurbished phone\n  Stephen\n10:34 AM\nThank you for sharing the contact information.\n  Stephen\n10:35 AM\nSure. I will definitely check with my resources and help you get this issue resolved.\n  Craig\n10:35 AM\nthank you\n  Stephen\n10:36 AM\nJust to confirm, done this happen only while on calls or also while playing music as well?\n  Craig\n10:38 AM\nCalls, but texting has started to make a bad sound as well. I use my phone all day long for work so this is unacceptable.\n  Stephen\n10:39 AM\nAlright. In order to isolate the issue better, does this happen with every call and messages?\n  Craig\n10:40 AM\nYes. On a call yesterday the other person couldn't hear me at all even though I was connected and not on mute. That is a new issue so the problem appears to be getting worse.\n  Craig\n10:42 AM\nActually the bad noise when texting is now happening with every function. When I hit an app, it makes a bad sound.\n  Stephen\n10:43 AM\nThanks for providing all the additional information, Craig. This helps to understand the situation better.\n  Stephen\n10:43 AM\nJust to confirm have you tried any troubleshooting steps before reaching us?\n  Craig\n10:44 AM\nNot for this phone, which is a replacement for my last phone\n  Stephen\n10:46 AM\nOkay. Let's perform few troubleshooting steps in order to fix this issue earliest.\n  Craig\n10:47 AM\nJust to clarify - I looked online and tried several potential fixes, but nothing worked.\n  Stephen\n10:48 AM\nI'd like to be respectful of your time and appreciate all your efforts in performing the troubleshooting steps and sorry that did not work.\n  Craig\n10:49 AM\nI tried reset and a few other things, nothing worked.  It is a hardware issue not software\n  Stephen\n10:50 AM\nAlright, just to confirm have you performed factory data reset on your replacement device?\n  Craig\n10:50 AM\nRefurbished phones always have issues in my experience and I asked Google to send me a new one. They assured me this phone was good as new which is clearly not the case. Please send me a new phone. I do not want another refurb - just a waste of everyone's time.\n  Stephen\n10:51 AM\nI can definitely understand your situation. I am checking with my resources in order to help you with alternate options.\n  Stephen\n10:52 AM\nPlease allow me 3-4 minutes here to check this with my resources.\n  Craig\n10:52 AM\nThanks I'll grab a coffee while you check resources\n  Stephen\n10:52 AM\nSure, meanwhile I request you to please stay connected on the chat.\n  Stephen\n10:56 AM\nThank you for staying connected.\n  Stephen\n10:57 AM\nCould you please help me with the IMEI number, so that I can check more details on it.\n  Craig\n10:57 AM\n** deleted **\n  Stephen\n10:58 AM\nThank you for providing the IMEI number.\n  Craig\n10:58 AM\nno problem\n  Stephen\n10:58 AM\nCould you also let me know if the device has any physical damage on it?\n  Craig\n10:58 AM\nNo physical damage, always in Spigen case, looks new on the outside\n  Stephen\n10:59 AM\nThanks for confirming.\n  Stephen\n11:01 AM\nI see that you have done reset, is it factory data reset?\n  Craig\n11:01 AM\nnot full factory reset, I do not want to lose data\n  Stephen\n11:02 AM\nThanks for confirming.\n  Craig\n11:02 AM\nWe tried this with my last phone, it did nothing at all except make me spend an hour or two recovering data that disappeared\n  Stephen\n11:03 AM\nAlright, I understand your concern, however in order to isolate the issue exactly, we just need to perform few troubleshooting steps.\n  Stephen\n11:04 AM\nHave you tried restarting the device into safe mode. Because restarting the device into safe will disable the third party apps, most of the times the issue will get resolved in safe mode itself.\n  Craig\n11:05 AM\nIt is not a perfect process and it does not accomplish anything except wasting more time. Can we please skip this nonsense and just send a new phone\n  Craig\n11:06 AM\nThis chat is now 40 minutes long, I'd really appreciate if we could take care of the problem and not delay the inevitable any longer\n  Stephen\n11:08 AM\nYes, I can understand your concern. As you have tried basic troubleshooting steps, I request you to perform few troubleshooting steps with that we will clearly isolate the issue and if the issue still persists I'll be able to help you fixing the issue as you required.\n  Craig\n11:09 AM\nIf I lose passwords and apps and you end up sending me another useless refurb, I will be deeply upset. This is my last effort with Pixel phones.\n  Craig\n11:09 AM\nPlease go ahead with the steps\n  Stephen\n11:11 AM\nI got your point, Craig. This is just to make sure that we have performed all the troubleshooting steps, in case if the issue persist, I will go ahead and check alternation option as per your request.\n  Craig\n11:11 AM\nPlease go ahead\n  Stephen\n11:12 AM\nThank you so much for understanding, Craig.\n  Stephen\n11:12 AM\nWe should try rebooting your device into safe mode.\n  Stephen\n11:12 AM\nSafe mode does not affect normal functionality, and features such as GPS, Wi-Fi, making phone calls, and texting will continue working normally.\n  Stephen\n11:13 AM\nIt also won't affect your ability to use the Google apps that came preloaded on your device, such as Gmail, Google maps, and the camera and photo apps.\n  Stephen\n11:13 AM\nHere are the steps to restart the device in safe mode:\n1.Please press and hold the power button for about 2-3 seconds.\n  Stephen\n11:13 AM\n2. Click and hold on the Pop-up option which says \"Power Off\"\n  Craig\n11:14 AM\nI have started the process.  Very familiar with it from my last phone issues\n  Stephen\n11:15 AM\nOkay, Let me know once the device is restarted in safe mode.\n  Craig\n11:15 AM\nIt has started in safe mode\n  Stephen\n11:16 AM\nCould you please check if the issue still persists?\n  Craig\n11:17 AM\nThe text issue persists. Regarding the phone issue I will not know until I get on the phone again, but I have ZERO confidence the problem will be fixed by these steps. It is a hardware issue.\n  Stephen\n11:18 AM\nAlright, I request you to make a test call to isolate the issue?\n  Craig\n11:19 AM\nI can't just make a test call, it happens randomly sometimes even 10 or 20 minutes into a call. What is awful about it is that I leave a lot of vmails and I don't know if the message is getting through. Really makes my work difficult.\n  Craig\n11:19 AM\nPLEASE can we move on and replace the phone\n  Stephen\n11:22 AM\nI understand your concern. As it is happening randomly. Let us go ahead and perform a factory data reset on the device. This will erase all local data on your device, so I'd recommend backing up your personal pictures, music and video files.\n  Craig\n11:22 AM\nNo chance. Last time I spent another hour or two recovering passwords.\n  Craig\n11:23 AM\nThis is not a perfect process and I'm fairly sure everyone at Google knows this. Please let's not do this again I have tried things your way, now please do as I have requested.\n  Stephen\n11:24 AM\nI got your point. But in order to check further available options. We need to perform a factory data reset on the device. However I'll help you with how to back up the data.\n  Craig\n11:25 AM\nJesus, please go ahead. This is a huge waste of everyone's time.\n  Stephen\n11:25 AM\nhttps://support.google.com/pixelphone/answer/7179901?hl=en\n  Stephen\n11:25 AM\nHere is the back up support link how to back up the data.\n  Stephen\n11:25 AM\nI really appreciate your understanding.\n  Stephen\n11:25 AM\nLet me know once you are done.\n  Stephen\n11:28 AM\nJust checking, are we still connected on the chat?\n  Craig\n11:29 AM\nyes, waiting for backup to drive\n  Stephen\n11:29 AM\nOkay, thank you for being online.\n  Craig\n11:32 AM\nback up is complete\n  Stephen\n11:32 AM\nThanks so much, Craig.\n  Stephen\n11:33 AM\nLet me go ahead and help you with the steps to perform factory data reset.\n  Craig\n11:33 AM\nI am in Reset Options, do you want me to hit \"Erase all data\"?\n  Stephen\n11:34 AM\nI just want to re-confirm with you, is everything back-up?\n  Craig\n11:34 AM\nYes, acoording to my phone\n  Stephen\n11:34 AM\nThanks for confirming again.\n  Stephen\n11:35 AM\nTo reset the device:\n  Open the Settings app.\n  Tap System > Advanced > Reset options > Erase all data (factory reset) > Reset phone > Erase everything.\n  Craig\n11:35 AM\nWe are now at 1hr 8 mins\n  Stephen\n11:36 AM\nYes, I can definitely understand your situation. This is to make sure that we have done all the troubleshooting steps in order to follow up on your request.\n  Stephen\n11:37 AM\nOnce you have done with the Factory data reset, please let me know.\n  Stephen\n11:37 AM\nI will be with you on the chat.\n  Craig\n11:39 AM\nIt is updating\n  Stephen\n11:39 AM\nAlright, let me know once it is done.\n  Craig\n11:39 AM\nMeantime can you please explain why Pixel makes customers go through these steps? Surely they accomplish very little except to aggravate customers.\n  Stephen\n11:42 AM\nI got your point. Ideally process of following the steps helps us isolating the issue better. Also by performing these troubleshooting steps should take care of the issue.\n  Stephen\n11:42 AM\nHow it is going?\n  Craig\n11:43 AM\nI am at the 2-step verification process waiting for them to send me a code. It says \"may take a few minutes\" and that is certainly the case so far.\n  Stephen\n11:44 AM\nThanks for updating. Not to worry, I will be with you on online.\n  Craig\n11:44 AM\nStill no code, I hit \"resend it\" but still nothing\n  Stephen\n11:45 AM\nAlright, I really appreciate your time and patience here. Let's wait for couple of minutes and check.\n  Craig\n11:46 AM\nThis is not working. I hit \"try another way\" and it wants an \"8-digit backup code\"\n  Craig\n11:46 AM\nPlease this is really worrying me.\n  Craig\n11:46 AM\nWe are not at 1hr 40 mins\n  Craig\n11:47 AM\nnow at 1hr 40 mins\n  Craig\n11:47 AM\nA phone call just came in and the ring sound was AWFUL. Nothing has changed.\n  Craig\n11:48 AM\nStill no text so that I can verify and move on\n  Craig\n11:48 AM\nI am seriously worried about my phone right now PLEASE get me a solution\n  Stephen\n11:49 AM\nSorry to know that, just to confirm are you referring to back up code text?\n  Craig\n11:50 AM\nI need a code for verification but no text has come through\n  Craig\n11:51 AM\nSeriously PLEASE get me an 8-digit code so I can get through this nonsense\n  Stephen\n11:51 AM\nOkay.\n  Stephen\n11:51 AM\nIs the device connected to WiFi?\n  Craig\n11:52 AM\nyes\n  Craig\n11:52 AM\nphone calls are coming in but no texts\n  Craig\n11:52 AM\nthis is nuts\n  Stephen\n11:52 AM\nI request you to restart the device.\n  Craig\n11:52 AM\nrestarting now\n  Stephen\n11:53 AM\nThanks, Craig.\n  Stephen\n11:53 AM\nLet me know once it is done.\n  Craig\n11:54 AM\nback to the 2-step verification but no text message comes through\n  Craig\n11:55 AM\nI signed into Google with my email address and password, once again it says \"2-step verification, verifying your phone automatically via text message, this may take a few minutes\"\n  Stephen\n11:56 AM\nAlright, in order to receive the text message, I request you to inset the SIM into different phone.\n  Craig\n11:56 AM\nI don't have a different phone!!!!!!!\n  Craig\n11:57 AM\nThis is beyond unreasonable, please get me a workable solution. My phone is disabled right now.\n  Stephen\n11:58 AM\nI can definitely understand your situation, once we insert the SIM into different phone we can able to get the code immediately.\n  Craig\n11:59 AM\nThat is ridiculous.  I don't have a different phone and I'm working remotely so I don't know anyone that does either\n  Craig\n12:00 PM\nPlease get a senior technician on this chat right now, we are nearing 2 hours and have accomplished nothing except to disable my phone\n  Stephen\n12:00 PM\nOkay, Let me go ahead and check the alternate options, please allow me 4-5 minutes here.\n  Craig\n12:01 PM\nI am copying this chat and will post it so everyone can see the absurdity of this process\n  Stephen\n12:03 PM\nThanks for being online. I'm sorry for the inconvenience caused to you.\n  Stephen\n12:03 PM\nIn this case let me go ahead and escalate this chat to specialist team, the team will check and help you fixing it.\n  Stephen\n12:04 PM\nThank you for staying connected.\n  Stephen\n12:04 PM\nI have escalated this case to the specialist team, the team will get back to you via email.\n  Craig\n12:04 PM\nWe are now at 2 hours\n  Stephen\n12:05 PM\nI can definitely understand how it is important for you, as I have escalated this to the specialist team, the team will get back to you and fix it immediately.\n  Craig\n12:05 PM\nPlease get them immediately this is beyond absurd. We have accomplished nothing at all except to disable my phone.\n  Stephen\n12:06 PM\nI already escalated the just review and help you immediately as per your request.\n  Stephen\n12:06 PM\nApart from this, is there anything else that I can assist you with?\n  Craig\n12:06 PM\nWhen are they getting in touch???\n  Stephen\n12:07 PM\nWith in 24 hours the team will get back to you via email with the required resolution.\n  Craig\n12:08 PM\n24 hrs???????????\n  Craig\n12:08 PM\nI need them NOW\n  Stephen\n12:08 PM\nPlease be assured. Our specialist will get back to you via email.\n  Stephen\n12:09 PM\nThe team will review and get back to you via email with correct resolution.\n  Craig\n12:10 PM\nI am speechless\n  Craig\n12:11 PM\nI told you this would do nothing but cause problems. I am fairly tech savvy and have done this process many times in my long career, never has it accomplished anything productive.\n  Stephen\n12:11 PM\nI got your point. I've escalated this case to my specialist they will get back to you with in 24 hours.\n  Stephen\n12:12 PM\nBe assured. Everything will be taken care.\n  Stephen\n12:12 PM\nIs there anything else I can help you with today?\n  Craig\n12:12 PM\nYour colleagues said that last time and nothing at all was accomplished\n  Stephen\n12:14 PM\nI have mentioned all the note on the account and escalated to the specialist team. The team will immediately check and with in 24 hours they will contact you via email with the resolution.\n  Craig\n12:14 PM\nYou sent me a damaged phone and here we are doing this all over again\n  Stephen\n12:14 PM\nI am sure that they will contact you with in the time frame.\n  Stephen\n12:15 PM\nAnd help you in resolving the issue permanently.\n  Craig\n12:15 PM\nThe only thing that will resolve this is a new phone, I told you that 2hrs ago\n  Craig\n12:15 PM\nI told your colleagues that a month ago\n  Stephen\n12:17 PM\nYes, Craig. The team will get back to you with in 24 hours.\n  Stephen\n12:17 PM\nAs informed earlier our specialist will get back to you with in 24 hours. In order to assist other waiting customers, I'm ending our chat session.\n  Stephen\n12:18 PM\nThank you for contacting Google. Have a great day!\n  Stephen\n12:18 PM\nThank you for contacting Google Hardware chat support. Your chat session is now complete.\n    UPDATE:  roughly six hours later I received an email probably from the same guy but this time he went by the name Larry.  Same back and forth, still no new phone and now Larry has gone dark.  I tell this story to friends and they always say why don't you just get an iPhone, they would set you up with a new one same day at the store.  Okay Apple, I resisted your urges but I am all yours now.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-12-20T17:50:23.520956+00:00",
    "reply": "0 Replies"
}