{
    "url": "https://support.google.com/pixelphone/thread/62038597/motherboard-failure-it-seems-in-pixel-3-after-14-months-what-do-i-do?hl=en",
    "title": "Motherboard failure (it seems?) in Pixel 3 after 14 months - What do I do?",
    "content": "Hi,\n\nI have had the Pixel 3 for a little over a year (bought from Google in May, 2019). I have had digitization problems a few times in the past, but it has recently been happening more often than not. It renders my phone basically useless until it decides to work again. I contacted Google, they were not able to help. I did the hard reset and every other troubleshooting I was told to do. I took it to UBreakIFix (Google's authorized repair partner), and they were not able to fix anything. It wasn't the screen or the battery. Their solution was for me to buy a new $300 motherboard for the phone that I spent almost $500 on a little over a year ago.\n\nSo I guess I am looking for some way for Google to right this. I don't see how they would be able to look at my circumstance and not care. I really like Google, have always chosen their ecosystem, and have been happy with my first Google hardware (this phone) aside from this issue. Never had a problem like this with any of the Android phones I have used in the past. I'm hoping that this can get resolved so I can continue to have faith in their products and service. I use the Google Fi provider, utilize the full suite of apps, etc. Faithful Google/Android, never Apple so far.\n\nAnd just in case it matters, my phone is pristine. I treat it well, never dropped, no blemishes. The phone has just flat out failed me through no fault of my own after a little over a year. And the solution I have been given so far was to spend 60% of the original phone price on a new part so the phone can be used beyond 14 months.\n\nThanks a bunch in advance for helping me get this resolved satisfactorily.\nwill",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2020-07-31T01:15:18.992607+00:00",
    "reply": "1 Recommended Answer"
}