{
    "url": "https://support.google.com/pixelphone/thread/100485563/gorilla-glass-3-on-pixel-4a-is-a-lie?hl=en",
    "title": "Gorilla Glass 3 on Pixel 4a is a LIE!!!",
    "content": "I am EXTREMELY disappointed with Google's Pixel 4a.  I have owned Pixel for the last several years.  My husband and I started with the original Pixel phone and are now into the 4th and 5th generations.  We have been very happy with Google.  Until now. Google used to stand behind their products.  I've only had my Pixel 4a for a month and a half.  The screen on my phone shattered from a minor drop ONTO CARPET, even though it landed flat.  Of course, Google will tell you this is not covered under warranty or anything, that you need to shell out the money to fix it.  While generally this is understandable if you have had the phone for a long time, it does not bode well when one has only had the phone for a short period of time.  We had something similar happen to the original Pixel and Google stood behind their product.  They believed that the glass was defected, should not have done that, and immediately replaced it.  THAT is good customer service.  Unfortunately, this is no longer the case.  Now, of course, they'll tell you that the 4a has Gorilla Glass 3, which is supposed to be super tough and durable.  Apparently, this is a lie.  Read above.  I am very disappointed with the manufacturing of this product, the poor customer service from Google, the lack of standing behind their product, their care of their customers.  While some may think I'm just being a \"Karen\" in this circumstance, I assure you I am not.  I have been given the run around by Google on this and I felt I needed to let others know.  I've been a Google supporter for many years because they used to treat people right.  Now my faith has been shaken, especially in the quality of their products.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-03-02T19:11:12.785295+00:00",
    "reply": "1 Recommended Answer"
}