{
    "url": "https://support.google.com/pixelphone/thread/92242349/camera-takes-videos-instead-of-photos?hl=en",
    "title": "camera takes videos instead of photos",
    "content": "Hi, when I go into my camera app I assume it is going to take pictures, so I start snapping away, under pressure for work, but when I go back and look at them it has taken short videos. I can't go back and re-take them. This is really annoying. No other phone in the history of my phones has done this. Why can't it just take pictures without me having to think - oh, hang on, there is something I have to do here because this phone likes taking short videos. Why am I in video mode by accident? Not only is it annoying that I can't plug it into the computer and get them off the phone, once I go through the process of waiting for them in google photos and downloading them, half of them are vids. They seem to be a rather odd video jpeg file. Perhaps I can guide the programmers here: When you open a camera app it should default to taking still photos. Jpegs are fine. The next option is shooting video. We don't want some kind of in-between file, as these are no good to get into photoshop or view as stills. Is it supposed to do this? Do they think it is wanted? Provide the option. Allow us to switch it off. I'm a stills man not a moving jpeg man. I want small files that can be emailed. I want to get them into photoshop. It seems like everything normal I want to do with this phone is made more difficult. Shall I throw it in the bin? No settings are available in the camera app. Using a different camera app makes it even more complicated. Who knows where the photos go. How do I get them onto PC? Has anyone heard of a wire? I am not looking for a learning curve. I want to snap a photo and see it on my PC asap. I also recently bought a small digital camera that plugs into the pc because this thing is doing whatever it wants",
    "is_img": 0,
    "category": "Camera, Google Pixel 3a",
    "post_time": "2021-01-06T09:38:30.780755+00:00",
    "reply": "3 Replies"
}