{
    "url": "https://support.google.com/pixelphone/thread/103267237/brand-new-pixel-5-not-recognizing-type-c-aux?hl=en",
    "title": "Brand new Pixel 5 NOT recognizing Type C-Aux",
    "content": "I purchased a brand new Pixel 5 a few weeks ago it arrived, the playback was perfect, I loved the sound, I played music in my bedroom speakers and car speakers while driving, but after using it for a few days, I decided to switch back to my iPhone SE 2020 (it's just that Android OS UI seems weaker & complex, not to mention the massive amount of bugs it has for the most basic features, I couldn't bare any longer). Anyway, back to topic, I carefully removed the SIM card (network provider card) from the Pixel 5, and inserted it on my Apple device. \n\nInstead of returning the Pixel 5, I decided to keep it to continue listening to the device stored music (MP3, WAV, Flacs, etc)  when I connect it to my Type-C AUX cable, the music and sounds continue to come out of the device speakers.This issue wasn't present at all 2 minutes ago when it had the network SIM card? could there be an issue with Google Assistant now that is doesn't have LTE network connection? Regardless, I've tried to play music while on home WiFi but no response. What could have happened in the OS that now it doesn't recognize it? Note: All my music is stored locally and it does plays only on the Pixel 5 speakers as mentioned earlier.\n\nI cleaned the port carefully, which wasn't required, the device is new & there was absolutely nothing in the port that wasn't already cleaned. \n\nI also bought a new Type-C Aux cable certified for the Pixel 5, tested it and no results what so ever, it's like it's invisible, but get this, it DOES recognize charging and also it DOES recognize any PC connected to it, I could even plug that same port to a Chromebook to transfer files successfully, so it's not like it isn't working. \n\nAnd it's not the first time that Google Assistance Microphone options interrupt or cause issues with music playback, I previously owned a Pixel 4 that was getting a lot of issues with the Google Assistance interfering with audio playback through the port. It's ridiculous. Please help :'(",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 5",
    "post_time": "2021-03-21T21:45:26.186257+00:00",
    "reply": "1 Reply"
}