{
    "url": "https://support.google.com/pixelphone/thread/75752826/several-issues-since-android-11-update?hl=en",
    "title": "Several issues since Android 11 update",
    "content": "I have, like many many other people it seems, been having multiple issues with my Pixel 4xl since ever since android 11 launched and am completely regretting the idea that I should get the update. I'm looking for advice on how to fix these issues. List as follows\n\nFirst update to android 11:\nspotify wouldnt close\nsirius xm wouldnt open or close\nchrome wouldnt close or would crash randomly\nwouldnt receive texts randomly from people. not all the time just a random text here or there. i use the built in messages app for texting\nphone wouldnt connect to wifi sometimes. it would say its connected but i actually had to signal\ni couldnt make wifi change to a different network\nphone wouldnt connect to data when i turned off wifi\nbluetooth on my hands free headset wouldnt work sometimes but other times it did. bluetooth in my car worked fine though all the time? (like pausing or skipping songs)\nAll the issues above could be temporarily fixed by rebooting the phone. usually needed to do so about 3-4 times per day. So I was running out of patience waiting for updates to fix this and decided to factory reset.\nAfter factory reset some issues are solved for now. These still remain:\nfirst and foremost I GET HALF TEXTS NOW FOR NO REASON!?!?!?! I will literally get the end of a text but not the first part of it so it makes it a BIT confusing????\nSpotify still doesnt work properly, wont close sometimes, displays wrong song thats playing\nbluetooth headset still fails to pause and skip songs correctly\nchrome now refuses to reload a webpage when it has downloaded it for offline use (this is a new feature since factory reset)\nThis is all the new issues since the factory reset (I did this about 2 days from time of writing) and I am completely fed up with this update. Like really? I get that the 3rd party app issues are probably not Google's domain to fix but MESSAGES??? The main function of a cellphone is to contact people through voice or text and the one that is used most is now VERY unreliable!!!!\n\nI'm sick of this update and I've only had it for about 2 weeks now. I'm at a loss for what to do next because as far as I can tell I've done everything short of getting a new phone. Which is what... 1 year old? Any suggestions would be greatly appreciated!",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 4 XL",
    "post_time": "2020-10-09T00:03:16.580104+00:00",
    "reply": "1 Reply"
}