{
    "url": "https://support.google.com/pixelphone/thread/68064527/how-do-i-get-out-of-fastboot-with-my-power-button-broken?hl=en",
    "title": "How do I get out of fastboot with my power button broken?",
    "content": "My phone was knocked out of my hand and fell on its side. Now the bottom volume button does not work at all, it's as if it's been smashed/pressed in to the point where it's unable to be pressed. The increase volume button works though, and the power button still works.\nHowever, now whenever my phone runs out of battery or is hut down, it goes into fastboot mode. \n\nThe problem now is that I can't select any options in the fastboot menu using the power button. Instead of the power button acting as the 'select option' button, it instead cycles between the options in the same way that the volume button does. So the only thing I can do while in fastboot, is cycle between all of the boot options, and never actually select any of them, it's like there two volume up buttons. I usually have to wait for it to completely run out of battery while in fastboot, wait for it to charge completely and wait around 12 hours, but this takes quite some time as power usage is very low in this mode, and even then, it doesn't have a 100% success rate as sometimes it'll launch back into fastboot mode and I'll have to wait for my battery to go flat while in this mode.\n I have tried using Android Multi Tools and the minimal ADB fastboot tools to try and manually get my phone out of fastboot while plugged into my pc, but that didn't work either. It turns the screen off for a second, then immeadiately launches back into fastboot mode again. I have not tried wiping my data/cache using these programs, I consider this a last resort, at the current rate I don't think it'll do anything though.\n\nAny help would be appreciated, my hope is that perhaps I can plug in an external device like a small phone keyboard or mouse to cycle through the menu instead.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2020-08-30T22:42:46.616643+00:00",
    "reply": "1 Reply"
}