{
    "url": "https://support.google.com/pixelphone/thread/17371714/is-it-possible-to-restore-android-9-my-almost-new-pixel-3-xl-taken-down-by-android-10?hl=en",
    "title": "Is It Possible To Restore Android 9??? My Almost New Pixel 3 XL Taken Down By Android 10",
    "content": "I purchased a Pixel 3 XL earlier this year and since the update to Android 10, I've had over 10 issues materialize that I cannot seem to stop or fix.\n\nThe battery draining is obviously chief among these issues, but there is also...\n-Apps crashing constantly (including Google made apps such as Duo, Hangouts, YouTube and Gmail)\n-OS doesn't load upon restart, the Google Logo display freezes and stays unless I hard restart)\n-Photos, Videos, Files in general have suddenly been buried in folders upon subfolders\n-Items are backing up to google drive off WiFi (despite my settings indicating not to)\n-WiFi used to load and connect immediately when I'd arrive at home or work, now I have to manually refresh it or turn it on or off.\n-Device overheats when charging (sporadically) even when I turn it off or on Airplane mode,  forgetting to closing the apps guarantees it will happen, so I have to make sure I do that. \n\nI've tried factory reset and it failed as the process keeps freezing when the device restarts. I even backed up all my files (despite not really wanting to) to make sure I don't lose the files and I have to do it in small amounts to avoid the process failing so much.\n\nIf you're so willing to sell hardware Google, you should at least support it as much as those Apple tools do. I dislike almost everything about Apple, and despite buying the products for others, have never owned anything they produce, but you're really pushing me away Google and I have nowhere else to go since Windows and Blackberry are all but dead at this point.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3 XL",
    "post_time": "2019-10-21T19:46:03.128006+00:00",
    "reply": "2 Replies"
}