{
    "url": "https://support.google.com/pixelphone/thread/1872144/any-way-to-fix-bad-rotation-behavior-on-the-app-switching-screen-without-disabling-auto-rotate?hl=en",
    "title": "Any way to fix bad rotation behavior on the app switching screen without disabling auto-rotate?",
    "content": "This seems to be a problem whenever auto rotate is enabled.  By default the home-screen is landscape-only, which is fine and how I prefer it.  The issue is that this 'default' does not apply to the recent app view/app switcher.  \n\nThe way this behavior manifests is that if my phone is on a desk or other flat surface, it will be in portrait view in the home screen, but if I swipe up to get to the recent app view, there seems to be a 50/50 chance it will switch that specific view to landscape, turning everything 90 degrees and changing the direction needed to swipe to close etc.  \n\nIf you are holding the phone vertically in-front of you, its not an issue as obviously the sensor will indicate everything should remain portrait, but if it is on the desk you can't tell if the sensors feel it is technically 'portrait' or 'landscape' since its just laying flat there to begin with and you might as well flip a coin as to what orientation that the app switch screen will come up.\n\nIn prior versions of android that screen seemed to be 'informed' not just from the sensor but also what the orientation of the last 'view' or app you were in when you launched it.  i.e. if playing a game locked to landscape mode and opening that screen, it would still open landscape, even if the device was flat on a table and/or the 'sensor' last read was a portrait one.\n\nIn android 9 it seems like it always favors the sensor readings which is causing kind of random/guesswork behavior if the phone is set down and it means I kind of cringe every time I go to open the screen because I never know whether its going to sit there and then rotate 90 degrees on me or not.  So instead of a quick flick like the gesture is supposed to be its always a flick, sit there, wait, see if it turns, if it turns re-adjust my internal perspective and change all my swipe options by 90 degrees, or just try and pick the phone up off the desk to have it turn back etc, then swipe to the other/recent app I want. \n\nEither way it takes what used to be a half-second near-thoughtless navigation gesture and makes it a 4-5 second series of steps I need to focus/concentrate on.  Having the 'last seen' screens all be in their original orientation doesn't help matters because even if it switches to landscape view and navigation the apps will still 'look' portrait and its just the main phone status bar etc that will be visually rotated and serve as an indicator that the UI is now turned 90 degrees from what it was a half-second ago.\n\nBasically instead of observing the orientation of the app (or home screen) that it is opening from, it is *always* subservient to the sensor data, which can disagree when the app is 'locking' the orientation (either portrait or landscape) and/or the sensor data is ambiguous (laying flat on a desk, so neither definitively portrait nor landscape) and that causes delays or directional ambiguity when they don't match and things start rotating in unexpected ways.",
    "is_img": 0,
    "category": "Homescreen and Launcher, Google Pixel 3",
    "post_time": "2019-02-25T23:18:52.582211+00:00",
    "reply": "0 Replies"
}