{
    "url": "https://support.google.com/pixelphone/thread/62045965/camera-roll-not-showing-pictures-and-photos-not-backing-up-the-same-pictures?hl=en",
    "title": "Camera Roll not showing pictures, and Photos not backing up the same pictures",
    "content": "Hey Everyone,\nCould use some help with this.  I have done a lot of troubleshooting and will try to describe everything.\n\nThe camera roll is not showing any pictures.  I take a picture, see it hit the camera roll to the right, then click the roll and the picture will load.  I see a progress circle in the bottom left then the camera app closes and photos opens, the new picture is not there.  I reopen the camera and the camera roll is grey with no pictures.  If I touch to open nothing happens.  I have Astro file manager installed and can see the picture saved to the DCIM/Camera folder fine, in JPG format.  \n\nVideos work fine with MP4 format, videos actually show fine in the camera roll\n\nI have tried the RAW thing, this gets the pictures to show up in photos but not the camera roll, but creates 3 pictures for every one taken and is not practical for space.  \n\nI have cleared the cache in both Photos and Camera, I have booted in Safe mode, same issue.\n\nI have factory reset my phone.  After this and before restoring from a backup I tested one picture.  I was able to see the picture in the camera roll and clicked it to open and it showed fine.  I did not test photos as it needed to be set up yet.  \n\nI restored from a backup before the reset, the issue returned\n\nThe camera folder is not showing up as selected in the backup folders but I don't think this matters because the camera folder is the default and is backed up by default.  \n\nPermissions are showing fully allowed for each app.  However, if I go to Permission Manager/Additional Permissions I see access Google Photos and 0 of 0 apps allowed.  I am unable to select any apps to allow this.  \n Any help is appreciated.\nThanks,\nRyan",
    "is_img": 0,
    "category": "Camera, Google Pixel 4 XL",
    "post_time": "2020-07-31T02:19:01.65973+00:00",
    "reply": "3 Replies"
}