{
    "url": "https://support.google.com/pixelphone/thread/4471364/how-do-i-contact-google-for-technical-support-for-my-pixel-xl-appreciate-your-help?hl=en",
    "title": "How do I contact Google for technical support for my Pixel XL.Appreciate your help.",
    "content": "Recently, I purchased a used pixel XL, that was officially certified refurbished. When installing and personalizing my pixel XL via my carrier, there was a problem getting the MMS downloads in my messages. When I clicked the blue icon with a downward arrow  to access a download, it would act as though it was 'working on retrieving' it (actively circling w/I icon) and failed to retrieve the download. The active circling within the icon continued endlessly without any results. I literally had to close page to get it to stop. My carrier said that the SMS is working properly but whenever we try to download MMS it was unsuccessful. I must have called five different times to get help on how to correct the problem and no one could figure out how to make it work. My previous phone, Samsung Galaxy 7 edge, was stolen so I had no way of transferring my contacts, photos, etc from that phone on to my pixel XL. Fortunately I had backed up everything onto Google so I could restore all my info in case my Galaxy 7 edge was ever lost or stolen. When it came to retrieving all that info, some of it was not retrieved. I originally had 173 + contacts and only about 70 we're actually retrieved. Things just got more screwed up from there. For some reason they had me sync my partners contacts in with mine (that's a long story) but basically what happened is all of his contacts were deleted, I guess during the syncing, and that's when I lost over a hundred of my contacts as well. So here I sit after 5 calls for technical support from my carrier and I am left with a partial list of my contacts, my partner's contacts are nowhere to be found along with the rest of my contacts and it's still can't download MMS messages. My phone still processes SMS texting in message without any problems. Finally the last few people I spoke to told me I needed to contact Google to correct the problem. I don't know how to contact Google, technical support and I'm at the point that I'm overthinking everything and very little makes any sense right now. I think that's called burnout and I've only had this phone a week.\nI'm hoping to at least get a phone number for Google technical support. Ideally there might be a miracle worker out there who can guide me through the process of locating the problem correcting those things that need fixin and retrieving all of the lost contacts not to mention photos, etc plus a large amount of journaling & lots of otther notes. \nCan anyone out there help out...I'd be grateful for just a Google # & delighted if they could guide me in fixing anything. I was so excited to get a Pixel.\nI've got the time and patience to try this again with someone out there in 'answer land'.\nThanks for reading my hugely lengthy message. ✌️",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel",
    "post_time": "2019-04-19T01:56:02.135207+00:00",
    "reply": "4 Replies"
}