{
    "url": "https://support.google.com/pixelphone/thread/104491934/texts-not-received-while-phone-is-off-pixel-3a-both-native-and-3rd-party-apps?hl=en",
    "title": "Texts not received while phone is off (pixel 3a, both native and 3rd party apps)",
    "content": "I am running into a problem where messages that get sent to my phone while it is off (typically overnight) do not come through when I turn my phone back on. As mentioned in the question statement, this behavior occurs with both the native Messages app as well as 3rd party apps (typically Textra but also tested with QKSMS). The behavior has been somewhat irregular and hard to pin down. For instance, messages that are sent relatively close (~2 hrs) to when the phone is turned back on tend to come through, but this is not always the case.\n\nBelow are the results of two tests I carried out. The first was with messages getting sent to both a single person thread (SMS) and group text (MMS), and was using QKSMS. The second included messages sent from two different senders, though both were only sending SMS messages, and Messages (native app) was set as the default app.\n\nTest 1\nPhone off 6:36 pm\nPhone back on at 9:17\nFirst tests sent at 6:40 - neither received\nSecond tests sent at 7:47 - both received\nThird tests sent at 9:11 - both received (the MMS also included another text from a different sender that was also sent to the group chat)\n\nTest 2\nPhone off 9:44 pm\nPhone on 12:32 am\nFirst test sent 9:46 pm - not received (sender 1)\nSecond test sent 10:31 pm - not received (sender 1)\nThird test sent 11:15 pm - not received (sender 1)\nFourth test sent 12:09 am - sender 1 not received, sender 2 received\nFifth test sent 12:30 am - received (sender 2)\n\nIf it makes a difference, the sender (and all participants in the group text) from test 1 are using iPhones, as is sender 1 from test 2. Only sender 2 from test 2 does not use an iPhone.\n\nIn test 2 only one sender's messages came through, while in test 1 multiple senders messages came through.\n\nThe inconsistent behavior has made isolating the problem quite difficult.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2021-03-31T04:41:40.530826+00:00",
    "reply": "0 Replies"
}