{
    "url": "https://support.google.com/pixelphone/thread/63823408/pixel-2xl-won-t-boot?hl=en",
    "title": "Pixel 2XL won't boot",
    "content": "Hi everyone. I've gone through a couple of post here in order to fix my issue, but didn't find the exact same situation in other pots, that's why I'm opening a new one. \nEverything started on January 2020. My phone felt into the sand. Since then, I had some issues when trying to charge it. Every time I plugged it in,  the phone shut down. It would charge it, but it was not possible to use the phone while it was being charged.\n\nCouple of weeks later, one day I woke up and my phone didn't boot. I had automatic updates set, so not sure if during that night the phone made a new update or what. Every time I wanted to turned it on, it said something like \"Your data maybe corrupted\". At that time, I tried to follow some recommendations of different posts but nothing was working. I put the phone in the drawyer hoping that after some time, some magic thing would happen and would help me fixing this. \n\nYesteday, I tried to turned the phone on again. Now I have a different error. If I try to turn it on as usual, it would boot until the page where I have to put the pin. Inmediately after that, the pop up saying \"Powering off..\" will appear and the phone will shut down. I tried to use the recovery mode also. This time, the message that use to appear is not popping up any longer.\n\nAnother strange this, is that if the phone is plugged in directly to a charger of 110V (with transformer) it will restart it self almost repeatedly. But, when I plug it in to a Laptop with USB, it will charge normally. \n\nI tried to upload an OTA image through ADB, but my phone hasn't the USB debugging activated. Therefore, ADB never find the device. \n\nUnfortunately, I don't have the data (pictures/videos etc) sync with the cloud. \nMy only hope is to try to recover that data. I'm not really interested in the phone any more, just need the videos and pictures. \nDoes anyone have an idea on how this could be accomplished? \n\nThank you so much",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-08-09T16:55:27.695152+00:00",
    "reply": "0 Replies"
}