{
    "url": "https://support.google.com/pixelphone/thread/27387240/google-sent-me-a-non-working-replacement-now-sends-me-a-stolen-imei-blacklisted-replacement?hl=en",
    "title": "Google sent me a non working replacement, now sends me a stolen/IMEI blacklisted replacement",
    "content": "First started having problems with my pixel 3 weeks after buying. Lived in rural utah and couldn't be without a phone for two weeks to send in. I waited until recently, and since the problems persisted finally sent it in. They sent me back a refurb that thought it was overheating right out of the box, even outside in the cold. Contacted support same day. They forwarded to supervisor, who emailed, then ignored me for about a week. Finally got contacted, and sent it back. Now I received yesterday a reported stolen IMEI blacklist refurb from google. Verizon locked my number, and reported it to fraud that I tried to activate a stolen device. \n\nGoogle support as usual doesn't seem to actually care at all. The reps just offer me to send it back again and \"better luck next time\" on my next refurb. Someone told me a supervisor would contact me in an hour, never contacted me. Finally I got through to a supervisor on the phone who was incredibly rude and discourteous did not seem to care LJ 34212 is his employee details so he said. I tried to explain how serious it is that they keep sending me refurbished phones that are trash. They dont even apologize, they dont even take a shred of responsibility for what they are doing. All they do is give the BS line that refurb phones are inspected throughly etc, but that is clearly crap. All I had to do was search google to find that this IMEI was backlisted. \n\nI kept asking him if any higher company representatives could be contacted about what is going on here,\n\"I am the last person you will talk to about this\" he kept saying\nhe also said \"the only thing we will be able to do is keep sending you phones, and hope that one of them\nworks\"...........unbeleivable. Who would buy a pixel if they knew this?  What can I do ? Do I contact the police about the stolen phone? Do I report a fraud or consumer complaint? I just want to make sure everyone thinking about buying a pixel knows this. Investors should know this! Google got sued not long ago for scamming their customers by selling them trash phones or something. \n\nIF anyone at google is reading this please make this right! ",
    "is_img": 1,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-02-01T22:50:31.326241+00:00",
    "reply": "5 Replies"
}