{
    "url": "https://support.google.com/pixelphone/thread/18700953/pixel-stand-issues-photo-frame-needs-a-brightly-lit-environment-and-more?hl=en",
    "title": "Pixel Stand issues (photo frame needs a brightly lit environment and more)",
    "content": "Phone: Google Pixel 3\nSoftware: Android 10 - November update\n\nI've purchased the Pixel Stand recently and I have a few complaints. It basically comes down that the stand has features like the photo frame and Pixel Stand ambient display, but none of them are really great by itself. The only feature that seems to work flawless is the sunrise alarm. The complaints I have are actually easy to fix because some features already  exists, but simply are not integrated. Or can be fixed by adding more options in the features.\n\nThe photo frame feature:\n* The photo frame doesn't show notifications. Only the time and battery status is shown. This prevents the user to see the notifications which are otherwise displayed on the ambient display. Thus the user has to stop the slide show from time to time to check for notifications, which shouldn't be necessary.\n* The time + battery info moves from left to right with every photo transition, which is good, this prevents screen burn-in. However, the size of the battery information can often be wide enough to move outside of the screen. The little information that's provided on the photo frame is then not even readable.\n* The photo frame doesn't include settings like; transition effects and the delay between transitions.\n* The photo frame doesn't work in low light environments. I've tried to remodel my living room to make my Pixel Stand work. This of course is a sign of a bad product. People shouldn't have to rethink their home to use product to its full potential... Even if you've found a spot where the Pixel Stand will activate the photo frame, a shadow of person walking by    \nthe Pixel Stand could deactivate the photo frame. The phone has to be replaced on the stand when that happens in order to reactivate the photo frame feature.\n\nThis makes the photo frame feature a half finished experience. This product is out for a year already. Everyone that uses this product should have doubts about these design choices. Unless Google doesn't use their own products.\n\n\nThe ambient display:\n* The ambient display often flashes when the night light feature is enabled. This looks very buggy.\n* The ambient display doesn't slowly move the text every minute to prevent burn-in. However, the photo frame does and the regular ambient display as well.\n* Music and the podcast app have full screen controls, which are really nice. But again, only if the room is bright enough.\n\nThe ambient display has less issues, but a setting to disable the low-light restriction would be of great help to make the Pixel Stand more useful in every room and at any time. It seems like the Pixel Stand is made to be next to your bed? Because I don't see any other reason why low-light conditions disable full screen controls or photo frame slide shows.\n\n\nSome solutions:\n* Add a setting to allow notifications during the photo frame slideshow, just like with the ambient display. This can be placed between the time and battery info.\n* Allow a user to select different transition effects and configure the delay between these transitions. Some users might want to see faster transitions, others maybe even slower transitions.\n* Take into account the width of the battery information on the photo frame, that width shouldn't move outside of the screen.\n* Add an option to always use the Pixel Stand full screen features such as the music controls and the photo frame. At the moment, low-light environments prevent the use of these features in some rooms, even during the day.\n* Make the ambient display move a few pixels every minute, just like the regular ambient display.\n* Please fix the display flashes when using the nightlight feature with the Pixel Stand.",
    "is_img": 0,
    "category": "Other, Google Pixel Stand",
    "post_time": "2019-11-06T10:05:56.190217+00:00",
    "reply": "2 Replies"
}