{
    "url": "https://support.google.com/pixelphone/thread/79902279/help-restoring-sms-from-cloud-backup?hl=en",
    "title": "Help Restoring SMS From Cloud Backup",
    "content": "Hello everyone. This is a bit of a long story, so stay with me. I own a Google Pixel (original, what ever the first version was). On it there are two gmail accounts. The primary one is a .edu hosted by gmail (I'll call it account 1), and the secondary is a personal gmail account (account 2). Prior to doing a factory reset to try to fix a camera issue. I did a backup to Google Drive, and made sure that SMS and all other data was selected for backup. This backed up to Account 1.\n\nI performed the reset and during bootup, went through the process of telling the phone to restore my settings and data from the backup. The phone restores everything (pictures, contacts, voicemails, etc) except for text messages. I tried this process multiple times. In addition, I tried removing, and reapplying Account 1. I repeated the process using the data from Account 2 just to be sure.\n\nOne of the puzzling parts is that when I log into Google Drive through Account 1, and go to the drop down menu in the upper left, there is no \"backup\" category to select. However, when I log into Google Drive with Account 2, I can select \"backup\" at which point I am given a message to the effect of saying that Account 2 is not the backup location, and then can click a link that says \"switch account.\" When I click this link, I can then see the backed up data, but find that, upon hitting \"back,\" I am still logged into Account 2, and have not actually switched accounts.\n\nFor multiple reasons, I purchased a Pixel 5, and when booting it up for the first time, set the phone to restore data and settings from the backup. Once again, I get the same results: everything restores except for text messages. In fact, the whole situation is identical, regardless of device. I have tried accessing the backup through SMS Backup+ and SMS Backup and Restore. Backup+ at least behaves like it is restoring the backup (although I don't know what it's accessing) but does not restore anything. Backup and Restore is unable to locate the backup file on Google Drive (even though I have set it to access all files, not just files that it has created); and when I browse Google Drive manually through Backup and Restore, I cannot find the backup file.\n\nIt's there. I can see it from multiple devices (phone, laptop, PC), I just can't restore it. Anyone have suggestions?",
    "is_img": 0,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-10-29T23:59:52.067283+00:00",
    "reply": "3 Replies"
}