{
    "url": "https://support.google.com/pixelphone/thread/1969899/pixel-2-xl-is-not-recognized-as-a-usb-device-no-file-transfer-headphone-dongle-not-working?hl=en",
    "title": "Pixel 2 XL is not recognized as a USB device (no file transfer) & Headphone dongle not working.",
    "content": "Pixel 2 XL connector issues.\nSome critical issues with the USB type C charging port have started to occur recently:\n\n1. It is impossible to charge the Pixel anymore with any type of device, except when using the original cable from the box with the original charging brick, or charging with a computer.\nIt was working just fine only a week ago.\n\n2. The headphones dongle from the box have stopped working with the Pixel. While connected, the music is played through the speakers. It does work when connecting it to my Windows laptop.\n\n3. The phone is not being recognized anymore as a device while connected to any kind of computer. It does charge it with the original cable, but nothing more than that. It also did work just fine about a week ago. Nothing appears in the Pixel, except that it is being charged. Also, nothing appears in the PC.\n\nWhat I already have tried to do:\n1. Switching cables, chargers, ports, OS and PC, in order to decline the option for a problem with a specific accessory.\n2. Turning ON/OFF the Pixel and the PC while being connected/disconnected.\n3. Reset the pixel 2 XL to factory and erasing all the data & settings.\n4. Enable and disable the relevant developer options and trying again after rebooting (Relevant options: USB debugging, default USB configuration set to file transfer, etc).\n5. Reboot in Safe Mode and try again.\n6. Cleaning the USB port.\n7. Update all of the Drivers in the PCs and in the Pixel.\n\nWhile searching in the internet I could see that I'm not the only one having those issues, but none of the other users with it have a working solution.\n\nLooking forward for your help,\nNadav.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-03-01T20:59:27.702417+00:00",
    "reply": "1 Recommended Answer"
}