{
    "url": "https://support.google.com/pixelphone/thread/1296436/no-sound-no-speakers-headphone-jack-calls-microphone?hl=en",
    "title": "No sound. No speakers, headphone jack, calls , microphone.",
    "content": "Hi,\n\nI bought my phone Pixel XL pre owned by someone else around June 2018. It was working all fine and it functioned as a very normal phone ever after about a month I wasn't able make calls like the others cant hear what I'm saying (no mic) etc. I'll soft reset the the phone (volume up+power ) and it would come back to normal and slowly eventually all my audio had stopped. Like my headphone jack wouldnt work and then the speakers wouldn't work I can't make calls it'll tell me the phone stopped working and then system ui has stopped working and so on. I can't record audio while taking videos it would say another app is using the mic. I have been having a very hard time with this. And I'm not the only one the other people who have experienced the same problems are either from 2017 or earlier who got the problem as soon as they bought them so sent it back and got new ones I didn't buy it from a shop literally a dude I met on dubais Craigslist ( Dubizzle) \nTried telling him about the problem he had no idea and told me stfu (literally stfu). Then I tried resetting it a lot of times doesnt help and then gave it to a shop they didn't know what the problem was. And I am based out of Dubai. We don't have Google repair centres here, other people had got free motherboard replacement as that was what the issue was. Please Google I beg you I love my phone and I can't afford to get another phone and move on I want you people to figure this out and get my phone fixed. And nothing can be done through these threads and forums I seriously need attention from Google. Please contact me. Thank you. Anybody who can help?. Please and thank you",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-01-26T18:16:46.898629+00:00",
    "reply": "1 Recommended Answer"
}