{
    "url": "https://support.google.com/pixelphone/thread/53640033/assistant-and-pixel-ambient-services-conflicting?hl=en",
    "title": "Assistant and Pixel Ambient Services conflicting",
    "content": "Enabling Assistant and Pixel Ambient Services (hereto as PAS) creates a conflict in which Assistant can't use the mic properly.\n\nWith PAS enabled, Assistant will still ALWAYS respond to \"Okay Google\". However, once the tray opens, Assistant briefly hangs while waiting for the \"What's playing?\" suggested action button to be sent over from PAS.\n\nIt appears that in that interval, Assistant is prevented from activating the mic properly, so it never \"hears\" my command and after the \"no command\" timeout interval elapses, and the app will just default to the generic \"There's a lot I can help with\" screen.\n\nThis issue occurs 100% of the time if the screen is already off (I use swipe to unlock). Issue is intermittent if the screen is already on and seems related to whether there's enough ambient audio nearby that PAS is actively attempting to identify it (even if that ambience is just noise).\n\nALL above symptoms are alleviated as soon as PAS is disabled.\nALL above symptoms immediately reappear if PAS is re-enabled.\nNONE of the settings found under \"Settings > Google Assistant > Assistant tab > Assistant Devices > [phone]\" affect this issue to any degree and all above symptoms stay constant with any combination of settings.\nALL apps on my phone have their most recent Play Store updates as of today, June 15.\nI performed all suggested \"support\" steps from Google, which amounted to just clearing and re-downloading my voice model. They seemed completely unaware of the conflict between these two apps.\nDevice is only 72 hours old, so this isn't a \"factory reset to fix\" kind of thing.\n\nIt would appear that I'm at the point that in order to use PAS alongside Assistant, Google's engineers need to fix the former app.",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel 3a",
    "post_time": "2020-06-15T16:28:53.210992+00:00",
    "reply": "1 Reply"
}