{
    "url": "https://support.google.com/pixelphone/thread/27209103/pretty-displeased-with-google-s-support-it-was-around-two-weeks-ago-when-i-reported-my-pixel-4xl?hl=en",
    "title": "Pretty displeased with Google's support. It was around two weeks ago when I reported my pixel 4xl",
    "content": "Pretty displeased with google and their \"support\". I reported 2 weeks ago that my phone was already having battery issues, the phone is not even a month old yet. I already reported that the battery percent age freezes at either 50% or 70% doesn't matter if I charge the phone or try to run the battery down, there is no change. Yesterday my phone started shutting itself off randomly today the issues have continued. Yesterday I was on the phone with at&t for over 3 hours trying to get these issues resolved well  go figure at&t pushed me off on to google support saying I need to get a manufacturer warranty to get a new phone, guess what Google's resolution is? I take my phone to some no name store to do a diagnostic and possibly repair the phone, I don't want the phone repaired it should of never got through quality control with these issues I simply want a new phone. I can't get a new phone without sending my phone away to google doing a diagnostic to determine whether or not I should get a new phone. Look I've read the forums and there are plenty of people with these same exact issues. Fact is google and the phone providers are selling a product that doesn't meet the criteria for consumers to use. With the amount of proof and people having these issues I could just speak to my attorney and have them draw up a class action lawsuit which would be easily won with all the proof out there, so I say google just do the right thing and send people new 100% working phones or go to court and lose millions possibly billions of dollars for selling a faulty product to people. Just a reminder false advertising is a felony in the US.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2020-01-31T01:18:41.169565+00:00",
    "reply": "1 Reply"
}