{
    "url": "https://support.google.com/pixelphone/thread/5791400/battery-drain-and-retention-issues-on-original-pixel-since-january?hl=en",
    "title": "Battery Drain and Retention Issues on Original Pixel Since January",
    "content": "Since January my phone has completely lost the ability to hold a charge for longer than an hour when being used and maybe up to 4-6 hours without touching it at all (if I'm lucky).  It will also turn off when I go to send a text or open an app when the battery says it's at 40-70%.  In the past, I used to be able to get 8+ hours of consistent use and still have about 15-20% of battery and if I wasn't using it I could get almost 18-24+ hours.  \nI've also noticed it has started to have charging issues when it turns itself off and won't come back up; it will say it's charging and when it actually allows me to restart it after an unnecessarily long wait time there is only 12-15% of battery even if it's been connected for over an hour.  Previously charging this phone was amazing and was usually fully charged within an hour or less no matter what it was plugged into.\nI had it run a battery test multiple times and it says it's fine. \nI tried installing a Kernel to help with battery power/tracking and it's saying that it's using about 13% of it's battery capacity. \nI uninstalled all newly installed apps from right before the battery issues began.\nI factory reset my phone as suggested when I googled the issue (ironically, the first time I tried to search my phone turned itself off).\nTo say this is frustrating is an understatement because I love my phone and it functioned amazingly for a being a year and a half old.  The screen protector has just barely started to crack and chip on the edges at almost 2 years and I've had a Speck case on it since day 1.  It's never been under, near or really around water and I very rarely drop it so I'm just not sure what else there is to do besides get rid of it.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel",
    "post_time": "2019-05-09T12:46:15.873941+00:00",
    "reply": "2 Replies"
}