{
    "url": "https://support.google.com/pixelphone/thread/108200137/i-have-a-website-that-i-downloaded-off-the-internet-and-view-locally-in-a-browser-not-working?hl=en",
    "title": "I have a website that I downloaded off the internet and view locally in a browser. Not working.",
    "content": "There is a website that I refer to many times in the day. I downloaded it from the internet and saved it to my hard drive, using a website stripping program that changed all the links to point to the local version of the website instead of the internet. I have this website on all my devices, and use a web browser to access this information. I have always used it also on my smart phones with no problem, but for some reason when I copied this website to my phone storage it isn't working properly.\n\nWhat happens is that I can click on an individual htm file in a file manager and have it open in a browser, but if I click a link in the page that should point to another local htm file, I get a Page Not Found error.\n\nI believe the problem may be related to the fact that the path to the file in the address bar of the browser is very different in this phone. In my old phone, where the website worked fine, the format of a typical page from this local website in the address bar was:\n\nfile:///sdcard/Breviary/START.htm\n\nAnd that worked great. But in my Pixel 4a, the path that shows up for that same exact file is:\n\ncontent://com.mi.android.globalFileexplorer.myprovider/external_files/Breviary/START.htm\n\nThe fact that path is so different is likely a problem.\n\nI spoke with a Google tech and he tried to diagnose the problem, and he thought maybe the link had been changed automatically when I copied the folder containing this offline website into my phone memory. He said it seemed the path to the page referenced in the link had been changed, which is why the link is broken.\n\nPartial confirmation of this maybe be in a bizarre effect I noticed when I copied the folder to the phone. I copied it as a ZIP file, and decompressed it. But when I looked at the files after decompression, I was surprised to see that something had changed all the file names and added an .html extension, so that every file that was supposed to end in .htm now ended in .htm.html\n\nPlease help. I use this website numerous times every day, and need to have it work locally on my phone because I often don't have internet access. If I can't get this to work, I will need to send back the phone.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-04-30T22:23:49.897643+00:00",
    "reply": "0 Replies"
}