{
    "url": "https://support.google.com/pixelphone/thread/2311057/how-do-i-get-an-external-dac-amp-to-work-with-my-pixel-2-xl?hl=en",
    "title": "How do I get an external DAC/AMP to work with my Pixel 2 XL?",
    "content": "I am trying to connect my phone to an external DAC/AMP. The problem is that the DAC/AMP will not produce any sound.\n\nEverything that I have tried:\n\nI am using a Satechi – Aluminum Type C Mobile Pro Hub. This is so I can both charge and send data to the DAC/AMPs.\n\nI have three DAC/AMPs\n1)      Moshi - USB-C Digital Audio Adapter with Charging\n2)      Focusrite - SCARLETT SOLO\n3)      JDS Labs – The Element\n\nBoth1 and 2 are both USB powered devices, while the 3 has an external power supply.\n\nBoth 1 and 2 work with my phone, while 3 kind of works.\n\nWhen I connect my phone to 3 I believe the phone recognizes the DAC/AMP. This is because when I try to play music the phone speakers do no turn on. Also, if I disconnect 3 from my phone the music player on my phone pauses the music.\n\nThe problem that I have is that when I plug in my headphones into 3 while playing music on my phone there is no sound. I have ruled out the hub as a problem because it works fine with 2 and when using it to connect 3 to my computer.\n\nFrom what I have seen it seems to be a problem with Android and how it handles externals DAC/AMPs.\n\nBoth 1 and 2 are USB powered, thus the phone is sending both audio information and power. At the software level, Android knows this and thus does not turn on the phone speakers when playing music, but rather send the signal to the DAC/AMP.\n\n3 uses an external power supply, so it does not need power for the USB connection. Thus, the phone only needs to send audio information. At a software level, the phone seems the understand that a DAC/AMP is connected and thus does not turn on the phone speakers when playing music. However, the phone also does not seem to be sending any audio information to the DAC/AMP.\n\nFor this simple analysis, it seems that Android will only send audio information to a DAC/AMP if the DAC/AMP also is powered by the same connection.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-03-12T22:50:20.018715+00:00",
    "reply": "0 Replies"
}