{
    "url": "https://support.google.com/pixelphone/thread/48816024/intermittent-data-issues-for-only-a-subset-of-apps-websites?hl=en",
    "title": "Intermittent data issues for only a subset of apps/websites",
    "content": "I recently purchased the 3a to upgrade from my old Nexus 5x and, due to the recent lockdown measures in the UK, I've not been out and about with it very often, but now the restrictions are being relaxed I've noticed some issues with mobile data (as in the house I've mostly been on Wi-Fi), but only for some apps/websites and not all the time.\nWhen I leave the house and disconnect from the wi-fi I find I can no longer stream music through Amazon Music App or podcasts via the Google Podcast app. The phone shows a good 4g signal and most websites appear to load rapidly without problem (and are not cached for an offline experience) including reddit, facebook and the BBC, but I cannot load the outlook.live page (to check my work email account), it just hangs as if trying to load, but never actually goes anywhere. This has got me stumped as I think what could be causing this to only impact some websites/apps but not all.\n\nToday I was streaming music via Amazon whilst driving, initially still buffered from the house wifi, but it soon cut out and could not be restarted. I pulled into a garage and found that I could stream a movie via Amazon Prime app, but not play music or use the amazon shopping app either. I could send and receive messages in Whatsapp and go to most websites, but again not outlook.\nI tried restarting the device. Clearing the cache of the apps and the google app itself, no change. Tried turning mobile data on/off and going into aeroplane mode and back again, no difference. I gave up, but found I could play streaming music through Google Play app, so did that instead. Later I checked again and all seemed fine (amazon music played ok and outlook loaded instantly) so I left things as they were, but once again the problem re-occurred when I was heading home.\n\nI've been driving around quite a lot listening to music and podcasts and it has only recently become very noticeable, but I've not really thought too much of it as it was very sporadic, but that was likely down to the stay at home measures and now it is becoming much more problematic.\n\nAny ideas? Is there something really obvious I've missed? All apps are set to stream on mobile data (and as I mentioned, they will work at some times, not others, regardless of the displayed phone signal and ability to visit other website/stream other apps). \n\nI tried loading in safe mode, but I get no signal at all there (should I?) so could not test. I've performed a factory reset and the problem persists. I've put the sim back in my old phone and all worked fine on mobile data. As soon as I put the sim back in my 3a the problem returned, so it is definitely to do with the phone and not the network provider.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a",
    "post_time": "2020-05-24T09:13:16.188167+00:00",
    "reply": "7 Replies"
}