{
    "url": "https://support.google.com/pixelphone/thread/55504101/why-i-m-not-eligible-for-warranty-options?hl=en",
    "title": "Why I'm not eligible for warranty options?",
    "content": "Let me tell you my story with Google Pixel.\n\nSince Google Pixel 2, I was a very loyal customer to Google. I updated Google 2 to Google Pixel 3, than I moved forward and updated Google Pixel 3 to Google Pixel 4 XL. \n\nPixel 2 was purchased brand new from the third party electronics shop, unopened box, brand new etc. Google Pixel 3, was purchased straight from Google, by my E-Mail from Google Store.\n\nGoogle Pixel 4 XL I purchased from a person, but the box was unopened, it was sealed by factory, inside of it, there was a Fi sim card, shortly, the first person who activated device was me and my account.\n\nafter 2 days, in camera mode, zoom lens started showing black hole in the pictures. I have never dropped my phone, nor left it under the sun. Even I captured few pictures, it was never heated, as I loved it from the first sight I decided to carry my device as a child (I'm a very good owner in general).\n\nI asked for my phone's warranty options and one of Google's agents (as I'm the paid customer of Google One) told me that my phone is brand new, first activation was under my E-mail and warranty options are available until the may of 2021.\n\nWhen I said my problem he addressed me to another agent who was responsible for replacement and warranty options as he decided that the camera problem was not software related.\n\nThis another agent was very rude to me. Told me that the only way to get my warranty options is if the person under whose E-mail was phone purchase writes to them for replacement.\n\nI said, I don't have an information who personally bought this device, and even I had an information, how it comes? every manufacturer, even apple clings the warranty option to the first owner of the device, first activator. Who follows the buyer from the factory? This is insane. \n\nHow it comes, that I should call the store from which I purchased an item, when the phone is with me and ask them to request replacement? this is insane. Nobody does that.\n\nI as a customer am very unhappy and disapointed with the customer service you provided. I have Apple iPad Pro 2018, I purchased it at third party store (electronics market) as well and when I needed warranty, international warranty options was clinged to my account as I was the first one who activated it.\n\nNow, I paid 800 bucks for the phone which I opened, used for 2 days and black hole appeared from nowhere, I'm sure it's factory defect, try to ask for help to the company and they tell me that I should ask the help to the seller that they ask for help to Google while I have my phone with me. This is NOT logical.\n\nIf the problem stays unsolved, I will never, I mean, never upgrade my phone to another Pixel. This is the very unpleasant experience with Google I faced and I was not expecting.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-06-25T17:37:29.543418+00:00",
    "reply": "1 Reply"
}