{
    "url": "https://support.google.com/pixelphone/thread/11884178/pixel-3a-xl-bad-reception-and-more-use-of-3g-than-4g?hl=en",
    "title": "Pixel 3a XL Bad reception and more use of 3G than 4G",
    "content": "Hello people,\n\nI recently bought the 3a XL which is a solid phone but I am running into some connectivity issues.\nI am using the phone in Germany with o2 (Telefonica) Provider and the phone's reception isn't the best.\nFor example at home my phone constantly uses 3G instead of 4G. My previous P20 Pro connected to 3G on the parking lot but as soon as I was entering the house it switched to 4G+ and stayed there. The signal strength was around -100dbm\nMy Pixel however only uses 3G. As soon as I drive away from home, it switches to 4G+.\nSame at work. Stays at 3G all the time, as soon as I drive away from that place 4G+ again.\nYes, I am 100 percent sure, that there are no issues with the 4G towers nearby because it simultaneously double checked it with an other phone.\nIt's not like it doesn't connect to 4G at all, but it is still strange.\nAn other thing that cought my attention is that the 3a XL has a lower signal strength in general to my P20 pro, there is a constant difference between 5-7dbm.\n\nMy assumption: I guess the pixel connects to the stronger network by default and doesn't care about if it is 3G or 4G. At home there is a difference of 25dbm between them (3G has -75dbm and 4G around -100dbm). The -100 at 4G hasn't been a problem at all for the Huawei, while the pixel only sticks to 3G and I can't force it to stay at 4G.\nEven after enabling and disabling the airplane mode, as well as restarting the device, the pixel stubbornly stays at 3G.\nAnd as I have mentioned the signal strength is a bit more bad than on the Huawei.\nI'd like my phone to be connected to 4G more often because of VoLTE.\n\nAnyone else facing these \"issues\" or has some suggestions?\nThanks in advance!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a XL",
    "post_time": "2019-08-13T08:22:53.843876+00:00",
    "reply": "1 Recommended Answer"
}