{
    "url": "https://support.google.com/pixelphone/thread/97711253/port-issue-with-google-pixel-3-and-bad-customer-service?hl=en",
    "title": "Port Issue with Google Pixel 3 and BAD Customer Service",
    "content": "I wanted to share my experience working with Google Customer Service when my Google Pixel 3 malfunctioned a month ago.\n\nI had my Google Pixel 3 for 2 years. I noticed that I was unable to charge the phone and contacted customer service. I was told to bring it to a UbreakIfix store, which I did. I was informed that it was not a battery issue but a motherboard issue. There was no physical damage to the phone. The technician told me that this may have been a faulty phone to begin with, and it may have managed to escaped inspection before going out to market.\n\nI decided to do a trade-in and get the Google Pixel 5. Once it was shipped to Google, they again noted that there was no physical damage on the phone, that the phone was able to power up on its own (per their preliminary report).\n\nThey then reported that there was a \"port\" issue, and that the value of the phone was now around $35, instead of the estimated $100. When I pressed about the nature of the problem- what port was damaged? how can this be avoided?- I was given no explanation. In fact, my request for an explanation was DENIED (?) and that I would simply have to accept the trade-in value of the phone.\n\nNo phone call with a representative directly, just emails. I was told I was talking to someone at the top level with regards to customer service.\n\nLooking back, I am more than disappointed in the result. I accepted the trade-in value, but was not given any explanation from a technician about this. If my phone lasted for only 2 years, than this is a faulty product, and I would not have chosen to purchase a Google Pixel 5. I had placed my trust in you guys, and you guys offered nothing.\n\nWaste of time...",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2021-02-11T18:25:23.45282+00:00",
    "reply": "0 Replies"
}