{
    "url": "https://support.google.com/pixelphone/thread/19282274/no-reply-from-customer-support-for-a-month?hl=en",
    "title": "No reply from customer support for a month",
    "content": "I have been trying to replace my under warranty Pixel 2 for over two months now with no resolution in sight.  I have received two different carrier-blocked phones, been handed off to multiple reps, promised supervisor escalation only to be handed off to a rep who can just read from a script and use the automated system, charged for both of these unusable phones despite having returned them, and most recently my chain was escalated to a \"supervisor\" on October 15th a full month ago, with no replies since then despite multiple attempts to reach out from me.  Do actual supervisors really exist?\n\n\nA fun summary:\n\n1) My original Pixel II google device began experiencing a hardware problem in September where the phone screen would go completely blank and the device would not power on, no matter what support actions were taken.  I later discovered that the screen would turn back on, only after the phone drained to 0% battery after many days.  The wifi and battery also do not function nearly as well after this began. \n\n2) Google support instructed me that I must return the phone in exchange for a refurbished Pixel II - the rep promised that refurbished Pixels are indistinguishable from new phones and I would not receive any problems.\n\n3) I used an advanced pre-authorization to pay for the phone so that I could receive it faster. However when I tried to activate the phone, my phone company informed me that the phone was carrier locked and the IMEI was invalid.\n\n4) Google informed me that this was a \"rare\" issue and they would need to send me a second refurbished phone.  I was very concerned about this solution, as I had no reason to believe this would not happen again.  I asked for an alternative option that didn't involve a refurbished phone, but the support rep told me that he could only do what the system allowed him to do, which was submit a request for a refurbished Pixel II.  Google also suggested I trade in my phone for a working one, but did not offer me any greater trade in value for my under-warranty phone, stating that again it is an automated process.\n\n5) I accepted a second refurbished phone and used advanced pre-authorization.  I attempted to activate it and once again, it is carrier locked with an invalid IMEI.\n\n6) In the meantime, I returned both of these unusable phones using the return labels provided.  Both phones made it into Google's hands ahead of the return deadline, and yet my credit card was charged hundreds of dollars for each of those phones I no longer had.  These charges were reversed but only after I contacted Google about the error.\n\n7) With all of the issues above over a month of back and forth, I asked for a Supervisor who could actually provide a solution outside of the automated system.  The google rep said they were escalating on October 15th.  Every week or so I receive a \"sorry it's taken so long\" automated email, and I've sent several emails since then asking for a status update with no reply from anyone.  It is now November 12th.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-11-11T14:14:50.688701+00:00",
    "reply": "1 Reply"
}