{
    "url": "https://support.google.com/pixelphone/thread/1450642/pixel-stuck-in-boot-loop-after-latest-android-update?hl=en",
    "title": "Pixel stuck in boot loop after latest Android update.",
    "content": "So I typically let some time pass before installing any updates so that any bugs can be fixed and applications can be updated before rolling them out on my devices.\n\nI just updated to the latest Android version on February 2nd that was available to my Pixel and within a few hours it sent my device into a boot loop while I was in a conversation with a tenant.  I was able to get into safe mode and  looked to see if I had any new apps installed that may have been the culprit to no avail.  The device still would randomly boot loop even in safe mode.  I started backing up files and folders that are not backed up with Google backup.  I was only able to complete about 50% of what I was attempting to backup and the phone entered the boot loop again.  Now I am not able to access the phone again to complete transferring the rest of my files.  \n\nI am really disappointed with Google on this one, this has happened previously with another update a few months ago but actually returned to normal operation.  It was having issues with the microphone also. Reading different forums this seems to have affected a decent amount of users.  I was a die hard Google phone fan but am actually on the verge of switching to Samsung over this.  My old Nexus's started behaving strangely and having trouble with connectivity issues etc even being on Project Fi where at the time I decided to change carriers because of locking to Sprint which had worse connectivity in my area with throttled download speeds even though Fi boasted it would choose the best carrier.  \n\nIf someone could assist with a remedy it would be greatly appreciated.  I would like to attempt to retrieve the rest of what I can. So please no canned \"wipe your phone\" as that never solves the problem for anyone ( also cannot at this time because phone will not load into recovery mode anymore).  Also from what I found if I am having issue with the microphone also it's a faulty motherboard which has been a known issue for Google.  The phone is in mint condition I have not dropped it or gotten it wet so there is no issue with mishandling.  \n\nIf Google wants to be nice and give me an amazing deal on the Pixel 3 Xl (like half off, I 'll purchase a few of them) and take this phone to troubleshoot it would be nice and would help me to regain some love for the brand again.  Otherwise if you can just help me get it out of boot loop so I can get the $360 from Samsung to trade it in for one of their devices that would be appreciated also.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-02-04T11:38:46.879605+00:00",
    "reply": "2 Recommended Answers"
}