{
    "url": "https://support.google.com/pixelphone/thread/86717632/having-trouble-activating-my-esim-on-my-google-pixel-5?hl=en",
    "title": "Having trouble activating my eSIM on my Google Pixel 5",
    "content": "I spent 3.5 hours in Verizon Chat trying to get my unlocked Pixel 5 activated on my business account with no luck.  I'm not sure I fully understand how the eSIM is supposed to work.  I know that reading about eSIM's on wikipedia it sounds like these must be provisionable by the cellular carrier remotely however the process in the phone of getting that eSIM activated implies some sort of protocol handshake initiated by my device with a QR code (visual or manual) and this tells the phone to contact my carrier and finish that handshaking process and activating the eSIM.  I don't think the verzion chat reps understand this and I think they tried to just jack the IMEI into their systems hoping it would all work.  Which brings me to the next question.  If I have a device with no physical sim card only an empty sim chip (eUICC chip is I believe what its called) then how does the phone have an IMEI in the 1st place?  When I punch in *#06# or go to settings and about phone I get an IMEI but I thought this was associated with a physical SIM card.  Anyway when they finally sent me a QR code via email I would get the following error message: \n\nSo an eSIM has a profile which I've seen multiple times in multiple posts about eSIM's or duel SIMing your phone but I can't find a place in the google pixel 5 where it shows any local profile.  I don't have a Settings -> Carrier section where a profile shows up.  The Settings -> About Phone -> SIM status section shows everything blank except the EID “Embedded Identity Document”.  I know few vendors put much in the way of effort into their error messages I know this may be a generic message which could simply mean the process failed to correctly handshake with the verizon servers and have nothing to do with an eSIM profile.  Anyway any help or suggestions about this problem would be greatly apprecated.  Thanks!",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-12-03T20:54:07.781181+00:00",
    "reply": "0 Replies"
}