{
    "url": "https://support.google.com/pixelphone/thread/3873271/pixel-won-t-charge-until-change-usb-to-be-controlled-by-this-device?hl=en",
    "title": "Pixel won't charge until change USB to be controlled by \"This device\".",
    "content": "I have been using Pixel 3XL for 3 months, but I have been struggling with charging in the last 2 weeks. I bought some wireless charging stand which only give me a slow charging, so I don't use it that much.\n\nFirstly, My Pixel won't recognize the power from the USB-C cable, then I accidentally place it on the charging stand and It magically fast charging by itself even though I put it out from the stand afterward. So, I have to use this trick every time to revoke and charge my pixel.\n\nAfter I using that trick for a week, I can't use charging stand to revoke the charging anymore. So, I have to use the slow charging stand instead. Then, I found that there's a USB Preference setting in the notification bar. After I toggled the USB Controlled by: \"Connected Device\" to \"This Device\", I can use the revoke-by-stand charging trick again. but I have to toggle that option every time I connect the cable.\n\n3 days ago, the problem is getting worse. I can't use the trick anymore. So, I have to stick with this slow charging stand. Then, I ordered USB-C to USB-A cable and another wireless charging stand. To see if the problem are due to my current cable or the outlet. Unfortunately, the new cable and stand don't charge normally. I have to toggle USB control option in the USB Preference to let the power come to my Pixel.\n\nI tried connect it to my PC with the new cable and my PC didn't recognize it, I can't even charge the Pixel with my PC properly. I need to toggle that option in the USB preference to charge my phone. And all the options in the \"Use USB For\" are grayed out.\n\nNow, I have to change that USB preference every time I connect with any cable to charge my Pixel. And, I don't know will it getting any worse. It have been auto-update to Android 9 last few weeks, I don't know if that is the reason. Please help me out.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2019-04-09T18:28:38.752502+00:00",
    "reply": "1 Recommended Answer"
}