{
    "url": "https://support.google.com/pixelphone/thread/102390169/pixel-3xl-100-to-50-in-one-hour-and-off-after-90-minutes-can-t-power-on-even-after-battery-repl?hl=en",
    "title": "Pixel 3XL 100% to 50% in one hour and off after 90 minutes - can't power on even after battery repl.",
    "content": "The first week of March, I noticed my phone was discharging a bit more rapidly than normal. Not surprising to me since it's a 3 year old phone with the original battery, so I started thinking about replacing the battery. Fast forward to 3/9, and off of a fresh charge, I mounted my phone to my bicycle and fired up the Adidas app to track my bike ride (a fairly battery intensive activity). Within an hour, the phone was 50%. After 90 minutes, I noticed the phone was completely dead. I didn't pay attention to the phone while riding. When I returned home, I plugged in the phone to charge it... no signs of life. I then plugged in the phone overnight using the original charger and cable that came with the phone. Also, no luck.\n\nOn 3/10, I took the phone UBreakifix (the nearest Google authorized repair center) figuring the replacement battery would fix the problem. Unfortunately, their replacement battery did NOT fix the issue - they were never able to get the phone to turn on again. The tech found some internal knowledge base articles which indicate a problem regarding the March Feature Update for certain Pixel phones - including the 3XL, 4, and 4XL. \n\nI have since contacted Google support directly and as a result of that discussion mailed the phone in for a repair. I am hoping they can fix what their authorized service provider couldn't, but the phone has never been damaged, and was in excellent condition prior to its final shutdown on 3/9.\n\nAlthough I don't think there's much the community here can suggest in my specific case, I am wondering if others are affected by the same issue on their phones, since, according to Ubreakifix, the issue is pretty new, and I wasn't able to find anything elsewhere in these forums.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2021-03-15T23:00:21.564297+00:00",
    "reply": "5 Replies"
}