{
    "url": "https://support.google.com/pixelphone/thread/82826540/i-would-like-to-describe-a-current-customer-service-related-issue-with-a-pixel-2xl-return?hl=en",
    "title": "I would like to describe a current customer service related issue with a Pixel 2xl return",
    "content": "I was sent a replacement phone and promptly used the return label to return my defective device. After a few days the hold for $904 was pulled from my account, I assumed this would be the end of it. However; yesterday my account was charged $904 for the Pixel 2xl which was sent to me as a replacement stating that Google had not received the old device from my end. To my surprise I checked fedex and it basically has been in transit for weeks and will get delivered next week. \nThinking that Google could remedy this by extending the deadline given how it is the middle man in this case FedEx's fault the device is not there in time and remove the $904 charge from my account. But after speaking to the representatives to literally being told that there is nothing that can be done I want to bring this out to the community that in today's competitive market this is the level of customer service which can be expected from Google. I was literally told there is nothing they could do when in reality you are charging my $904 for a phone which you would offer me $60 in trade in value. \n\nIf anyone I can speak to regarding this besides the powerless representatives please let me know and I would greatly appreciate any other suggestions. \nMy biggest concern right now is if Fedex misplaces the package, am I supposed to eat that $904 expense for no rhyme or reason? \nAlso, this is my second replacement phone since I bought the pixel 2xl, talk about durability.\n\nThank you again for any help and recommendations,\n\nHave a great weekend\n\nThe above was posted on 11/14\nToday is 11/21 and below is the only response I am able to get from Google if anyone knows how I can get this escalated so some can help me I would really appreciate it as I am pretty helpless right now.(the response is from today as well). I have called fedex and they are willing to take full responsibility for the delay but as usual Google is refusing to help the customer in this case.\n  Hi Ali,\n\nThank you for contacting Google Support!\n\nFor now, we can only wait for the package to be delivered back to our warehouse so that we can process your refund. I checked the returned tracking information and it is scheduled to be delivered on November 23. \n\nAs soon as we receive it, I'll let the Account Specialist know. \n\n--------------------------------------------------------------------------\nIf anyone has any ideas please let me know,\n\nRegards,\nAli",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-11-14T08:09:14.190306+00:00",
    "reply": "4 Replies"
}