{
    "url": "https://support.google.com/pixelphone/thread/100761384/factory-reset-with-a-broken-screen?hl=en",
    "title": "Factory reset with a broken screen",
    "content": "My google pixel 3a XL has a messed up screen. No cracks or visible damages, it just simply wont power on anymore. I know the phone is working because the scheduled alarms are still ringing on time, and the fingerprint reader vibrates slightly when I press a print on it. I purchased this on Amazon, and through them I start a return which was approved. \n\nHowever, the returned phone must be factory reset, and I have not been able to do that without a working screen. 2 hours and 43 minutes, and 7 google support reps later and I cant even get them to understand that this phone was purchased on Amazon not through Google Fi. The level of service I got for this from google was absurd and abysmal and I wouldn't wish it on my worst enemy. Downright disrespectful. I would kindly ask them no to transfer me back to google fi support and they would do it anyways. \n\nApparently the geniuses at google phone support are telling me that without a working screen, no factory reset is possible. I find this very hard to believe, since it is Google we are talking about after all. What would lead them to a design choice for a recovery feature that requires a working screen baffles, especially when many times recoveries are done due to damages (& the most common phone damage is screen related). \n\nMy dearest community. I found a google article that the geniuses manning the guns at google phone support could not be bothered to look up (even though they are literally google employees). The article states that using the Android SDK via the ADB a recovery command can be sent to the phone from a windows command prompt. The steps were hard to follow however, as it appears the article might be outdated. Can anyone enlighten me how I would go about using this method, or literally any other, to reset my pixel phone via USB instead of using the pixel screen which is not working? \n\nAlso, on a related note. Where is it most appropriate to vent my disgust with the level of support (or complete lack thereof) I received today from google?",
    "is_img": 0,
    "category": "Other, Google Pixel 3a XL",
    "post_time": "2021-03-04T17:58:30.759249+00:00",
    "reply": "3 Replies"
}