{
    "url": "https://support.google.com/pixelphone/thread/103137742/warranty-illicit-activity?hl=en",
    "title": "Warranty: Illicit activity",
    "content": "Bought the phone directly with Google Store in June 2020. \n\n3/12 \n-Camera stopped working. \n3/12 \n-Agent in chat asked me to reset to factory settings. Paula (7-0479000031400)\n3/13 \n-Chat with Avlyn (8-3852000031599) Said the RMA's on the device has been blocked due to fraudulent activity. \n3/13 \n-Agent in the phone told me there's nothing wrong with my identity or any fraudulent activity and advised me to take phone to UBreakIFix\n3/14 \n-Took the phone to UBreakIFix. They said Google denied warranty coverage.\n3/15 \n-Agent in chat (probably Raul) left the chat without my consent and refused to check the conversation history (2-4422000031418)\n3/15 \n-Talked with agent on the phone. She noticed the flag in my account and requested screenshots of my order number, serial number from the order, name in the account, email used, IMEI. All requested items were provided. She said she would escalate to the investigation specialist and created another case number (4-8969000031444)\n3/19 \n-Received official denial of warranty stating the same cookie cutter message all the agents had sent: \"As per investigation, we are unable to verify the ownership. Also warranty replacement for this device is not eligible due to previous illicit activity. If you have further question, please reach back to us.\"\n3/20 \n1) Requested a call. Got the call and waited 24 minutes to get connected.  Talked to an agent and asked to speak with Manager. Agent put me on hold and  then hung up. \nCalled again and asked to speak with Manager. Was placed on hold again and agent came back and said Manager will call within 24 hours. She opened another case (0-9234000031491)\n2) Called Sprint to see what they could do. When they asked me for the serial number, we discovered it didn't match the serial number in the Google store order. They believed my phone had been swapped by mistake at UBreakIFix when I took the phone for a battery replacement in January (under warranty). \n3) Called UBreakIFix and they confirmed the IEMI matches my phone. Nathan said that they don't keep serial numbers on file because Google processes the warranty using only the IMEI. I remembered my phone has a screen saver and that they returned my phone with the same screen saver. So they DID NOT swap my phone. \n4) Called Synchrony bank, Google's financial partner. I paid off my phone this month but wanted to make sure that the \"illicit activity\" in my Google account had nothing to do with a returned payment I had on file with Synchrony bank. They confirmed one thing has nothing to do with the other.\n\n\nNO EXPLANATION WHATSOEVER. Going back to iPhone. At least they don't treat you like shit!\n\nThis is an issue I read is constant and it sounds like BS to me, an excuse to not honor warranty. \n\nIt sounds as if Google is looking to get into another class action lawsuit like the one they just lost this past December for a very similar issue.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2021-03-20T22:20:59.574303+00:00",
    "reply": "1 Reply"
}