{
    "url": "https://support.google.com/pixelphone/thread/56827289/sent-my-phone-in-april-for-repair-i-had-a-cracked-screen-but-phone-worked-was-sending-for-there-wel?hl=en",
    "title": "Sent my phone in April for repair I had a cracked screen but phone worked. Was sending for there wel",
    "content": "Sent phone in didn't pay for repair was sent phone back and it doesn't work. Was told by u break it it's a main frame issue which my phone never had. It had a small cracked screen but worked just fine. U break told me it was prob google during inspection or when they shipped back. I finally talked to them so many times and was told send phone back in. Now I'm being told it can't be fixed. Bu a refurbished phone for 300 something dollars.     Was told today the following \"Now I understand that there is a big difference in the price to fix your device than the last time you saw which is completely relatable as I would say. What I meant is these prices are not changed intentionally. These are as per the current market value of the repair parts and the device. Also, this is an automated process and the prices are completely dependent on the type of issue as per current market value.\" What in the world has changed in two months. In April my phone could be repaired now it can't. I feel like I'm talking to a wall. The reps have no idea and notes are not kept . I have all my notes and I'll be contacting better business bureau asap if I do not get a response that makes sense. Google has an audio issue.  Unacceptable, wrong and unethical. Especially during these times google is trying to burn a customer. Your phone has an audio issues from the get go. Something google is aware of and has yet to fully resolve. Issue with the internal speaker is something google has been sued about before and will again. Based on my experience google is doing other shady stuff. I have notes of all my conversations with agents that have no clue what I'm talking about. I had an agent today after explaining the issue told me let's trouble shoot. Hello!?!!! Google has my phone how can we trouble shoot.\n\nI need this resolved   I'll pay the original quoted price not this scam google is doing to me.",
    "is_img": 1,
    "category": "Device Performance",
    "post_time": "2020-07-03T02:52:53.859913+00:00",
    "reply": "0 Replies"
}