{
    "url": "https://support.google.com/pixelphone/thread/58645974/i-am-not-able-to-set-up-or-use-my-google-pixel-3-xl-whatsoever?hl=en",
    "title": "I am not able to set up or use my Google Pixel 3 XL whatsoever.",
    "content": "I recently purchased a Google Pixel 3 XL phone as I needed a newer version of the Android operating system to use the applications required for my job. I was astonished when I realized that I was not even capable of setting up the device. I feel the need to mention that I am not able to use cellular data on this device as it does not have a SIM card in it (I primarily use WI-FI as a substitute for cellular data). I was able to skip the activation portion of the phone's set-up sequence, however, as I was configuring the phone, a message popped up saying that bluetooth was not functioning properly. I ignore it, and moved on to the next step. It asked me for a WI-FI network because I could not use cellular data, but none of them were appearing. It's telling me that there are no WI-FI hotspots in my location, and that both my IP address as well as my MAC address are unavailable. I hope you see my predicament here. I can't use cellular data because I have no service or SIM card & I can't use WI-FI because no networks are appearing. I was told that this was due to my router being misconfigured, but that's literally impossible considering I have 12 other devices that are running perfectly & are connected to it as we speak. It also doesn't make sense that it wouldn't show any of my neighbors' networks if it was truly just mine that was affected. I have spent hours on the community forums & help guides written by Google to no avail. I have tried going into \"safe mode,\" I have tried wiping all data from the device & factory resetting it, and nothing works. I even had an actual Google customer service employee try to tell me that I needed to update my device's operating system... Let me ask you this, genius, how can you expect me to update my device using WI-FI when the whole reason I contacted you was because I couldn't connect to it on said device in the first place? It seems to me that the combination of narcissistic deception & a general lack of common sense has plagued customer support. To make matters worse, I have found dozens of people complaining about issues very similar to mine, yet they have not received any assistance in over a year. PLEASE HELP ME RESOLVE THIS ISSUE!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2020-07-13T08:06:07.50485+00:00",
    "reply": "2 Replies"
}