{
    "url": "https://support.google.com/pixelphone/thread/70863623/pixel-3-android-11-why-are-there-so-many-issues?hl=en",
    "title": "Pixel 3, Android 11, why are there so many issues?",
    "content": "Upgraded to Android 11 5 days ago. What can I say ... In short: I'm baffled.\nThe cosmetic update of the UI is a step back, or even more precisely,  a step in some weird direction, here's why:\nThe players were made a part of the quick settings curtain - a good idea, but only they are buggy, disappearing randomly or become irremovable until the reboot, and the track switching buttons do not respond to taps.\nMoving on - lock screen notifications. To open preview, a gesture from the notification down is required, but now for some unknown reason now you need to pull much further down, otherwise it will not open. Super unhandy. It was just right on Android 10, but now, well, I'm feeling like an idiot, swiping down more than three times before getting the result.\nNext up - screenshots. The bloody thing was moved to the recents, and it is IMPOSSIBLE to take a screenshot of the desktop anymore. The smoothness of the animation of removing windows from recent ones is finicky, windows are jerking without animation.\nIn the same quick settings curtain there are only 2 rows possible now. For the third row, swipe to the side is required. This poor choice is done in favor of players, only wait for it... there is enough room for the third row and a player ... Mindnumbing.\nGoogle assistant app. With Android 10, I had the option to give location permission only while using the app, but now the choice is only between all the time or never. What the hell is that, huh?\nAnd yes, the battery is trashed again. Although it is too early to draw conclusions on this, because Android 10 battery was also trash in the beginning, but somehow they polished it towards the end so that I could get through a day decently. Fingers crossed here too.\nI had my doubts to update or not. Too late now.\nIf you are thinking of updating or not, you better wait!",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2020-09-13T11:27:34.607204+00:00",
    "reply": "20 Replies"
}