{
    "url": "https://support.google.com/pixelphone/thread/81619167/piss-poor-experiences-all-around?hl=en",
    "title": "Piss poor experiences all around.",
    "content": "I have had google products since prior to nexus series by way of HTC's initial thunderbolt android, quickly switching to the nexus line, being a pure google user since then. I've owned every nexus, a d all pixel products bar the 4, as I skipped due to cost. I just purchased the 5 and the buds. The buds barely worked, would disconnect, cause issues, one ear would drop, battery would die on one ear only. Genuinely a poor experience. What made it worse was customer service being incapable of offering support within a reasonable amount of time, emailing me once every 36-48 hours asking the same question each time instead of acknowledging the issue, nor closing the matter when I returned the device due to their nonsense customer service. Emailing me over and over again asking what can be done and if the return needed to be processed... Because: why hire competent employees, right? \n\nI cancelled the 5 on account of the 700 dollar price point for the 200 dollar device, and the genuinely terrible experience I had. I was willing to pay the asking price for the software updates, and what not. Now I sit here with my barely functional, post OS update 3XL (never saw the slow down or feature bugs coming with that one) and my barely functional Pixel book. The pixel book, which is supposed to load very quickly, takes its time loading... But even worse needs to be plugged in for 15-30 minutes (very unpredictable) in order for it to just power on, and even then... Power button doesn't work... I need to close the lid and open it repeatedly until the screen turns on... I've stumbled to the forums here time and time again for support because google is happy to take my money, but not offer any quality of service, and I'm stuck reverting to fellow users of their products to troubleshoot... I am thinking of clamshelling for the mobile, or just biting the bullet and switching to an iPhone/apple ecosystem, as my experience with apple has been a solid 20/10 compared to this disaster of an experience with google. \n\nAny advice on what I should do? I've been on the google platform for nearly 20 years (not just their mobile OS) and I am desperately looking for something that isn't going to be a repeat of this garbage pile I've found myself caught up in. \n\nPS, \n\nI feel like I'm divorcing an abusive S/O, it's actually kinda disgusting. \n\nAppreciate any feedback or support anyone can offer, recommendations on new products or services I can leverage as opposed to the google suite of products as, Sadly, I'm confident I'll never be returning... \n\nCiao, and thank you.",
    "is_img": 0,
    "category": "Other",
    "post_time": "2020-11-08T01:37:02.183815+00:00",
    "reply": "2 Replies"
}