{
    "url": "https://support.google.com/pixelphone/thread/73112838/does-live-caption-on-4a-during-phone-calls-needs-android-11-not-10-as-shipped?hl=en",
    "title": "Does Live Caption on 4a during phone CALLs needs Android 11 ? (Not 10 as shipped)?",
    "content": "I just unboxed an unlocked 4a (from BBuy) for my almost deaf mother just for the ability for her to use Live Caption during a phone call.\n\nBut the caption never shows up during a phone call.  I have it enabled and I see the Live Caption on/off selection (below the volume up/down slider when volume buttons are pressed).  Note that it works for other video content but not on phone calls.  I am not using a headphone or bluetooth speaker just plain handheld phone call not on speaker (think: deaf person!).\n\nLong story short, I received the phone on 9/24/20 and followed all the steps to insert SIM, connect to WiFi, copy content from my old phone via cable, let it update all my apps, etc.  \nIt is running Android 10.   \n\nSo I just wondered if this possibly needed Android 11 to work, and since my phone said an update was available... I updated 11 and NOW IT WORKS!  \n\nIs Android 11 stable?  If so why didn't Google release the 4a with it on it?\nThis phone will be sent to my 92 year old mother with no tech support and no T-Mobile store even if she had one nearby.  She needs a reliable phone so should I wait and not buy it yet?\n\nNOTE added: After I wrote this I have learned that Google only released Android 11 on Pixel a couple of weeks ago... so these phones have probably been in the supplier pipeline so still have 10 on them. \n\nThanks!\n\n-------------\nDETAILS below:\nMy clue was that the last settings option listed here did not appear on my phone:\n https://support.google.com/accessibility/android/answer/9350862?hl=en&ref_topic=9078842\n\nChange Live Caption settings\nOpen your device's Settings app .\nTap Sound  Live Caption.\nUnder Settings, view or change these settings: \nTurn Live Caption on or off.\nHide or show profanity.\nHide or show sound labels, such as laughter and applause.\nHide or show the Live Caption icon in volume control.\nTurn call captioning on or off (Pixel phones only).   <<<<<<<<<< Not shown\nSo now with Android 11 my phone has a last item:\nCaption calls\n - with 3 options: Ask every time, Always, or Off.\n\n=======\nThis will be a godsend to the deaf community especially the stay at home now!!!",
    "is_img": 1,
    "category": "Contacts, Calls, Voicemail, Google Pixel 4a",
    "post_time": "2020-09-25T01:16:26.01713+00:00",
    "reply": "1 Recommended Answer"
}