{
    "url": "https://support.google.com/pixelphone/thread/7822972/anyone-else-having-issues-connecting-to-lte-and-receiving-mms-messages-with-pixel-3-on-att?hl=en",
    "title": "Anyone else having issues connecting to LTE and receiving MMS messages with Pixel 3 on ATT?",
    "content": "I've had a Pixel 3 on ATT essentially since launch. Everything was working find till about 1 month ago when I started having issues connecting to LTE and receiving MMS messages. \n\nFor the LTE connection, this issue is in initial connection eg after turning off WiFi, or leaving wifi range, or leaving a dead zone (underground garage) the phone has difficulty connecting and shows \"No internet\". Sometimes it reconnects in a few minutes but sometimes it takes 30+ minutes. I havent found any solutions to get it to reconnect quickly: not toggling airplane mode or mobile data on and off, not restarting, not resetting network connections...nothing.\nOnce the phone eventually connects to LTE the data connection works fine and stays stably connected until I either go into a dead zone (eg underground parking lot) or connect to WiFi -- so the trouble really just seems to be with the initial connection.  Also, when the LTE isn't connecting i can still make and receive phone calls without any difficulty.\n\nFor MMS messages, I apparently have been missing missing a bunch of messages and even when i get them they are extremely delayed.  This issue started at the exact same time as the LTE issue, but seems to be independent of the LTE status--it happens whether or not the LTE is connected.  I seem to be able to send MMS messages without issues and send and receive SMS issues without any issues.\n\nBoth of these issues started at the same time. I live in a large urban area with good ATT signal. My wife does not have any of these issues in the same areas on her iPhone. I have found posts on Reddit and the ATT community forums where people describe similar issues. \n\nUnfortunately, both AT&T and Google support have been of little help.\n\nGoogle support asked me to:\n--Install the latest system updates (I was already updated to May and since the problem has been going on for so long I have subsequently installed the June security update)\n--Reset network settings\n--Uninstall updates to a variety of system apps including google connectivity services, pixel launcher, pixel ambient services (I don't remember the complete list anymore but I followed their instructions precisely)\n--Check APN setting with my carrier (were already consistent with recommended settings).\n\nAT&T support:\n--Checked that my IMEI number matched (it already did)\n--Manually re-provisioned my IMEI (I think multiple times now)\n--Re-verified my APN settings again\n--Some AT&T support agents have suggested replacing my SIM while others say this would not help (I haven't done this yet but supposedly they are shipping me a replacement SIM -- but I really don't see how this could be the issue)\n\nBased on Reddit/AT&T community forum posts i have also tried:\n--Disabling developer options\n--Disabling enhanced 4G LTE mode\n--Switching between 3G and LTE (as the preferred network type)\n\nI think at the heart of it neither AT&T nor Google will truly acknowledge this issue -- they both act like I am the only one having this problem even when I point them to the articles, reddit posts and ATT posts. This is extremely disappointing when they have both advertised compatibility between the Pixel 3 and the ATT network.\n\nGoogle has now offered to replace my device under warranty, but of course they only offer a refurbished replacement and its not even clear to me if its a hardware issue -- some people seem to report ongoing issues even after getting replacements.  Has anyone else here experienced the issues that I'm having?  If so, did a replacement solve the issue?  Maybe if enough people report this problem on the google boards we can draw their attention to the issue and get some response (when i point to reddit they say they are not \"able to comment on the content and issues specified on the third party websites\").",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2019-06-11T12:20:04.612176+00:00",
    "reply": "3 Replies"
}