{
    "url": "https://support.google.com/pixelphone/thread/13047613/severe-microphone-issues-on-pixel-xl?hl=en",
    "title": "Severe microphone issues on Pixel XL",
    "content": "Dear All\nI'm trying to get someone's support from Google directly. It is impossible to get in contact with a support from Google as I cannot contact the support from phone directly and after trying 100 times via internet, it always redirect em to some information which is really basics. \nBy the end of 2016 I bought the first Google Pixel XL for USD 1026 in the UK, after having all Nexus devices before. I'm a long standing Android and Google fan since the first Android phone and Nexus.\nAfter 1 1/2 years I got difficulties with Pixel XL. I could hear the other party on the phone, but they could not hear me. It took me almost 6 month finding out what exactly the problem is. After that I read in the internet/newspaper that a large number of owners are affected. Google Pixel XL has sever microphone issue which cannot be fixed via a software update. The device has a hardware problem, the motherboard has be replaced. Google confirmed the problem officially.\nNow I sent my device to teh Repair Center in Germany to be checked and I receive an offer to have the motherboard replaced for USD 381, so In total I would paid USD 1407 for this device. This reply was absolutely disapointing from Google.\n\nThis absolutely not acceptable from a customer view. I was not able to find out the root cause within the 2 years guarantee time. I could not use the phoen even for the first 2 years! Google did not infomed me that my device is impacted.  I do not want to pay for any problems not caused by myself, but solely caused by Google. \n\nI would appreciate your asstance . I would like to get a working phone as soon as possbile. Germany Repair center do not want to help me. They say, I need to adress my issues to Google. They are forwarding me to the internet and there I cannot reach out to Google. There is a class action where the users could file a claim against Google, unfortunately only in the US. \n\nThank you in advance and kind regards,\nV",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel",
    "post_time": "2019-08-28T18:35:23.549597+00:00",
    "reply": "2 Replies"
}