{
    "url": "https://support.google.com/pixelphone/thread/76876199/pixel-3a-won-t-charge?hl=en",
    "title": "Pixel 3A won't charge",
    "content": "Since a few days my Pixel 3A won't charge properly. Details:\n\nIt will only charge once every so many tries;\nIt will only charge through USB-C to USB-A via my laptop (not through any other cables, including the one provided when I bought the phone and not through any other outlets);\nIt will only charge when turned off;\nIt charges extremely slow (more than 1 hour per 1%);\nIt will randomly turn on when charging;\nIt will randomly shut down while still having some power;\nThe power usage is very high (loses about 20% per hour without using it);\n\nThings I have tried:\nCleaning the USB-C connector on my phone and all cables;\nDifferent cables, different outlets;\nCharging while on/off;\nSoft reset;\nPutting it back to factory settings;\nConnect to Update and Software Repair by Google in repair mode, however my phone cannot connect as that is where the problem seems to be.\n\nI live in The Netherlands and ordered it from France on the 22nd of June this year. I cannot find any repair options on the website. When I click any link it will automatically send me back to the Google store homepage. The chat option on the website also doesn't work. I have found similar problems on this forum but without any real solutions. The problems seem to disappear automatically or the question is just left open. \n\nI think it could be software related and might have something to do with an update, but I am unsure. I am at a loss for what to do and could really use some help. The phone is only a few months old and I really don't have any money for a new one. If warranty is an option and someone has info on that, that would be greatly appreciated as well, I cannot find any info on where to send my phone for warranty or repair.\n\nThank you so much in advance!",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3a",
    "post_time": "2020-10-14T11:29:17.358357+00:00",
    "reply": "0 Replies"
}