{
    "url": "https://support.google.com/pixelphone/thread/76780691/bubbles-has-completely-ruined-my-android-experience-here-s-why?hl=en",
    "title": "Bubbles has completely ruined my Android experience. Here's why",
    "content": "In one swift update, bubbles has completely ruined my Android experience.\nI can't believe how badly this feature has been designed and implemented. As someone whose primary use of my phone is messaging people on Facebook Messenger and using chat heads, this update has just destroyed the awesome Android experience I've had for several years and made it feel as reductive as an iOS (maybe even moreso since I know what I'm missing now)\nBubbles are HORRIBLE compared to what Messenger chat heads used to be. Here's why:\n\n- There's so much wasted screen real estate taken up with that Manage button at the bottom, which in turn throws off our natural instinct to hit the typing bar at the bottom but instead you're forced to have to readjust higher\n\n- I can't click on the grey messenger chat head icon that used to be in the top left to go back to main messages WITHIN the chat head window anymore. Hitting the new blue Messenger icon takes you into the full app which is annoying if you're trying to send messages to several different people or check the main message feed BUT still want to stay within the other app you're already in (and that the bubble is overlaying). This is the whole point of chat heads/bubbles - to be able to properly multitask a full app while remaining in another one.\n\n- Hitting the + button has so far proved to be useless as I never dismiss bubbles. I would've instinctively thought that hitting the plus button would allow me to search for someone to message (as it does in chat heads) but no, it only allows you to open a specifically dismissed one. And even if I dismissed every bubble it's still quite useless since they're not ordered in any logical way on this + screen. The + button is ultimately a waste of space but if it WERE to be used for something, it should allow you to search for a new person to message within the bubble\n\n- Notification dot on bubbles don't go away when opening Messenger separately and checking it there\n\n- Speaking of notifications, there is no bright red notification / number of messages waiting on a bubble when it is minimised - just a faint blue circle (that does not stand out) and does not tell me how many messages I have waiting in that conversation. Extremely frustrating when someone has messaged you once, you haven't responded, then looked away for a while and then have messaged you again a couple more times. No way of telling how many messages they've sent you without opening the conversation up\n\n- In group conversations, bubbles only shows you two of the people in the group, not three as Messenger did\n\n- Basically no indication of which bubble I'm currently on besides that miniscule dark grey arrow (that blends in with anything in the background, especially dark mode apps)\n\n- The animation of opening and closing bubbles is too long and slow compared to chat heads\n\n- Can't rearrange bubbles\n\nThese are just a few issues off the top of my head. I'm sure there are many more.\n\nWith such a badly designed 'feature' that has clearly not been thought out, my request is not that you try and fix it, since that would basically be like starting from scratch, but I ask that you simply LET US USE CHAT HEADS AGAIN WITHIN MESSENGER\n\nLeave bubbles as a feature if people want to use it but allow Facebook Messenger to give you two options: bubbles or chat heads (since I'm pretty sure it's Android who had forced Messenger to implement bubbles and remove chat heads altogether). This is an extremely simple request and I hope I helped you understand why this is such an important thing to be reenabled.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-10-13T22:29:08.837553+00:00",
    "reply": "11 Replies"
}