{
    "url": "https://support.google.com/pixelphone/thread/53090180/why-is-google-one-always-doing-a-backup-that-never-completes?hl=en",
    "title": "Why is Google One always doing a backup that never completes?",
    "content": "I have a Pixel 4 XL that's running Android 10 with the latest updates and security patches.\n\nI have a problem with the Google One app that I've been unable to resolve. I have a subscription for additional storage on Google Drive and manage it via Google One. The problem is that the Google One app is ALWAYS saying \"backing up now\", when I know that it isn't. I've uninstalled and reinstalled Google One, cleared the app storage and cache, rebooted, removed my Google account from the phone, etc, but nothing makes any difference.\n\nAs is the case with many other users of Android 10, Google backup doesn't work at all unless security (in my case PIN and face recognition) are disabled. Under normal circumstances accessing Backup via Settings / Google Services and Preferences / Backup brings up the backup screen on which the 'Backup Now\" button is greyed-out and the status is \"waiting to backup...\" Temporarily disabling security allows the backup to immediately proceed. However, irrespective of whether security is in place or not, Google One always says that it's backing-up. The \"device data\" category states the correct elapsed time since the last successful backup, \"multimedia messages\" says \"on\", and \"photos and videos\" says \"just now\".\n\nI love the Pixel 4, but I find the ever-growing number of Google apps utterly confusing. Backups can be managed via Settings / Google Services and Preferences / Backup, so why is there any need to show a slightly different backup interface via Google One. Why, also, is there a need to make Google One a separate application when it's there purely to manage subscriptions for additional Google Drive storage? Why not have that functionality within Google Drive itself? Given that the decision was made to build  the Google One features into a separate app, why at least not share the \"Backups\" user interface with the one available in Settings. As it is, the two purport to do the same thing, but there are differences in the user interface that just serve to confuse.\n\nIs Google One broken?",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2020-06-12T20:16:19.906118+00:00",
    "reply": "1 Reply"
}