{
    "url": "https://support.google.com/pixelphone/thread/16871915/the-pixel-family-is-excited-to-welcome-its-newest-member-pixel-4?hl=en",
    "title": "The Pixel Family is excited to welcome its newest member, Pixel 4!",
    "content": "Google’s newest phone, Pixel 4 is designed to help you! From incredible photo features that allow you to capture your surroundings, day or night, to Motion Sense, we’re excited to share a phone that works to make your life easier.\n\n\n\nWe love that camera and it just keeps getting better\nWe’re excited to share some of the new camera features, including a second lens on the back of the phone. This lens combines with the Super Res Zoom technology to produce exceptional quality near or far. Additionally, last year Night Sight opened the door to quality photos at night, now we’re taking it even further and capturing the whole night sky with astrophotography.*\n\n\n\n\nA new Google Assistant\nIntegrated across many more apps on the Pixel 4, the Google Assistant can now search within apps, and contextually respond.Try asking the Assistant “Show me photos from Colorado” and then say “the ones from Estes Park.”**\n\nMotion Sense\nPixel 4 is equipped with a miniature radar sensor to allow you to control and interact with it. Quick Gestures allow you to effortlessly silence alarms or unwanted calls. When that song you dislike pops on your music player, but your hands are busy baking, you can simply wave to the next song.*** \n\nSafety\nIf Pixel 4 detects you’ve been in a car accident it will automatically call 911. Car crash detection will be available in the US through the new Personal Safety app.****\n\n\nPixel 4 FAQs\n  Country availability\nThe Pixel 4 and Pixel 4 XL will be available in the  US, Canada, the UK, Ireland, Australia, France, Germany, Italy, Spain, Singapore, Taiwan and Japan. To see a full list of countries where the Pixel 4 and Pixel 4 XL are sold, please see our country availability page : https://goo.gl/Qf2cBQ\n What are the color options?\nPixel 4 comes in three colors, including Clearly White, Just Black, and a limited edition, Oh so Orange. Some retailers may not stock all colors. For a specific color, try the Google Store: https://goo.gl/tKECGs  \n How much does it cost?\nAll details on pricing in selected markets can be found at the Google Store.\n Will this work in my country on my carrier?\nWe recommend you check with your carrier to ask if it works with their network. Devices bought on the Google Store will be unlocked.\n What are some of the hardware details?\nYou can find all of the Pixel tech specs here: https://madeby.google.com/phone/specs/\n What software will come shipped on the device?\nPixel 4 and 4 XL will come with the latest Android Operating System, Android 10.\n   *See g.co/pixel/astrophotography to learn more about Astrophotography on Pixel 4\n **US only. English only. See g.co/assistant/languages for updates to language availability.\n ***Coming soon to Japan. Motion Sense functional in the US, Canada, Singapore, Australia, Taiwan, and most European countries. Not all phone features are controlled by Motion Sense. For more information see g.co/pixel/motionsense\n ****US only. English only. Car Crash Detection may not detect all accidents. High-impact activities may trigger calls to emergency services. This feature is dependent upon network connectivity and other factors and may not be reliable for emergency communications or available in all areas. For more information see g.co/pixel/carcrashdetection",
    "is_img": 1,
    "category": "Other, Google Pixel 4",
    "post_time": "2019-10-15T15:34:59.547767+00:00",
    "reply": "0 Replies"
}