{
    "url": "https://support.google.com/pixelphone/thread/90918720/several-issues-after-transferring-data-from-iphone?hl=en",
    "title": "Several issues after transferring data from iPhone",
    "content": "I just switched to Android after being an iPhone user for more than a decade. I love the Pixel 4a 5g so far, but there are quite a few issues from the initial iPhone transfer that I can't figure out.\n\nThe \"Notes\" that have transferred to Google Keep are completely out of order, and many notes are bugged or partially missing. Some lists have weird spacing and missing lines, and some notes just have the first line as a title and none of the rest of the content. Because of the missing info, it's also not very searchable, so I basically have no way to find notes between the lack of order and that (and I have hundreds of notes).\nSimilarly, the iMessages that transferred over seem to be in the texting app fine, but it's also not searchable. I can search for normal SMS texts fine, but no former iMessages show up in searches. I've also noticed a couple times where messages disappear, or numbers are no longer associated with contacts.\nAll of my iPhone voice memos don't seem to be in the voice memo app on the Pixel. I'm not sure where in the filesystem they would have ended up. (I have hundreds of voice memos too, so it would be nice to have them all in there)\nMy music appears to be on the phone, but no music app seems to be able to access them. The most I've gotten to work is Musicolet can play maybe 1 out of every 5 songs, but the rest just have a loud click at the beginning of playback and are silent for the rest of it. Sometimes it even plays one song but displays a completely different song.\n\nAny advice on how to fix any of this would be much appreciated.\n\nI also have a bunch of less important general Pixel/Android questions since I'm still new to all of this:\nIs there a way to set up vibration patterns for notifications (or adjust the strength somehow)? I tend not to notice when it vibrates, so it would be very helpful to make it an obvious, hard-to-miss pattern.\nSome push notifications seem to take a while to come through. I still have my old iPhone, and Discord for example comes instantaneously on the iPhone but takes up to a few minutes on the Pixel. Any way I can force sync more often or something?\nIs there a faster way to organize apps on the home screen pages than dragging and dropping one at a time?\nIs there a gesture like the iPhone has to scroll to the top of any given page? iPhones have the \"tap top of screen\" thing and something like that would be nice to have\nMy face frequently touches buttons when I'm on phone calls, and I guess the gyroscope isn't sensing that I have it against my ear. Is there a way to have the screen turn off during calls or something?\nThe volume up and down buttons don't seem to allow holding the buttons when headphones are plugged in, so I have to press it a bunch of times to turn the volume all the way down or up. Is there a way to fix that?\nSome apps seem to be unoptimised because the front camera cutout sometimes falls right on a button I need to press. Is there a way to adjust the screen to get it all to fit below the camera or something?\n\nIt may have been better to separate these questions into individual posts, but I hope this is okay. Thanks so much for your help.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a (5G)",
    "post_time": "2020-12-29T00:15:03.934252+00:00",
    "reply": "0 Replies"
}