{
    "url": "https://support.google.com/pixelphone/thread/77698413/data-corrupted-on-pixel-3-unfortunately-ota-image-didn-t-work-how-can-i-save-my-local-data?hl=en",
    "title": "Data Corrupted on Pixel 3 & unfortunately OTA image didn't work. How can I save my local data?",
    "content": "Hello, \n\nLast night my Pixel 3 went into an infinite boot cycle out of nowhere.\n\nUpon a few boots, the screen landed onto the one attached where the 'Try Again' flow didn't do anything and I would not like to do the factory reset as that would wipe all of my user data.\n\n[ What I have tried so far ]\n- Entered fastboot/bootloader to access the 'Recovery Mode' and tried pushing the most recent OTA image\n\nUnfortunately, upon doing a reboot after sideloading the OTA image, the infinite boot cycle continued which leaves me only the option of trying to use the factory image onto my device so that I can reset my OS only, without deleting any user data. However, if I do want to this, do I have to have my device in the unlocked state?\n\n[ What I am hoping to atleast be able to save ]\n- Prior to me performing a dangerous step such as a factory image flashing, is there any way for me to use adb to backup some local data from my phone to my laptop?\n-- So far adb only detects my device when I am in Recovery Mode and choose the option to 'Apply update from ADB'\n- I am looking to save specifically text messages and content from the 'files' application from my phone as I feel that most other data (photos and third party apps + individual app data) is all retrievable for me, as it was regularly being synced in with my google drive.\n\n[ Blocker ]\n- One last blocker that I have is that I cannot remember the email id that I had signed into my pixel phone with as I had generated a new google id to take advantage of the unlimited drive space made available for my pixel device and wanted all my content from my phone to be in one spot.\n-- Is there a way for me to retrieve my pixel's google id via some device serial or a unique id that I could fetch from the fastboot screen?\n\nFinally, thank you for going through this detailed post about my situation; it has been frustrating and I am hoping that I can atleast retrieve all my text messages. In the worst case if I do have to perform a factory reset, is there any way to retrieve my text messages without having to use a third party tool to do so?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2020-10-18T15:23:34.87228+00:00",
    "reply": "3 Replies"
}