{
    "url": "https://support.google.com/pixelphone/thread/6838668/why-does-new-pixel-3-battery-drain-in-doze-4x-to-8x-faster-than-original-pixel-xl-is-it-google-fi?hl=en",
    "title": "Why does new Pixel 3 battery drain in doze 4x to 8x faster than Original Pixel XL? Is it Google Fi?",
    "content": "Hello guys! Excuse the long post, but I wanted to be very detailed. AccuBattery and GSAM screenshots here: https://imgur.com/a/a7pJkgI\n\nI had an original Pixel XL for about a year and a half, battery life was great. When the screen was off, generally, AccuBattery would show I was only using about .5%, and my battery stats in the settings menu would show a nearly flat battery usage line. \n\nI upgraded to a Pixel 3 (non-XL), installed the same (and even less) apps, and my battery drain on average is over 2% an hour with screen off, sometimes all the way up to 5%. If I leave my phone off-charge overnight, I'll loose about 12-15% (compared to 5% max with my Pixel XL). Every time I check my battery stats in the settings menu, there's a noticeable down angle to the battery line, there's no nearly flat lines like with my old Pixel XL.\n\nI have tried disabling Digital Wellbeing because I had seen some other people have issues with it, but that did not help. Most of my apps are \"Optimized\" for battery usage, except my messaging / mail apps, just like on my original Pixel XL.\n\nI understand that the battery on my new Pixel 3 is smaller than my original Pixel XL, but I figured that the smaller / lower resolution screen and newer / more efficient chipset would at least make up for that.\n\nThe one difference between my Pixel XL and Pixel 3 is Google Fi. I was on T-Mobile on the Pixel XL, and I went to Google Fi when I upgraded to the Pixel 3. In some of the battery usage screenshots, you can see that \"carrier services\" is usually high on the list for battery usage. I never remember seeing this on my Pixel XL.\n\nThe screenshots were after a full night of the phone being unplugged. The average screen off usage is relatively low at 1.7%, during the day it is usually 2-4%. Also, I just installed an app a couple of days ago called Cut It (super addicting), so just ignore that in the battery usage stats :) I promise by battery was draining just as fast before it was installed.\n\nDoes anyone have any ideas?",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3",
    "post_time": "2019-05-26T16:32:43.499642+00:00",
    "reply": "5 Replies"
}