{
    "url": "https://support.google.com/pixelphone/thread/18470409/pixel-3-xl-just-black-escalation-of-case-and-prompt-resolution-please?hl=en",
    "title": "Pixel 3 XL Just Black - Escalation of Case and Prompt Resolution, Please!",
    "content": "My Pixel 3 XL (refurb replacement sent late August 2019) has been suffering from random reboots, which happen both randomly and when I try to update apps.  I have tried factory resetting, as well as installing the latest Android factory image; did not resolve problem.  The phone is unusable, and has been unusable since it started randomly rebooting in mid-September.\n\nI opened up my first Google support case with Jennie on September 17.  Jennie did not help me, asked me if I wanted my case escalated (without first informing me that escalations could not be resolved in real time), and then when she informed me of that fact after she had escalated the case and I asked her to de-escalate the case so that I could get resolution in real time, she told me that she could not do so and promptly ended the chat.  Despite multiple emails by me reporting the issue as well as either a fault with Google policies (if Jennie was acting in accordance with them) or with Jennie's customer service, I just received a further email this am informing me that some other specialist with handling the case and that I should be \"patient\"; I am pretty sure that not being able to use my phone for 6 weeks constitutes \"patien[ce]\", but maybe Google has different expectations of its customers?  That case number is 4-9120000027700.\n\nImmediately after Jennie ended the chat on September 17, I started a second chat case.  That one made more progress, and, even though it ended with escalation (again, no real time resolution - Google has to fix its internal policies that keep real time resolution from happening), the person handling the escalation informed me in early October that I would be receiving a replacement phone after I gave her my shipping address (which I promptly did).  Despite multiple follow-up emails by me, no further email from that person, still no shipped replacement phone, and still unusable phone.  That case number is 8-6866000027875.\n\nI have tried calling multiple times, but each time the rep has told me that their hands were tied because the case had been escalated, and that I should be \"patient\".\n\nWith my most recent call, I requested that, because I had lost 6 weeks of time being able to use a phone which I had purchased (together with insurance) from Google, Google should do the right thing and send me a new phone replacement.  I am pretty sure that I am not entitled to that, but I do believe that I should receive some form of compensation for the lost use of my phone during these last 6 weeks while Google support has been doing nothing,  Again, the escalation rep denied my request, and when I followed up with an email asking the escalation rep to at least expedite shipment of my requested and approved (see case no. 8-6866000027875) refurb replacement, I was greeted by what I have become used to with Google support:  silence.  That case number is 4-3760000028438.\n\nI have been a very good Google customer (purchasing first the Nexus phones (from Nexus 4 on), then all 3 prior iterations of the Pixel phone) but, given my recent support experiences (as outlined above), I am seriously considering jumping ship.\n\nRegardless of whether I do jump ship, I do feel that I am entitled to a prompt replacement of my defective refurb phone (in view of both the 1 year warranty and my purchase of Total Protection at time of purchase of my Pixel 3XL), and I do not feel like Google has held up its end of the bargain.\n\nRight now, I feel like Google support has robbed me of 6 weeks of use of a working phone because of the delays caused by Google support in honoring my warranty issue/claim.  \n\nWhat is the phone number that I can call to get real time resolution, preferably with a person having authority to resolve issues in real time, regarding replacement of my defective refurbished Pixel 3 XL Just Black?",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-11-03T19:45:56.439243+00:00",
    "reply": "1 Reply"
}