{
    "url": "https://support.google.com/pixelphone/thread/18212369/i-d-like-to-thank-google-for-making-call-screen-available-to-canadian-customers-some-minor-issues?hl=en",
    "title": "I'd like to thank Google for making Call Screen available to Canadian customers. Some minor issues",
    "content": "Is the feature available on the Pixel 4?  Nice job on Visual Voicemail also.  It should respond with the party you are trying to reach and not the word THEY when I press the \"I'll call you back later\" button.  It also seems to be missing the canned response 'take me off your calling list' and 'is this urgent?'. Is it possible for users to respond with a dynamic custom response?  That would be a nice future enhancement.  Can call screen automatically take the call if inbound caller identification is absent and ask the calling party to identify themselves verbally?  This could apply in the absence of calling name delivery if the calling party's nyx-nnx-xxxx (now npa-nxx-xxxx) is not in the contact list of the recipient or the name was not transmitted by the telco, or was not retrievable through a tcap dip.  I have received spoofed calls using illegal numbers and this can be baked into the logic ... for example ... no area code can have a 9 as a middle digit; no area code can start with a 1 or 0; if an area code has a 1 in the middle digit (n1x) the third digit (x) cannot be a 1; no central office code (the 4th 5th and 6th digit) can be 1xx or x11 or 0xx.  And you will not see telephone numbers such as 416-416-xxxx (were the area code and central office code are identical), or in NYC for example you would never see 212-718-xxxx because 212 is the area code for Manhattan and 718 is the area code for Brooklyn.  n=2-9 x=0-9.  Hope this info helps.  I don't know if ANI delivery still exists but it can be a way of determining if the call is spoofed, but the logic there is kind of fuzzy.  Automatic Nmber Identification and Caller Identification are two different things. ANI is the billing caller ID ... for example a company's ANI and main switchboard number could be (416) UNiversity 2 - 2000 (416-862-2000) but for direct inward dial the PBX would be programmed to transmit 416-862-2134 so that dialable directory number delivery and reverse translation would work.  Note that the first six digits in most cases will be identical.  The cellular industry, and regulatory authorities CRTC and FCC have certainly done a fine job messing up everything that was previously sophisticated ... from a telecommunications standpoint.  There's no way for Google to send a call to the bit bucket unless its servers act as a proxy.  It would also be interesting if the Google phone app could be enhanced to recognize alphabetic mnemonics as they previously existed eons ago.\n\nie  1 800 GOF EDEX\n1 800 FLO WERS\n1 415 PIX EL3A (749-3532)",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3 XL",
    "post_time": "2019-10-31T18:11:19.412285+00:00",
    "reply": "1 Recommended Answer"
}