{
    "url": "https://support.google.com/pixelphone/thread/61975254/pixel-3a-won-t-charge-unless-it-is-powered-off?hl=en",
    "title": "Pixel 3a won't charge unless it is powered off",
    "content": "-The phone is a replacement for her original Pixel 3a that started shutting down constantly. We've had this phone for 2 weeks. \n\n-On 7/29/20 the phone stopped charging when plugged into the Pixel USB C charger that came with the original pixel 3a phone. \n\nHere is what I have done so far: \n1. Restart the phone. No help. The phone still does not recognize that it is plugged in. \n\n2. Boot to safe mode. No help. The phone still does not recognize that it is plugged in.\n 3. Tried my pixel charger for the pixel 4xl. No help. The phone still does not recognize that it is plugged in. \n\n4. Turned off the phone and plugged it in to the charger. The phone charges just fine until I turn the phone back on. Then the phone no longer recognizes that it is plugged in. \n\n5. I read many forum postings that show similar issues. Tried to charge with a USB C to USB A cable. The phone charges slowly. This is not an acceptable solution. \n\n6. Turned on developer mode and checked \"usb preferences settings\". It is already set to \"this device\" as is suggested in several forums. This has not fixed the issue. \n\n7. Today the phone is now recognizing that it is plugged in when I put the cable in to charge with the pixel charger. It will cycle between charging and not charging every 1.5 seconds for about 1 minute. Then sometimes it starts to charge and sometimes it stops recognizing that it is plugged in. \n\nFrom this basic troubleshooting, I do not believe the problem is hardware since it will charge slowly via a USB C to USB A cable. It is definitely not the charger since both the charger that came with the Pixel 3a and my Pixel 4xl work on my 4xl without any trouble. I do not believe it is an app since safe mode did not help. \n\nI would rather not do another warranty phone since that was a disaster the first time (FedEx delivered my package to the wrong address and it took 6 hours and 2 weeks to resolve). 1:1 support seems to be a waste of time based on my experience. They are nice but not very knowledgeable or helpful. I'm feeling kind of stuck at this point.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3",
    "post_time": "2020-07-30T16:48:09.382173+00:00",
    "reply": "1 Recommended Answer"
}