{
    "url": "https://support.google.com/pixelphone/thread/93647843/screen-flashes-or-becomes-black?hl=en",
    "title": "Screen flashes or becomes Black",
    "content": "My Pixel 4 has an issue with the display turning off and going to black.  I've included more specific details below, but to summarize the problem, the display will turn off randomly, regardless of what app I'm using or even if I'm on the home screen or lock screen. The screen flashes to black, but the touchscreen will still accept my inputs, and pressing the power button to manually turn it on will not reactivate the display.\n--------------------------------------------------------\n-It started several months ago, but has been getting progressively more frequent and now happens multiple times a day.\n\n-Randomly when using the phone, the screen will turn black and the display will turn off. I've noticed this happens much more frequently when using certain apps, such as Snapchat, however this can happen at any time. It's happened in every app and even occurs in the home screen or settings menu. Even after restarting the phone, the unlock screen will not always appear.\n\n-When the display turns off, pressing the power button, or using the touchscreen does not turn the display back on. This is the worst part, because when it happens I have no way of being able to use the phone until the display comes back on. Sometimes the display returns the first time I press the power button, other times it takes multiple presses, or takes several minutes of me trying to activate it.\n\n-When the display turns off, it can still be interacted with. I can hear the sounds and feel vibrations if I try to use it, and can even unlock the device by entering my PIN, even thought I can't see it.\n\n-Sometimes when using an app, the display will start turning off and on like a blinking black screen. When that happens, if I quickly return to the home screen the blinking will stop.\n\n-Sometimes I see green tinted scan lines. It does not take up the entire screen, but extends from left to right about 1 inch tall. This does not happen often but started recently.\n\nI've done lots of research to try and fix the issue, but to no avail. As of this time I have\n-Restarted the phone\n-Restarted the phone in safe mode(Still happens while in safe mode)\n-Turned off smooth display\n-Turned off dark mode\n-Removed the screen protector and case\n-Updated phone to most recent software\n\nAny feedback or suggestions is appreciated",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2021-01-15T19:04:30.418711+00:00",
    "reply": "1 Reply"
}