{
    "url": "https://support.google.com/pixelphone/thread/10147347/bug-or-feature-assistant-triggers-when-i-take-pixel-2-xl-out-of-my-pocket-even-w-max-sqz-setting?hl=en",
    "title": "Bug or Feature? Assistant triggers when I take pixel 2 xl out of my pocket even w/ max sqz setting",
    "content": "I recently got a new Pixel 2XL under warranty. This new phone triggers Google assistant whenever I take the phone out from my pocket. I have been experimenting and observing this for a week now. I'm talking hours of obsession - including factory resets to experiment with fresh settings. I can (95% or more often) reproduce the problem with no fingerprints (to ensure I'm not accidentally hitting that sensor - but the problem exists with or without fingerprints) and Squeeze sensitivity at the max - but doesn't matter what the sensitivity is.\n\nWith the phone on and screen unlocked*, I can turn the phone off, turn it upside down, rest the top edge on of the now upside down phone on a table, with the back of the phone resting on my index finger (far away from the fingerprint sensor) and wait some time for the ambient display to turn off - basically simulating the phone being in my pocket. When the ambient display turns off, I gently hold the phone so as not to trigger the Active Edge, lift the phone up and hold it flat like you would when taking it our of the pocket. When the display turns on the Google assistant pops up.\n\nAlso, I am pretty sure this issue has something to do with the Always on ambient display, because if you turn it off in settings, then the screen won't wake when you take the phone out of your pocket and the assistant won't appear. If you do have ambient display on, simply picking it up from the table when it is \"ambient\" on will not trigger the assistant. It has to come out of your pocket - or simulated pocket as per above.\n\nLastly, prior to breaking my old phone I know I turned off Ambient display and did not use it the past year because at the time i did not like it. When I got this new one I thought I'd give it a try. So that is why ran into this issue.\n\n*\"the phone on and screen unlocked\" --- during my \"testing\" I noticed that if I did not start from this state, I could not reliably reproduce the problem. For example if the phone was off and flat on the table with the ambient display on, sometimes when I rested the top edge on the table to simulate being in my pocket and then lifted it, i could not trigger the assistant . . . but sometimes I could . So, i don't really know what the exact initial states needs to be to get assistant to trigger - it happens to me 95% or more of the time and I know I'm not accidentally triggering active edge.\n\n-------------\n:-) And if you read this far you probably think I'm crazy. Oh well, I hope someone can reproduce this issue too. If not then I'd have to guess my new phone is broken and send it back.again.",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel 2",
    "post_time": "2019-07-18T14:47:06.646805+00:00",
    "reply": "2 Replies"
}