{
    "url": "https://support.google.com/pixelphone/thread/81891858/pixel-4a-android-11-battery-drains-insanely-fast?hl=en",
    "title": "[Pixel 4a / Android 11] Battery drains insanely fast",
    "content": "Hey folks,\n My current daily driver is the Pixel 4a with Android 11 (RP1A.201105.002) and my battery life is pretty bad especially in idle.\nNow let me explain my issue more clearly.\n I use the Pixel 4a now for a month and after 1-2 weeks I've noticed that Android 11 doesn't close apps automatically if you swipe them away, which wouldn't be a big deal if they would stop getting notifications or simply stop running in the background. But I've found out that some apps still run in the background despite restricting background battery usage and using battery optimization (ofc with adaptive battery on).\nOn my previous daily driver which used Android 10, it worked flawlessly. Some apps would run in the background but would be put to sleep after about 15 minutes.\nOn the Pixel 4a I currently use Greenify to force stop some apps I don't need to run in the background and my battery life is pretty amazing as you can see in this screenshot and this screenshot.\n Fast forward to today, without Greenify apps still run in the background (force stop in app info is clickable) and the \"while in background\" timer just goes up. I've restricted those apps but they still run in background even though I only use them once a day for about 5-10 minutes as you can see here in this screenshot. Keep in mind that I forced closed the app after discovering that the app still run in the background.\n So now my battery life looks like this. Which isn't really good. Some people might say that it is maybe an app, that drains the battery. Well guess what, no apps installed only the default apps and here you can see the madness. I charged my phone up to 95% and after about 4 hours in idle and 12 minutes SoT, it dropped down to 81%.\nCurrently it looks like this. As you can see now I only have 74% with 6 hours and 30 minutes in idle with 40 minutes SoT.\n So what the heck is going on?",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4a",
    "post_time": "2020-11-09T15:57:05.166562+00:00",
    "reply": "0 Replies"
}