{
    "url": "https://support.google.com/pixelphone/thread/1228382/random-huge-battery-drain-pixel-3-xl?hl=en",
    "title": "Random Huge Battery Drain Pixel 3 XL",
    "content": "I've been using my Pixel 3 XL happily since I bought it to replace my 2 XL at the beginning of December, and have even been getting pretty decent battery life (about 5 hours per charge), but three or so days ago it randomly started draining its battery really quickly. I'm talking ~15% per hour just on standby with the screen off, although I do get a fair few notifications coming through.\n\nI'm no novice to Android, and unfortunately the bugs that seem to come with it. My first instinct therefore was to check with apps were using power - absolutely nothing out of the norm, even system processes like Google Play Services were behaving. So I started to uninstall various apps to see whether anything made a difference. However, over several charges it had literally no impact whatsoever. I should probably also mention; I keep my phone lean at the best of times - I don't have any of the big draining apps like Facebook installed in the first place.\n\nThis is when I turned to a factory reset, I hate doing factory resets because they take far too long, and 2FA makes signing back into all my services nothing short of a nightmare. After this I was sure everything would have solved itself, but alas no. It's still draining away.\n\nI went to bed last night at midnight with 30% in the tank after two charges during the day (haven't had to do that since my Nexus 4), I obviously don't receive notifications during the night, and normally I would only use about 8% of my battery overnight, but I woke up at 7 this morning to find my battery completely drained flat. 0%\n\nWhat's the next step? I really don't want to have to deal with an RMA if I can help it. Is anyone else dealing with a similar issue? Like I say, it's very much come out of nowhere, I haven't recently installed a new app or done a system update. It's just randomly appeared.\n\nAny help would be massively appreciated.\n\nTIA,\nBen",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2019-01-23T09:23:31.300641+00:00",
    "reply": "4 Replies"
}