{
    "url": "https://support.google.com/pixelphone/thread/89050608/extremely-bad-support-for-a-defective-device?hl=en",
    "title": "Extremely bad support for a defective device",
    "content": "I have been a loyal Google user since the first Nexus. I currently have a two line Fi plan with unlimited data. I recently bought two Pixel 4a's and one of them stopped charging within the first two months of ownership so I started a warranty request and shipped it back for replacement or repair. The device was essentially brand new and undamaged, aside from this issue. Upon receipt of the device Google tech support sent an automated email asking me to pay $129 for fixing a cracked screen which my device didn't have when I mailed it in (using Google-provided packaging). I contacted support and explained the issue. I was transferred between five representatives, each had me start over explaining the issue again. I eventually asked to be connected to a supervisor. I was told they would email me within 48 hours. I waited. Eventually I received an email. Again I explained the issue. By the time the supposed supervisor replied, another automated email was sent saying my device was being shipped back to me. I explained what was happening. I had no continuity of communication with the supposed supervisor, instead each time I got a reply from someone, each days apart, i would hear from a different person. None of them seemed to have any inclination or ability to address the situation. Communication was extremely poor. I wound up shipping the device back for repair a second time. Again, I got the same series of automated emails. Again, no response or action taken by Google support personnel. I am now awaiting any response at all. I am now about one month without this brand new phone and not any closer to resolution. There seems to be absolutely no recourse for consumers and no support line to talk to a human, just email and chat and extremely long delays between emails without any progress. What an incredible waste of time and energy! I have never experienced such a frustrating support experience, especially for something which should have been covered under warranty. Buyer beware. Google's phone support is awful. They are totally unaccountable.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4a (5G)",
    "post_time": "2020-12-17T06:11:37.201694+00:00",
    "reply": "1 Reply"
}