{
    "url": "https://support.google.com/pixelphone/thread/39408205/google-pixel-1-gps-drifts-up-to-1-mile-away-not-on-android-10?hl=en",
    "title": "Google Pixel 1 - GPS Drifts up to 1 mile away (Not on Android 10)",
    "content": "Since 3.5 weeks ago, my GPS dot suddenly started drifting around the map (sometimes up to a mile away) when driving OR simply just sitting at home, using Google Maps.\n\nI can easily reproduce the issue by just sitting at home and trying to navigate somewhere on Google Maps, and watching the dot jump around.\n\nAside from Factory Data Reset, I've actually replaced the phone with not one, but two like-new refurbished phones. I am still experiencing the same exact issue.\n\nI've double-checked enabling all location services/accuracy (I always have them enabled in general). Tried the usual \"turn it off and turn it on again\" of course.\nOne phone I tried testing with the Android 10 update. The other phone (that I currently have), I *did not* update to Android 10. Both phones have the same issue.\nI've tried clearing Google Maps data/cache\nUsed a GPS repair app to clear GPS cache/recalibrate it.\nReplaced the SIM card with a brand new card (twice)\nMy wife has a Google Pixel of the exact same model (Pixel 1) as me, but a different network (she is on AT&T, I am on Verizon) and has no problems at all. So I don't think it's our environment (walls, vehicle) causing problems.\nAlso, this problem only started happening recently, after working fine for 2 years.\n\nTo summarize:\nPhone 1 - Google Pixel - Android 10 - Verizon - GPS drifts (after working fine for 2 years), bought in 2018\nPhone 2 - Google Pixel - Android 10 - Verizon - GPS drifts, \"like-new\" refurbished by Asurion in 2020\nPhone 3 - Google Pixel - Android 9 - Verizon - GPS drifts, \"like-new\" refurbished by Asurion in 2020\nPhone 4 - Google Pixel - Android 10 - AT&T - GPS works fine, bought in 2018\nEdit:\n\nAlso tested swapping the SIM cards in Phone 3 and Phone 4. After swapping the SIM cards, Phone 4 reproduced the issue and Phone 3 worked perfectly.\n\nVerizon insists the issue isn't on their end (I contacted technical support).\n\nIs there anything else I can do?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2020-04-11T15:17:13.515861+00:00",
    "reply": "1 Recommended Answer"
}