{
    "url": "https://support.google.com/pixelphone/thread/92908526/i-hate-my-pixel-too-but-i-hate-verizon-most-of-all?hl=en",
    "title": "I hate my pixel too, but I hate verizon most of all.",
    "content": "1st Verizon: Verizon straight lies. I needed unlimited hotspot, and they said it would only throttle due to network activity after going over the limit. That isn't true. They lock it at 600MB which caused even my email to time out. I owed them a few hundred bucks, but I had told them before I purchased it that without unlimited hotspot I'd lose the job I was trying to get bc it's online and would end up not being able to pay for the phone. They did it anyway. Now my credit report says I owe them thousands...thousands. They should lose their licensing and permits. The pixel...well, I hate it too because they seem to think that the internet is now the main form of communication, and maybe it is for younger people. However, my notification sounds are very loud compared to my ringer (same volume control?) and the only email/notifications I get are spam, so I'd like to turn off the email/tiktok/instagram/wtfe notifications....I mean im on a computer a lot so see that BS quite frequently. Why can't my phone just be a phone when I want it to be? I miss almost every call because I don't get that many so don't pay attention to it like a dog with a bone, and since I have the notify volume set to not scare me unless I feel it vibrate or hear it vibrate I miss the call. Our devices these days are doorways into our private lives and they give everybody the key in order to generate more revenue. I can't have my phone constantly dinging for no reason just so I can not miss the one phone call I might get today or this week. There is no way to seperate the call ringer volume from notifications volume. THAT'S LUDICROUS....and not the rapper. Google knows. They know it's a problem, but if they didn't ding you every time a kid posts a video or a company wants to solicit you their stock might drop.  It's not that big of a change. One of their interns could do it on a Saturday, but no. They read the thousands of complaints just like this as they sip on our tears and laugh...all the way to the bank...which they own.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2021-01-10T20:03:57.481678+00:00",
    "reply": "1 Reply"
}