{
    "url": "https://support.google.com/pixelphone/thread/13825327/confusing-problem-with-pixel-1-s-audio-and-recording?hl=en",
    "title": "Confusing problem with Pixel 1's audio and recording",
    "content": "The two problems:\n1) My Pixel stops recording any audio. Social networks can't use mic features. The camera is mute. No one hears me through the phone. Voice recording apps give errors.\ncombined with either\n2a) It stops recognizing headphones. If I plug something in, sound continues to play on the speaker. I noticed this option (2a) happens if the microphone issue starts when I have nothing in the headphone jack.\nor\n2b) A weird sound starts coming out of the headphones. It's as someone is continuously tapping in your ear. I can't play anything else from the phone because I only hear the tapping sound. If I take out the headphone, nothing plays on the speaker. I noticed this option (2b) happens if the microphone issue starts when I have a headphone plugged in.\n\nWhat I do to fix it:\nSometimes, rebooting work. When it doesn't, I have to reboot to safe mode and then reboot back to normal. Things start working again for some time (usually 3-6 hours, sometimes 1-2 hours), but always go back to the state mentioned above. This is hell.\n\nThere was this single time when even rebooting to safe mode didn't do anything to solve. The malfunctioning lasted a whole day. Thankfully, the Android Q update yesterday saved me and the \"safe mode reboot\" fix started working again.\n\nWhat didn't do anything:\nResetting permissions\nDeleting voice recording apps\nDeleting old (long time since updated) apps\nUpdating Android/Reinstalling the System\n\nWhat I didn't try:\nFactory reset (it seems unnecessary after the \"didn't do anything\" above)\nOpening the phone to see if something is wrong (don't have the knowledge for this + seems like a software issue)\nTrying an external mic (since the mic problem always come with a headphone jack problem, this is impossible; maybe if I had an USB-C mic)\n\nMore on the \"seems like a software\" above: I read here in the forums that some Pixel phones have similar mic/audio problems that only appear after months of use. But the fact that I can do the safe reboot thing makes it seem like a software issue. I don't know really.\n\nMy Phone:\nGoogle Pixel, Model G-2PW4200\nAndroid 10\nIn use since January-February 2018. No noticeble damage except a tiny year-old glass crack.\nProblem started 15-30 days ago (don't remember exactly)",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-09-07T19:52:59.055165+00:00",
    "reply": "3 Replies"
}