{
    "url": "https://support.google.com/pixelphone/thread/74995576/brand-new-pixel-4a-freezes-frequently-flickering-videos-random-display-zooms-audio-not-working?hl=en",
    "title": "Brand new pixel 4a: freezes frequently, flickering videos, random display zooms, audio not working",
    "content": "I just bought a brand new pixel 4a with the official cover. My phone's not working well at all. It's got a lot of basic problems and I need help. Okay so, here are the issues:\n\nPhone is freezing up/getting stuck frequently. Especially when typing a message or any text using Google keyboard and when changing between apps, like minimizing an app and opening another or just accessing the task manager. \n\n\"Story\" videos on instagram and snapchat and facebook and even youtube are flickering. Like strobing lights that usually follow an epilepsy warning message. It's very bad.\n\nLastly, the audio doesn't work below 15 percent battery power. Or at least doesn't work well. My friends and family can't hear me when it's low. And video calls just become boxxy and pixelated \n\nLastly, the phone has some strange behaviour sometimes like just zooming the display in for no reason and you can't come out of it without restarting. Swiping, going to home or doing anything doesn't help. I actually took a screenshot of this last behaviour as proof. \n\nBut the most common issue is that it is freezing up so frequently. I was just on a chat with google customer support and even during the chat, the phone froze up 3 or four times and sometimes the cursor vanished or I wasn't able to open chrome back up and sometimes the chat didn't show any text, just a blank outline...\n\nPlease help. This is a brand new pixel 4a phone, bought from the online Google store.\n\nEdit: This morning, the google assistant lights at the bottom were turned on with the faded screen and got stuck without going away. Tapping on the screen and swiping didn't help. I took a screenshot of course. Anywho, relaunching the assistant got it out of that coma. Like what's wrong with this phone????",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2020-10-05T07:00:33.515912+00:00",
    "reply": "14 Replies"
}