{
    "url": "https://support.google.com/pixelphone/thread/67671488/why-are-my-queries-re-pixel-phone-going-to-pixel-uk-all-the-time-and-then-transfer-to-pixel-canada?hl=en",
    "title": "Why are my queries re pixel phone going to pixel UK all the time and then transfer to pixel Canada",
    "content": "1. Always incorrectly routed questions on pixel support to pixel UK  on voice. the long frustrating wait for pixel Canada after you've explained your problem pedantically.\n2. if you turn off speaker when you're talking to somebody in an ordinary phone call you've got no audio at the other end so it was a suggested that pixel pull an app be uninstalled and reinstalled which is impossible because it's hard coded. Pixel 2 XL is in fine shape otherwise. Could you have Mic fault. I can hear them but they can't hear me. Sound coming from the speakers know hell either.\n3. I got to check those with service people. Thisy say Mic is not dirty.\n3. Voice to text doesn't work. long pauses going to string of doubt it comes out to this correct or God of war sometimes gobbledygook resembling nothing that you defeated. I'm so clear in some apps and some apps that comes up garbage. I'm having difficulty getting a warranty end dates on this phone because there's inconsistent replies us to the warranty end date. \nI got warranty for the night 2021. \nBill sale I don't have because the carriers that I purchased it from I no longer deal with.\nI've never had a problem requesting a bill of sale before because purchased this one I think privately so that I could use a phone while I have my other phone ARA made for battery issues issues. The problem is that I can't find out what was the last email reported on Kijiji try to track down the purchase with you the phone number lives on 100 colony on their clothes because it cold in and I just the last email I can't get talk to somebody suck from the Philippines. I am bound and determined to get something done for this phone. I understand but the low level support has really no nothing suck their script. We get snarky when I asked for a supervisor. Sometimes the supervisor knows less than a technician.\nMostly it's a horrible support experience. \nI need to purchase couple of those and poems for a new company I'm starting for two provinces in Canada and seem to deal with weren't your shoes if there is a phone that I purchase or husband in my company and I don't know the last personal addresses  \nI'm supposed to just give me a call and response I get disconnected for some reason or whatever.\nI'm talking to somebody on speaker their screams that start to go over pulling up which ends up muting my call.\nThank you for any kind of him good deal with this kind of multiplicity of problems with support.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2020-08-28T19:33:31.827108+00:00",
    "reply": "2 Replies"
}