{
    "url": "https://support.google.com/pixelphone/thread/76628945/need-pixel-2-xl-2nd-imei-number?hl=en",
    "title": "Need Pixel 2 XL 2nd imei Number ?",
    "content": "The Pakistan Telecommunication Authority (PTA)  is asking me registered both IMEI Number But phone has 1 IMEI and 2nd IMEI of ESIM is not available or hidden by Google.\n\nI told them Pixel 2XL ESIM only work on Google fi in USA but they still want 2nd IMEI number and want me to contact google to provide it.\n\nI only have 1 IMEI and EID in Phone Settings.\n\nThis is Response I get From Pakistan Telecommunication Authority.\n\n''Dear Concerned, IMEI registration is done after validation of IMEI with GSMA database, where all manufacturers obtain the GSMA TAC for programming of an IMEI. As part of this registration with GSMA, manufacturer provides Model, Make, Frequency bands supported, IMEI Slots programmed in device etc. Any IMEI when applied in DIRBS cross verifies the IMEI details with GSMA database to check the IMEI Slots provided to ensure all IMEI programmed are registered. We have already escalated your issue with Google, since Google model is a non-type approved model and there is no official presence of google in Pakistan, in order to facilitate PTA contacted Google USA requesting them to either correct IMEI definitions within the GSMA as this information is added by Google at the time of obtaining GSMA TAC. In response, following has been provided by Google Please refer to standard Pixel support website to get help: https://support.google.com/pixelphone/topic/7078224?hl=en&ref_topic=7078170 In light of this, please escalate your request via below link to Google as you are owner of their product and qualify as their customer, furthermore we are also trying to follow up with Google to provide facilitation, however we are not able to proceed further till either Google rectifies their IMEI Slot definition within GSMA database or provides details on how to obtain 2nd IMEI slot.\"\n\n\nSO any help would be Appreciated Thanks in advance.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-10-13T07:17:30.242503+00:00",
    "reply": "4 Replies"
}