{
    "url": "https://support.google.com/pixelphone/thread/2368093/can-you-help-me-understand-how-my-google-pixel-3xl-keeps-getting-hacked-accessed?hl=en",
    "title": "Can you help me understand how my Google Pixel 3xl keeps getting hacked/accessed?",
    "content": "I have consulted with the G-Suite forum and I have been re-routed here.\n\nMy PC was hacked a few months back. I have recovered and secured my accounts since. I have recently found out my domain has been set up with a Blogger account unbeknownst to me. I tried to find out how to delete my domain from the blogger account, but I need G-Suite access, or a Account Administrator access. When I sign in the prompt tells me I have an ordinary Google account. \n\nMy Google Pixel 3xl was also compromised during the hack. I do not know if the administrator account was set up on the PC or my phone. I do know my phone has been accessed before by another device. However, I do not know if someone else has administrator privileges to my phone or Google account either. I also have been having issues with my device being accessed remotely and rooted without my knowledge. \n\nI then realized my Google Play Store version had to changed to a 3rd party apk version. Many apps have been switched to 3rd party apps including the default phone and messaging app. \n\nThe factory reset doesn't seem to remove root. If someone had administrator control over my device are they able to access my device and wipe it? I'm not sure how this keeps happening. \n\nCan you also explain to me how the hacker was able to open a Groups Account? A Blogger account was also opened on my email and the hacker used my domain to open this when they comprised my domain host.\n\nCan someone explain what may be going on? I am willing to delete and/move my Google account if necessary. I would just like to know how this happened and a solution.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-03-13T22:32:55.206196+00:00",
    "reply": "2 Recommended Answers"
}