{
    "url": "https://support.google.com/pixelphone/thread/6084050/can-call-blocking-be-improved?hl=en",
    "title": "Can call blocking be improved?",
    "content": "I've got both 'Caller id and Spam,' and 'Filter Spam calls' boxes checked in my phone setting and they appear to work. But they only appear to work on numbers that are \"known\" as incoming spam numbers. Makes sense. But seeing as how spammers change their numbers all day every day, I keep getting about 5-7 calls per day that are not known by Google's filters as spam. Meaning, I have to check my phone, and block these numbers every single day. Get's pretty old, pretty fast. And there's no end to how many phone numbers the \"social security scam\" business possesses, in case you haven't noticed. lol. My question is, why isn't there a simple feature within this wonderful built in spam filter to only accept calls from my contact list? Meaning, \"block ALL BUT my contacts.\" This way, if it's someone I don't know, they can simply leave a message and I'll click \"add to contacts\" and all is well. It'd keep me from having to listen to my phone ring several times a day with numbers I already know are spam. And yes, I know I can use a call blocking app to do this, and I did just that with my Samsung Galaxy phone, but in my experience, using a third party call blocking app that lays over your phone just slows everything down and often interferes with other apps, I found. The spam features are a big reason for me switching to Pixel 3XL. And I don't mind being a part of the community that \"fights spam\" but I'd rather not have to report every single call that comes in on my phone. Especially when \"white listing\" your entire contact list seems like such an obviously easy feature to add to this already good built in spam filter. Anyone have any ideas??",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3 XL",
    "post_time": "2019-05-14T01:28:46.02955+00:00",
    "reply": "1 Reply"
}