{
    "url": "https://support.google.com/pixelphone/thread/77357569/pixel-4-xl-random-shutdown?hl=en",
    "title": "Pixel 4 XL random shutdown",
    "content": "Hi there. I am a Pixel 4XL owner since November last year.\nMy phone was perfectly fine. I updated to Android 11 since the first day it came out (can't recall the specific date, but it was like 2-3 weeks ago right?) Anyways, at first it was perfectly fine, there were no issues at all. Until this week. My phone started to shutdown randomly. It all started with one specific instagram story which whenever I clicked that specific story, it would cause my phone to restart. Since then sometimes when I received a notification and it made it crash, sometimes out of the blue.\nYesterday is when I got really scared. I was in about 30% battery, then it restarted I believe because of a notification. Turned on and immediately restarted again 2 more times until it suddenly said that battery was in 0%. All of this in maybe 2-3 minutes.\nI have been googling but didn't find anything similar. What should I do? downgrade? Wait for an update? Panic?\n\nEDIT: I have not unlocked the bootloader, I'd really like not to wipe my phone because of someone not being able to do their QAs correctly.\n\nEDIT 2: Also another thing to notice, my \"files management\" (?) is TERRIBLE now. Taking a photo from WhatsApp' chat takes years. Deleting photos from Google Photos app (random folders, not cloud ones) turns into a nightmare. You know that the behavior is that you delete a photo and then \"the next one slides in\" well, this slide will show a photo that is not the correct one in the order and it will be pixelated. It won't let me delete it nor do anything, I have to exit this fullscreen view and select again the photo I want to delete. This happens every single time.\n\nEDIT 3: Just happened again. Out of the blue. Maybe something related to low battery percentages?? I'm on 25 now. Plugged the phone, battery dropped to 8%.\n\nEDIT 4: I seem to be able to reproduce the error. Every now and then, when I'm seeing any kind of fullscreen videos (IG Stories, video from Twitter, or my own saved videos on gallery) it will do this shutdown. I don't know if it's related or not, but It seems to only happen when the battery is below 50%?\n\n\nI did this same on reddit, getting desperate now.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2020-10-16T16:37:02.330917+00:00",
    "reply": "0 Replies"
}