{
    "url": "https://support.google.com/pixelphone/thread/82335300/upcoming-changes-to-how-google-account-storage-works?hl=en",
    "title": "Upcoming changes to how Google Account storage works.",
    "content": "Today, we announced three changes to our Google Account storage policies and over the coming weeks, we’ll be notifying users to let them know more about how some of these changes may impact them.  You can learn more about these changes in our Help Center or by reading on.\n\nStarting June 1, 2021, some additional items will begin counting toward your storage quota. Learn more about what items currently count toward quota.  \nHigh quality and Express quality photos and videos backed up to Google Photos after June 1, 2021. Learn more about this change.\nOnly photos and videos uploaded on or after June 1, 2021, will count toward your quota.\nHigh quality and Express quality photos and videos uploaded before June 1, 2021, will not count toward your quota.\nPixel 5 and earlier devices will not be impacted. Your existing benefits & any promotions remain unchanged. High quality uploads from these devices will still be exempt. Learn more. \nFiles created or modified in Google Docs, Sheets, Slides, Drawings, Forms and Jamboard. \nOnly files created or modified on or after June 1, 2021, will count toward your quota. \nFiles uploaded or last modified before June 1, 2021, will not count toward your quota. \n\nAnd this is how your inactivity impacts your data after June 1, 2021\nIf you do not use Gmail, Google Drive (including Google Docs, Sheets, Slides, Drawings, Forms or Jamboard) or Google Photos for 2 years, your content within the inactive product(s) may be deleted (after reasonable advance notice).\nIf you're a Google One member with no outstanding payment or quota issues, you're in good standing. You are considered active.\nLearn more about what counts as activity.\n\nIf you are over your storage quota\nYou can’t upload new files or images to Google Drive. \nYou can't back up photos or videos to Google Photos. \nUntil June 1, 2021 you can continue to back up High quality and Express quality photos and videos even if you are over quota.\nYour ability to send and receive email in Gmail can also be impacted. \nYou can’t create new files in collaborative content-creation apps like Google Docs, Sheets, Slides, Drawings, Forms and Jamboard. And until you reduce your storage usage, neither you nor anyone else can edit your affected files. If you are out of storage you can't add or copy existing content.\nUntil June 1, you can  continue to create and edit files in these apps. \nYou can still sign into and access your Google Account.\nWhen you have been over your storage quota for 2 years, your content in Gmail, Google Drive (including Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files) and Google Photos may be deleted.\n\nWe know you may have questions about this, so we have some answers to common questions below (with more in the Help Center). If your question isn’t covered there, please create a new post. \n\nWith thanks,\nGoogle Pixel Support Team",
    "is_img": 0,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-11-11T18:40:19.442135+00:00",
    "reply": "0 Replies"
}