{
    "url": "https://support.google.com/pixelphone/thread/97864262/pixel-3-stops-working-after-february-2021-android-11-security-update?hl=en",
    "title": "Pixel 3 Stops working after February 2021 Android 11 Security update?",
    "content": "I would like to note that my Pixel 3 is well taken care of and had no physical damage and was in perfect working order before this automatic Android 11 software update.  The update was scheduled for 2am and I left the phone charging when I went to sleep.  I woke up to a completely blank screen and a phone that can't be turned on.  From the \"find my device app\" it looks my phone became non-responsive 45 minutes after the scheduled update (at 2:45am).   I went though all troubleshooting steps in the community forums and google website (plug into different outlets, cords, plug into a computer, charge it longer, hold power and volume down for >20 sec, etc).  Nothing worked and my phone gave no signals (little red light or anything on the screen) that it was functioning.  I contacted Google Customer Service via Chat.  The agent went through everything with me again via troubleshooting and determined it may need to be physically examined.  They asked for and checked my IMEI in their system along where I purchased the phone (it was directly via the Google store).  As the phone was purchased in Nov 2018, they said it was outside of warranty and I would have to either send it it or visit an authorized repair shop to have it assessed and then provide me a cost estimate to repair the phone.  I emphasize my Pixel 3 was working without any issues prior to this automatic Android 11 software update.  Now it does not work and Google is saying I am responsible for repairs as they are limited due to my hardware warranty expiring in December 2019.  The agent apologized and said they were limited on what they could do but they would have a supervisor update me via email in the next 24 hours.  I must say this was entirely unexpected (and disappointing) from a customer service vantage point on Google's part given the Pixel 3 was a flagship phone for them just over 2 years ago.  This was hardware product that worked without issue and after a required software update by Google the phone stopped working--and the customer is provided an apology and must spend the time (noting I have no other phone to call out on) and money to find and cover the costs for repair/replacement.  I really liked Google products prior to this, but this might be the last Google product I purchase.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2021-02-12T18:56:43.942729+00:00",
    "reply": "10 Replies"
}