{
    "url": "https://support.google.com/pixelphone/thread/80234583/where-is-my-phone?hl=en",
    "title": "Where is my phone?",
    "content": "I'm only posting here because I have no idea what I'm supposed to do next.\n\nEarly in October, I discovered my battery was swelling to the point where the case was starting to crack. So, naturally, I got in touch with support. They told me my phone was out of warranty, so I would have to send it in for repair/replacement without first receiving a replacement phone. It would take about five to ten business days.\n\nI had to think about this, because this is my only phone. As in, I have no landline, and a phone is kind of a necessity for modern life. But I figured I could go a week or two without a phone. Better than having it explode or leak in my pocket at some point, right?\n\nIt arrived, according to Fed Ex, at the Google facility on October 5th. And then I waited.\n\nAnd waited. \n\nAnd waited some more.\n\nI heard not a word about my phone after I sent it in. No acknowledgement, no message of progress, no estimation of time, so I contacted Google via chat on the 19th. I talked to a very helpful person who looked into it for me and even went to a higher tier to find out what happened to my phone.\n\nAs it turns out, there are inventory problems, but no one contacted me to tell me so. The woman in the chat told me she'd see what she could do and promise to keep me updated. And she has.\n\nAbout every 12 to 24 hours, I get a message that they are looking into my problem and will update me when any progress has been made. It's been almost two weeks of this.\n\nI still don't have a phone. I don't know when I'm going to get my phone back. The person I chatted with, though helpful, is not high enough of a tier to expedite things.\n\nSo I'm sending it out here in the hope that someone in the Google hierarchy will notice this and maybe see what the deal is. Seriously, if I'd known I'd not have a phone for a month or more, I would have just chanced it exploding on me and tried to save for a new phone (not a Pixel, since it's so much trouble to get it repaired/replaced even when the problem isn't my fault).\n\nTL;DR: Could someone at Google tell me details on where my phone is or an estimate on how much longer it will be or something? Anything? I realize coronavirus has made things a little weird, to say the least, but I really, really need my phone back.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2020-10-31T18:18:35.771153+00:00",
    "reply": "10 Replies"
}