{
    "url": "https://support.google.com/pixelphone/thread/91842271/pixel-3a-devices-can-t-connect-to-one-specific-wifi-but-all-other-devices-can?hl=en",
    "title": "Pixel 3a devices can't connect to one specific wifi, but all other devices can",
    "content": "After the Android 11 update, my Pixel 3a has been experiencing consistent wifi connectivity issues.\n\nWhat the issue looks like:\nThe wifi appears to be \"saved\", but returns \"Failed to connect to network\" or disconnects within thirty seconds after I try to connect.\n(The wifi is AT&T.)\n\nConstraints:\nAnother Pixel 3a device also has the same problems with connecting to this wifi after the update. (Both my device and this device have been used for less than a year, never sustained any falls, drops, or other hardware damage, and are barely used save for work functions such as scanning documents.)\nOther devices can connect to this wifi perfectly fine.\nMy Pixel can connect to other wifi perfectly fine.\n\nWhat I have tried, without success:\nRestarting my device\nResetting network settings\nManually forgetting the network, waiting, and reconnecting\nResetting app settings\nBooting in Safe Mode (there was still a wifi problem in Safe Mode, this did not help)\nTurning on/off Bluetooth\nTurning on/off Location\nTurning on/off Airplane Mode\nTurning on/off randomized mac address\nTurning on/off Adaptive Connectivity\n\nSome observations:\nInitially, resetting app settings seemed to fix the problem for about half an hour, but this stopped working after a few days\nAlthough I enabled Location and \"Turn on wifi automatically\", the main \"Wifi preferences\" dialog still displays it as \"Wifi doesn't turn back on automatically\"\n\nI am unwilling to do a complete reset of my device, as other users with similar problems have reported this to be unhelpful. In addition, it does not seem to be a problem with my wifi router because every device that is not a Pixel 3a can connect to the wifi without any issues.\n\nThanks for your time and help.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a",
    "post_time": "2021-01-03T21:39:19.738823+00:00",
    "reply": "1 Reply"
}