{
    "url": "https://support.google.com/pixelphone/thread/94949867/pixel-4a-loses-70-battery-overnight?hl=en",
    "title": "Pixel 4a loses 70% battery overnight",
    "content": "So my brand new Pixel 4a seems to have developed a serious problem with its battery.\n\nThis is a new device purchased for Christmas about 4 weeks ago.\n\nA few days ago I noticed that with 40-50% charge, I would wake up to a dead phone after 8 hours of sleep.\n\nLast night I tested this problem by doing the following:\n\nUninstalled Facebook and about 10 other unnecessary apps which might be draining battery.\nEnabled extreme battery saver, adaptive charging, checked battery optimization is on for all possible apps, and enabled all possible adaptive battery settings.\nCharged to 100% before bed then unplugged it.\nClosed all open apps, activated do not disturb and airplane mode, turned off location services and WiFi and Bluetooth.\nThe battery then drained, on phone idle, from 100 down to 34 percent in less than 9 hours. That's a loss of nearly SEVENTY percent battery overnight on idle.\n\nWhat the heck is going on? Is this just a faulty battery?\n\nEvidence from my Battery Usage statistics - the phone detects zero apps used overnight other than Idle, and claims that Idle only used 1% battery while it was draining the entire time:\n\n\n\nA couple of potential causes I can think of:\nI have been playing a mobile game Legends of Runeterra for several hours per day, maybe this is too demanding for a Pixel 4a and has messed something up internally?\nI bought the phone in the UK but am now living in New Zealand. The charger is being used through a cheap plug adapter (and obviously different voltage etc) which has fried the internal battery components?\n\n\nAny advice would be massively appreciated...\n\nCould this be a software/hardware problem?\n\nI will try the 'Safe Mode' troubleshooting approach when I go to sleep tonight, and then consider a Factory Reset tomorrow.",
    "is_img": 1,
    "category": "Battery and Power, Google Pixel 4a",
    "post_time": "2021-01-24T18:30:13.72203+00:00",
    "reply": "3 Replies"
}