{
    "url": "https://support.google.com/pixelphone/thread/59510999/pixel-2-xl-won-t-charge-on-original-charger-usb-c-to-usb-c?hl=en",
    "title": "Pixel 2 XL won't charge on original charger USB-C to USB-C",
    "content": "Ok, I'm on my fourth Pixel 2XL due to warranty issues, this one is out of warranty.  The phone will periodically not charge, I called google about this when it was still under warranty and got the run around so I said F it, I'll just deal with it.  A subsequent update and all was well for several months, hell probably a year.  However, this latest version of Android has brought a host of issues to my phone, most of which have been fixable.  Most of my settings were lost for example, google assistant no longer recognizes my voice, my news feed and Gmail had to be setup again.  \n\nHowever, the larger problem is with charging.  If I charge the unit with the google included chargers it does not work.  The chargers aren't the problem, my wife's Pixel charges just fine.  Mine was charging until the update in June (and everything went wonky).  I can't charge when using USBC to USBC the phone just shuts off.  When using USBA to USBC it works some of the time but will periodically shut the phone down, I can't figure out the trigger on that one.  For example it shut down Monday overnight and again last night, but has worked well a half dozen times in between.  \n\nOn the car charger it will usually charge but I have to go through a restart before it will charge.  The restart happens within a minute or two of plugging the phone in.  \n\nThis appears to be a very common problem but the threads appear to be locked for discussion.  I'm running out of ideas and hoping someone here has a suggestion that I've overlooked?  \n\nSo far I've tried safe mode which still has the issue, I've put no new apps on my phone and as such don't believe this is a third party app issue.  This appears to be a google problem, especially given the high volume of issues and complaints I've found.  \n\nTips/Tricks would be nice if anyone has them.  Not sure I can limp along for 5 or 6 months like this.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-07-17T13:24:58.99906+00:00",
    "reply": "0 Replies"
}