{
    "url": "https://support.google.com/pixelphone/thread/64264473/why-does-google-need-to-lock-threads-on-their-help-forums-are-they-running-out-of-storage-space?hl=en",
    "title": "Why does Google need to lock threads on their help forums? Are they running out of storage space? ;)",
    "content": "99.9% of the time when I'm trying to find an answer for something on a Google Forum, the thread returned as the first search result only has a little information that is even partially helpful, and it is locked so there can be no further replies. That means, if anybody were to find the same thread, but later discovered an *actual solution* for the problem, they'd be unable to post to the thread which happens to be the first search result returned for the issue that probably the majority of the people experiencing the issue end up reading before anything else. \n\nLong story short, you shouldn't need to lock threads on your forums, Google, unless maybe you can't afford enough storage space to support leaving the threads unlocked.\n\nAnd now that I've stirred up some controversy, I'm guessing that somebody might actually read this post, and I might actually be able to find a goddamn solution to the real problem I'm having that brought me here in the first place!\n\nBut before I get to that, Google, I also noticed that, when I finally dig down to the point where I can click a link to contact you for support (\"If you’re experiencing an urgent issue, you can contact us directly, and we’ll try to get back to you as soon as possible.\") clicking the \"contact us\" link just returns me to the top of the get help page! Wow! Really classy move, there! Totally not at all alienating or frustrating to end users to send them back to where they started when they think they finally found a way to send you a request for support. 😜\n\nAnyway, here's my real problem. \n\nNo wait! I almost forgot one other precious gem I came across here! ☺️\n\nI think it's really interesting how some companies are managing to keep their entire staff fully employed and productive while working from home during this pandemic - providing equipment as necessary, IT teams scrambling to adapt to new security requirements for everyone to use VPN and other remote access solutions, etc - yet a tech behemoth like Google finds it a convenient excuse to provide less support!\n\nIs like, \"oh gosh. It sure is real hard to keep a full support staff working when they have to do super complicated stuff like answer phone calls and emails from end users looking for help with problems with our products - software and hardware that they now depend on even more because most of them are stuck working at home. Looks like we have no choice but to have a looooot less people in our support department available to help you, so it's going to take a looooot longer for you to get help now, that is, of course, if you can manage to figure out how to actually contact us. So sorry! Gosh darn that COVID-19! Right?\"\n\nLong story short, it's times like these where companies show their true colors. And in Google's case, instead of embracing this change and facing it head on, seizing the opportunity to bolster their support staff (since they'll have lower overhead with people working from home anyway) and provide even *better* support, they've decided to not only lower the quality standard for the support they provide, but to add insult to injury by redirecting users to the start page of the help center when they click on the \"contact us\" link!\n\nReally nice. Great way to make it clear to everyone how much you care about supporting your products and the people who depend on them, especially at a time like this when people are even more desperate and depend even more on technology to work properly because they can't leave their homes.\n\n\"Hey, people. Here you go! If you really have an urgent issue, you can click this \"contact us\" link to send us a message and we'll help.\n\nHaha! Psych! You actually believed that? LOL! What a sucker! No, you go back to the help center start page now. There is no contacting us for help hahaha!\n\nAnd by the way, thanks for all the billions of dollars and letting us use all of your personal data for financial gain!\n\nWell, best of luck with that shit you bought from us that doesn't work properly, and go fuck yourselves! We're off to the bank, bitches! Peace out! 💰💰💰💰😃💰💰💰💰\"\n\nOkay, seriously, now that I've gotten that out of my system, why the heck is it that I can use the microphone on my headset when making phone calls or issuing voice commands to Google Assistant, but when doing a recording of my voice in any other application (specifically, WhatsApp), the phone will only use its internal microphone? What good is it to be wearing a headset so that I can go hands-free if I still need to hold my phone to speak into it when using most other apps that access the microphone, aside from those that use it for calls like Zoom or Skype? Why is it that the Android OS doesn't simply reroute any request for the microphone to use the Bluetooth headset microphone when it's connected? I mean, it works for some stuff oh, why can't it work for everything? Why isn't there at least a global preference for which microphone should be used when a Bluetooth headset is connected? Whose lazy ass should be fired for not bothering to make this work properly?\n\nIn closing, I hope anyone reading this realizes that this is purely written as satire, dark comedy, and as a critical opinion piece to voice frustrations that probably many of us deal with on a regular basis, yet have no outlet for and no means of resolving because the companies and people who make and sell these products that we all use refuse to provide proper support for them.\n\nI fully expect to never learn of any solution to the problem I'm experiencing because I doubt there is one, aside from someone working at Google or WhatsApp deciding to hop right on this issue and fix it. And god forbid they should actually be burdened with improving or fixing problems with their software the way thousands of other smaller companies do in order to provide a better user experience and drive more sales! No, companies as big and wealthy as Google and others like them already have so many millions of users depending on them that they have to make very little effort to provide a functional product. They already control the market. They can just get fat and lazy and let us poor saps deal with whatever effort they decide to put into the next iteration of phone or operating system they release. I mean, it pretty much comes down to two choices: Google, or Apple. And if you've already got a Google phone or other Android OS device, by the time you realize how many problems there are with it, it's too late. It would be such a monumentally time consuming effort to make the switch to Apple and transition all of your data to their platform that you're kind of stuck in the Google tar pit.\n\nOh, the injustice of it all. The sheer, blatant disregard and utter lack of accountability, conscience, or compassion. The corporate ownership and digital slavery of mankind. Oh, this soulless maze of zeros and ones that we've all become hopelessly and frustratingly trapped in. At times it's so upsetting and dehumanizing I feel like it might even be a real blessing if a massive solar flare disrupted the functionality of all our electronic devices and sent us back to an age where such things would either be laughed at, or seen as some evil magic that should be destroyed.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-08-11T23:09:07.164691+00:00",
    "reply": "0 Replies"
}