{
    "url": "https://support.google.com/pixelphone/thread/61444117/notifications-squished-and-not-expanding-properly-in-pull-down-notification-drawer?hl=en",
    "title": "Notifications squished and not expanding properly in pull-down notification drawer",
    "content": "In the last ~3 weeks (I think since the July 2020 security update) I've noticed my notification drawer (which you drag down with your fingers) is no longer expanding further than about 50% the height of the screen. Additionally, it no longer allows me to scroll the list of notifications within the drawer. As such, the notifications in the drawer are squished and some scroll off the bottom of the drawer and I cannot see them at all. See sample screenshots at the bottom of this message.\n\nNormally, I would just use my fingers (have tried 1, 2, 3, 4 fingers) to expand the drawer down to the full height of the screen (and once it's full height, I used to be able to scroll the list of notifications independently) but now it just expands the shortcut buttons section (the top row of the open notification drawer) rather than the notifications section itself.\n\nI've not changed any settings relating to the notification drawer, and in fact, I cannot even find any settings to customised the look/feel/layout of the notification draw so I believe it was a change made as part of an update rather than something I've changed.\n\nI've also tested with my launcher (I use Nova Launcher Pro) and the default pixel launcher - the notification drawer doesn't change and works the same no matter which launcher I use so I don't think it's an issue with Nova Launcher.\n\nExample screenshots (two with FB messenger, one with YT music)\nhttps://imgur.com/F48r6Xm\nhttps://imgur.com/41YpqyX\nhttps://imgur.com/P1lxXE4\n\nThis is what happens when I try to expand the drawer - it just expands the shortcut icons row at the top\nhttps://imgur.com/ZnVWXiQ",
    "is_img": 0,
    "category": "Homescreen and Launcher, Google Pixel 4 XL",
    "post_time": "2020-07-28T00:13:40.328039+00:00",
    "reply": "2 Recommended Answers"
}