{
    "url": "https://support.google.com/pixelphone/thread/103793711/b2x-india-charging-29-000inr-for-glass-replacement?hl=en",
    "title": "B2X India charging 29,000INR for glass replacement",
    "content": "My name is Siva ganesh, I'm from Hyderabad, India.\nRecently a month ago I bought Google Pixel 4a for 31,000INR. 2 Weeks ago phone fell down and my screen got damaged. I contacted pixel support and they said I have to pay 500INR and send device via courier service to B2X services, Mumbai where device will be observed and estimate will be given to repair.\n  I did sent device before sending my device here is my device condition:\n1) Able to attend calls (I received using earphones and after answering calls I'm removeing earphones and talking through phone directly)\n2) Able to use Internet (WhatsApp web, signal, Google maps live location if phone is not able to connect to internet I cant access these services from mobile)\n3) Able to charge mobile and my charging is lasting by three days (As mobile is on standby)\n4) Able to invoke Google assistant and three tasks like creating alarm or reading notifications\n5) Able to connect my mobile to car and use android play and see notifications in car display\nI'm able to track my mobile in transit for three days to B2X service center in Mumbai.\n  When B2X examined phone the estimation they said was 29,000INR (which is my total phone price) stating\n1) Damaged battery\n2) Damaged motherboard\n3) Damaged back glass\n4) Damaged mid plate\n5) Damaged screen\n6) Liquid damage\n  My phone didnt even touch single drop of water or single scratch on Backglass. If there is an issue in motherboard or battery or mid plate then I won't be able to use any of the services I mentioned above. Just for changing screen why did they charge this much.\nAs my phone is under warranty I can claim for free replacement as I dropped phone from minimal height (durability is very less) but I was ready to pay money for screen replacement. These people cheated me stating all these damages\n    Now I dont know what to do as they are stating my device wont be in same position as I gave (as per they already stated this statement)\n  Now I lost my 31,000INR (~430 USD) I would have repaired locally with just replacing glass. I thought pixel team are professionals even though they charge  more money they can handle it better.\nLater when I google about B2X i can see same complaints that they wantedly charge more when they receive device.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-03-25T07:35:37.923152+00:00",
    "reply": "0 Replies"
}