{
    "url": "https://support.google.com/pixelphone/thread/63139599/what-was-your-experience-with-an-rma-product-sent-back-to-google-and-they-lost-it?hl=en",
    "title": "What was your experience with an RMA product sent back to Google and they lost it ?",
    "content": "I'm curious as to anyones expereince with customer support dealing with RMA products. I contacted support in regards to my device battery swelling. \nI was given two options on how to return the item, either send back defective item first then they will send out a replacement or they can ship out a replacement but will put a hold on my account for the device while they await the defective item. \n\nI chose the second option and sent the phone back with the label provided. Thought nothing of it as I did my part. Lo and behold I get an email a few weeks later telling I was charged full price for the refurbished product they sent me because their warehouse has no record of receiving the defective item. \n\nWhat ???? How can that be when the tracking number clearly shows it being delivered and signed for. \n\nDid a bit of sleuthing on my end trying to figure out who screwed the pooch on this one. Come to find out Google created two shipping labels .. when you check on the status of the RMA it shows you the tracking for return label and for the label they used to send replacement device. \n\nThe return tracking number listed there and the number listed on the label support sent me are two different numbers. They do not match. The one listed on the website shows pending and the one I received via email shows delivered. \n\nSo now I'm asking to be refunded my money since clearly this was a mistake on their end not mine but they received the phone and as such a credit should be issued. However what I'm getting is the run around and being asked to wait for investigation to be completed because they cannot locate the phone.\n\nSo with all that being said .. has anyone else been through something like this and how did it work out for you. What actions did you have to take to get this resolved in a manner that was suitable to you ?",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2020-08-06T02:54:29.009995+00:00",
    "reply": "3 Replies"
}