{
    "url": "https://support.google.com/pixelphone/thread/25954032/1st-gen-pixel-can%E2%80%99t-make-receive-calls?hl=en",
    "title": "1st Gen Pixel Can’t Make/Receive Calls",
    "content": "Hi,\n\nI have a 1st generation Google Pixel. I have been having problems with the phone for months now. I can't make or receive calls. When I receive a call, I answer and then the phone freezes and I have to restart the device by holding the power button long enough. Sometimes I answer it and it just returns me to the call menu (I don't know what its called, the menu when you receive a call where you can accept or reject the call). Sometimes it does successfully accept the call but there is no sound. And very rarely I accept it and I can hear the other person but the sound cuts like 20 seconds into the call. Same problems when I try to make a call as well. And not just with the Phone app, same problems occur when trying to use WhatsApp call. I have tried disabling some services, tried deleting the updates for the Phone app, tried deleting some apps and then all apps, tried Safe Mode, Factory Reset with my apps restored and Factory Reset with none of my apps/settings restored. None of it worked so far (after all that I am convinced this is a hardware issue, not a software issue). The screen is cracked on the top left corner (I don't know if its related). I would like to know, which part of the phone needs to be changed/repaired, which hardware component is the cause of this problem? I love this phone, and if this problem is fixed I want to keep using it. Since I live in Turkey, I cannot send it abroad for replacement because the tax I would pay for the replacement device is just unbelievably high. And since Google left the Turkish market I have no place to go in Turkey as well. If you could tell me what is the problem, what needs changing, which parts are the cause, if you could tell me the solution I might get it fixed through a 3rd party repair shop, and keep using this awesome phone.\n\nThanks in advance.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel",
    "post_time": "2020-01-17T19:59:39.31458+00:00",
    "reply": "1 Reply"
}