{
    "url": "https://support.google.com/pixelphone/thread/76181084/how-to-get-a-warranty-replacement-on-a-pixel-4-xl?hl=en",
    "title": "How to get a warranty replacement on a Pixel 4 XL?",
    "content": "This is really frustrating.  A few weeks ago my phone starting shutting off when in my pocket and I had the 50% battery issue that goes with it.  Basically the battery has a bad/unstable connection with the motherboard.  I called google and they told me to send it to them or take it to ubreakifix.  They said ubreakifix would be a lot faster, so that's what I did.  I took it to them, they had it for 5 days (a few days waiting for parts), and I was told they replaced or added shims to it.  That took care of the 50% battery life messages, but it still shuts down.\n\nI called google again, and they escalated the claim and said they would call me back within a couple days for the next steps.  That never happened so I took it back to ubreakifix.  This time they replaced the motherboard.  Sadly, the problem remains.  They told me that google has them replace basically everything BUT the battery, and I'm positive it's the battery (well the cable from the battery) that is the problem.  I brought it back to them a 3rd time and they say there's nothing more they can do and it needs to go through google.  I've been contacting google, but the chat agents say it's escalated and end the chat, and the last agent I spoke to on the phone said it's still escalated and he can't do anything about it.  I've been told a couple times they need to verify the phone's warranty status.  The 4XL was released in the US on 10/25/2019 and today is only 10/10/2020.  No matter what, the phone should still be under warranty.  I don't know why Google can't process a warranty replacement while Ubreakifix could process warranty repairs.  \n\nHow does someone get a less than 1 year old phone repaired or replaced under warranty with Google?  This has been a maddening and frustrating experience.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-10-10T21:12:41.83113+00:00",
    "reply": "0 Replies"
}