{
    "url": "https://support.google.com/pixelphone/thread/94346284/pixel-4a-inexplicably-nonresponsive?hl=en",
    "title": "Pixel 4a inexplicably nonresponsive?",
    "content": "What seemed to start as a battery issue has somehow turned into the device being fully non-functional nor responsive. I say this having tried every available online troubleshooting guide and chatting with Google on a number of occasions. Having purchased the phone and a warranty from Bestbuy I also went to see what Geeksquad might be able to do about it. They confirmed my issue and said the best they could do is offer an $80 replacement device. Talks with Google have amounted to maybe seeing a new device get here by Monday but my first ticket was 'received' and returned by a specialist last Monday. That's a two week turnaround period where I've had no phone, two full work weeks. No attempted \n\nMy question, I think, has a few parts. Has anyone had this issue and been able to resolve it in some way? I've tried activating a factory reset, plugging it into the computer and waiting, any number of combinations of holding the power button and volume down, volume up, etc. Leaving it charging overnight on the original cable, a new cable, verifying the cables work, that the adapter works, trying a different adapter. The only response is an occasional flash of the start-up sign; and it is just a flash. Finally, no, there is no external physical damage, I've never introduced the phone to water nor dropped it. The last application I was using was Google Chrome and it was causing the device to completely freeze and eventually reboot most of that day; one time it just never turned back on. \n\nSecond question, is this level of customer service acceptable in any way? The phone is barely two months old and has had consistent software issues regarding its battery. I've had the issue where every time you plug it in you need to change permissions on how the usb cable is used (by the external source or this device). Now Google has been quite the opposite of helpful. I've spoken to more than 6 people regarding this issue; a new person replies to my email every day. They demanded a physical copy of my receipt, a digital invoice containing the same information wouldn't work, inexplicably. I've attached the email chain. Notice it took me two days to find time to go to Bestbuy but that every subsequent email reply from google took around 24 hours. If this were an eBay seller you'd consider them untrustworthy. I also asked them; if you need a physical receipt as opposed to a digital one how do you suggest I take a photo when the issue we're talking about is that the device that powers my camera doesn't work. The reply: get an alternate device to take the photo. I'd love to attach that chat log but they wouldn't send it to me.\n\nFinally, having allegedly now authorized a full-price charge for a refurbished device on my credit card are there any real protections in place for me if/when Google decides my device might not have been as defective as warrants a full replacement? One bit of information I seem to remember is that I could've brought it in to one of their repair specialists which I'd figured, living in the Bay Area, wouldn't be much of a hassle. Unfortunately in the time it would've taken me to drive to their repair specialist I could've been on their headquarters' front door an hour away in Mountain View. At the end of the day here I'm now out now more than two weeks without a phone with no guarantee this won't cost me either the full replacement cost, my warranty with Bestbuy (if I show up to claim my warranty for physical replacement with them and the phone's IMEI doesn't match then what?) and zero options to access any of the texts or other information being sent straight there. Never thought I'd say this but at least Apple has that feature.\n\nUltimately this has been absolutely ridiculous, my last questions is: would a refund still be possible at this stage?\n\nThanks.\n\n\n ",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-01-20T17:51:41.689554+00:00",
    "reply": "0 Replies"
}