{
    "url": "https://support.google.com/pixelphone/thread/80588880/call-screening-is-broken-in-pixel-3a-android-11?hl=en",
    "title": "Call Screening is broken in Pixel 3a Android 11",
    "content": "Call Screening is broken in Pixel 3a Android 11. Prior to the \"upgrade\" to Android 11, call screening was beautiful. When an unknown number rang me, I was able to optionally press the Screen Call button, and the call was immediately answered by the call screen recording. If the caller spoke anything, the words were transcribed and posted to my phone interface, and I could optionally choose to answer.\n\nAfter \"upgrading\" to Android 11, this feature is completely broken. When an unknown number comes in, I have 3 options:\n\nAnswer\nScreen\nDecline\n\nSo far, so good. I press Screen. But instead of the pre-recorded message being given to the caller (and listening for words, which is then transcribed for me to read), it actually ANSWERS THE CALL, and the caller can immediately hear me. This is not only ANNOYING but also EMBARRASSING. Even worse, it won't let me hang up. Clicking the red hangup button does nothing, at least not for some time. \n\nHere's what I see on my phone screen AFTER pressing the Screen button while my phone is ringing:\n\n\n\n(And at this point I can hear the other person and they can hear me...)\n\nHow can such a bad bug have made it through testing??\n\nHere's a forum post showing that many others are having this same issue:\nhttps://support.google.com/pixelphone/thread/70153876?hl=en\n\nHere is what I have tried so far:\n\nrestarted phone\ncleared phone cache\nrestarted phone again\nturned off call screening (all related options)\nrestarted phone again\nturned back on call screening (all related options)\nupgraded to Phone Beta (56.0.338781849-publicbeta(6503144))\nrestarted phone again\n\nStill broken, just as described above. Please help.",
    "is_img": 1,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3a",
    "post_time": "2020-11-02T17:50:13.331212+00:00",
    "reply": "2 Replies"
}