{
    "url": "https://support.google.com/pixelphone/thread/5674233/introducing-the-pixel-3a-pixel-3a-xl?hl=en",
    "title": "Introducing the Pixel 3a & Pixel 3a XL",
    "content": "Hi everyone,\n\nWe're excited to announce the newest additions to #teampixel: meet the Pixel 3a & Pixel 3a XL.\n\n\n\nGoogle Pixel 3a delivers what you’d expect from a premium device. A camera with Google’s HDR+ technology, a custom built Titan M chip for industry-leading built-in  security, and 7 hours of battery life on a 15-minute charge*. The Pixel 3a has a 5.6 - inch display and the Pixel 3a XL comes in a 6-inch display.\n\nTo learn more about the ideas and innovation that went into our newest Pixel check out our blog here, and find the tech specs here.\n Both devices are available in select countries in Google Store.\n\n\nCheers,\nGoogle Pixel Support Team\n *Approximate battery life based on a mix of talk, data, standby, mobile hotspot and use of other features, with always on display off. An active display or data usage will decrease battery life. Charging rates are based upon use of the included charger. Charging time performance statistics are approximate. Actual results may vary.\n Pixel 3a FAQs\n Where can I order the device?\nPixel 3a and Pixel 3a XL will be available  starting today in the US and for sale via the Google Store,  Google Fi, Verizon, T-Mobile, Sprint, U.S. Cellular, Amazon, Costco and Best Buy in the US.\n\nCountry availability\nThe Pixel 3a and Pixel 3a XL will be available in the  US, Canada, the UK, Ireland, Australia, India, France, Germany, Italy, Spain, Singapore, Taiwan and Japan. To see a full list of countries where the Pixel 3a and Pixel 3a XL are sold, please see our country availability page : https://goo.gl/Qf2cBQ\n\nWhat are the storage and color options?\nThe Pixel 3a and Pixel 3a XL will come in 64GB and will have color options of Clearly White, Just Black, and Purple-ish.*\n*Some retailers may not stock all colors. For a specific color, try the Google Store: https://goo.gl/tKECGs  \n How much does it costs?\nAll details on pricing in selected markets can be found at the Google Store.\n\nWill this work in my country on my carrier?\nWe recommend you check with your carrier to ask if it works with their network. Devices bought on the Google Store will be unlocked.\n\nWhat are some of the hardware details?\nYou can find all of the Pixel tech specs here: https://madeby.google.com/phone/specs/\n\nWhat software will come shipped on the device?\nPixel 3a and 3a XL will come with the latest Android Operating System, Android 9 Pie.",
    "is_img": 1,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-05-07T19:18:31.122038+00:00",
    "reply": "58 Replies"
}