{
    "url": "https://support.google.com/pixelphone/thread/18021121/haven-t-got-any-response-since-3-months-from-google-after-speaking-to-them-thrice?hl=en",
    "title": "Haven't got any response since 3 months from google after speaking to them thrice",
    "content": "Dear Sir/ Madam,\n\nThis is Disha Gandhi based (India).I am using a Pixel 3 phone. I got this phone from Canada and I got a charger with it.However I also bought a new charger as per India usage from Flipkart (original googlecharger). The charger stopped working suddenly within few days and then I contacted Google support and they said they will help resolve this issue and give a replacement of a new charger.Its been more than 2 months and I have been given an solution on the charger yet.After that I tried calling thrice and spoke to the Google support team but again they said they will call in 24hrs with a solution but since then I have just been getting an autogenerated email from the Google support email I'd saying that the issue has been escalated and we are trying to resolve the query.  \n\nI am extremely disappointed with this service and shocked too as didn't expect of such a poor service from google .first time I bought a pixel phone and this is what I experience. In US people have issues with their phone and they get a new phone in return.here I am unable to even get a response for a replacement of a charger.\n\nAlso I bought this phone in June. It has a lot of heating issues..the heating issue is always there.not just while charging the phone but while talking on the phone too.its very scary as it heats up a lot.\n\nI need a response to this email within 24 hrs now without any auto generated email saying the issue has been escalated(have been getting that email almost every second day since 2months now).untill now I have been requesting and being patient but it's way too long for such a big company to respond.\n\nI would need a replacement of the phone and the charger too.\n\nAwaiting a response at the earliest.\n\nThanks & Regards,\nDisha Gandhi",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-10-29T16:14:15.292096+00:00",
    "reply": "0 Replies"
}