{
    "url": "https://support.google.com/pixelphone/thread/69861931/introducing-new-pixel-first-features-with-android-11?hl=en",
    "title": "Introducing new Pixel-first features with Android 11",
    "content": "In September, we’re dropping new features for Pixel along with Android 11, including updates that help you control your media, organize your apps, and make it easier to communicate with friends and family. The features will begin rolling out to Pixel devices starting on September 8th and will roll out in stages over the next two weeks*[1].  Update to the latest Android version and update your Android apps to receive the latest features. Once updated, look out for a notification from the Tips app to learn more about all of the ways your Pixel just got better. \n\nFind your friends with Live View\nYou can now use Live View with Location Sharing in Google Maps to easily meet up with friends IRL*[2]. If your friends have chosen to share their location with you, simply tap on their icon and then on the Live View button on the right side of your screen. You’ll see where they are in relation to you, along with how far away they are. Tapping on “Start” will then show you arrows and directions placed right on top of your world so you can see exactly which way to go.\n\nSmart Replies in Gboard\nThe new Smart Reply on your Pixel’s keyboard makes typing effortless by giving you helpful responses when you’re using chat apps*[3]. And it’s all processed on your phone to protect your privacy.\n\nBetter productivity with Overview Actions\nYour Pixel will also give you more convenient ways to select text and images, or take a screenshot with the new overview actions. So whether you’re copying and pasting, saving or sharing the content you want, you’ll have more options over how you select and engage with content on your Pixel. \n\nOrganize your apps with Smart Folders\nMake your Pixel as unique as you are, starting with your home screen. Now, your Pixel can help organize your phone with new intelligent suggestions for folder names. Quickly group apps by theme, like Photography, News, Navigation, Fitness and more. \n\nApp suggestions at the right time\nNow your Pixel can make app suggestions based on your daily routines, so you can quickly get to tools you need, when you need them. Your phone will recommend apps you use at different times of the day, like Messages for your daily check-ins, Google Maps for your afternoon stroll, or the media apps you use in the evening to help you wind down from a busy day. \n\nPixel x Android 11\nIn addition to the new features coming to Pixel first, you’ll also get all of the great new Android 11  features as well, giving you easier ways to help you manage your conversations, connected devices, privacy, and much more. \n\nAndroid 11 begins rolling out to Pixel devices today; learn more about all of the Android 11 updates here. \n\nSummary of Availability per Device (Table):\n\n\n----------------------------------------------------------------\nDisclaimers\n*[1] Your Pixel phone will receive feature drops during the applicable Android update and support periods for the phone. See g.co/pixel/updates for details.\n*[2] Not available in India. Requires up to date Google Street View imagery, a working data connection and bright outdoor light. Maps and navigation may not be available in all areas. See g.co/maps/locationsharing for more details.\n*[3] Available in English only. Requires use of Gboard. Not available for all chat apps.",
    "is_img": 1,
    "category": "Other, Google Pixel 4a",
    "post_time": "2020-09-08T17:11:33.434979+00:00",
    "reply": "0 Replies"
}