{
    "url": "https://support.google.com/pixelphone/thread/1221285/escalation-rma02018176-how-to-get-my-phone-back-from-google?hl=en",
    "title": "Escalation: RMA02018176 How to get my phone back from google",
    "content": "To management of support team \n\nI am writing this email to escalate the issue of the RMA number in subject where I have chased with around 10+ emails and 5+ hours on the phone and I still have no idea where my phone is.\n\nThis is customer service at its worst and the apathy displayed by people responsible for this group leads me to believe that I have now lost my phone and will soon be lodging a legal complaint for theft of my property.\n\nI am summarising all the actions till date below:\n\n1) I called google support on 5th Jan for battery issues on my Pixel 2, where I was told to return the phone for replacement. I explicitly asked the customer service representative what is the turnaround time and I was told it is 10 calendar days from the date of my sending the phone\n\n2) I promptly sent the phone on 7th Jan and it was received at your Poland centre on 14th Jan\n\n3) I then sent an email to ask when would I recieve my phone which was followed by multiple emails to which I got the reply that the team is investigating where the phone is.\n\n4) I subsequently followed up on Sunday morning over a call where the customer service representative told me that the phone was parcelled with the incorrect postcode. This is after the same agent asked my post code as a secuity question to access my account.\nI was promised by this agent a callback and unfortunately I did not get any callback but an email stating that they are investigating and trying to get it in touch with the Internal team\n\n5) I agin called up in the afternoon where I was put on hold for 50’ post on which I was told that the SLA is 10 working days from the day google received the phone and I shouldn’t be complaining. I told the customer service agent that this is contrary to what was told to me and I emphasised that I am losing money on these calls\nThe agent promised me a callback by 3pm on Monday and again there was no call\n\n6) I again sent a follow up email on Monday, the 21st with no reply\n\nI am deeply saddened to be harassed by Google and strongly would discourage people to use Google hardware products, given the appalling level of customer support",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-01-22T22:13:37.048149+00:00",
    "reply": "12 Replies"
}