{
    "url": "https://support.google.com/pixelphone/thread/1990470/after-waking-apps-respond-to-touch-but-the-screen-remains-unchanged-until-app-tray-is-opened?hl=en",
    "title": "After waking, apps respond to touch but the screen remains unchanged until app tray is opened.",
    "content": "I'll try to describe this as well as I can. Sometimes after waking the phone, it will show whatever was on screen when the display was turned off, which sounds normal enough so far. But if I touch the screen, the image remains the same while the phone still registers the touch.\n\n(*This bug does not occur when using pattern, pin, or fingerprint lockscreens, but I'm not in many situations where I'm in fear of my phone falling into the hands of someone else. And to be honest, I just hate having the extra step of typing a pin or taking off my winter gloves to use my fingerprint.)\n\nExample:\n• The screen is on. I open Spotify to play a song, let's say \"Thrasher\" by Neil Young; Spotify starts playing the song, and all of the visuals in the app change to reflect this.\n\n• I turn the screen off when the the time elapsed reads 0:01, the album artwork is shown, and the app says that \"Thrasher\" is playing.\n\n• I wake the screen briefly to turn shuffle off: the shuffle button goes from green to grey, the seek bar has moved a bit, the time elapsed now reads 0:05, everything's working normally.\n\n• I turn the screen off for the second time since opening Spotify.\n\n•After listening to a few songs, I get to one on the playlist I would like to skip, say \"Heart of Gold\" by Neil Young from a different album.\n\n• I wake the screen for the second time since starting Spotify, and the app still shows the old info: time elapsed of 0:05, the seek bar remains motionless, and the album artwork is for \"Thrasher\" instead of \"Heart of Gold.\" Even if I wait several seconds (as in, over thirty), the issue still persists.\n\n• I tap the next song button, Spotify advances to the next song, but the display remains exactly the same, \"Thrasher,\" five seconds, etc.\n\n• I tap the shuffle button, it remains greyed out on the screen, but the next song is indeed from a random spot on the playlist.\n\n• To fix this, I use the app tray button to switch to a different app or just return to the home screen.\n\n• After doing that, I switch back to Spotify, and the app now works as intended. The correct song is displayed, the seek bar is moving, the shuffle button lights up / greys out whenever it's tapped. All that stuff.\n\nI've been putting up with this since updating to Android Pie. It's very annoying, and was even dangerous when it used to happen while using Google Maps, although that has thankfully stopped.\n\nI've noticed it happening mostly with Spotify, but it happens in other apps:\n• the home screen\n• the Contacts app\n• Gmail\n• Keep, by Google\n• Google Play Music\n• Google Photos\n• To-Do, by Microsoft\n• Libra, a weight tracking app\n• Facebook\n• Twitter\n• Awful, an app used to browse the forums on Something Awful\n• VLC Media Player\n• again, Spotify\n\nThese apps just show a black screen until switching from and then back to the app\n• Freecell, by mobilityware, while running in portrait or landscape display\n• Noten Riichi Mahjong, while running in landscape\n\nApps in which the bug does not seem to occur:\n• the text messaging app\n• the Clock app\n• the Phone app (the recent calls list; I have not tried to recreate the bug during an actual call)\n• Facebook Messenger\n• WhatsApp\n• Podcast Addict\n• Reddit\n• YouTube\n\nThe problem seems to occur / not occur regardless of whether the app is third- or first-party. And while my \"sample size\" isn't particularly large, apps seem to be affected more often than not (13 to 8).\n\nI'm normally pretty good at troubleshooting, finding what I need to know through search engines. But the problem is just so... I guess finicky? It's been difficult to describe concisely, so the only results I get are essentially for totally unresponsive screens, a lag-upon-waking bug specific to the Pixel 2 XL, or just phones freezing.\n\nI tried un/reinstalling apps, but it's done nothing to help.\n\nI have not tried a factory reset because I've been hoping that this is a known problem with a less drastic solution. And at this point, I don't know which would be the bigger headache—living with the problem until it somehow fixes itself, or having to lose all of my data.\n\nThank you for reading. I know it was a lot.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-03-02T18:13:22.010479+00:00",
    "reply": "1 Reply"
}