{
    "url": "https://support.google.com/pixelphone/thread/48130390/how-can-i-delete-my-photos-files-before-sending-pixel-4xl-for-warranty-no-factory-reset-available?hl=en",
    "title": "How can I delete my Photos & Files before sending Pixel 4XL for warranty- No Factory Reset Available",
    "content": "This morning I found my 2.5 months old Pixel 4XL (New - not refurbished) dead when I woke up. I plugged the charge cable and switched it to Do Not Disturb before going to bed last night as usual. In the morning, the screen was black, and there was no response to any of the proposed solutions through Google Support pages (tried turning it on in recovery mode, charging with 2 different genuine cables and adapters, one seprate USB charging/surge protected port, connecting to PC, trying to find out if the screen was off, removed case, checked charge port for any debris, etc - you name it, I did it!) Let me add that it didn't have any issues prior, nor had any physical damage. Actually it looks like it is brand new because I was taking care of it very carefully. Always charged through original accessories and through a surge protector. So this was a total shock!\n\nSince it was only bought 2.5 months ago, I decided to send it back for warranty repair and/or replacement. But I don't want my personal files and photos to be seen during the repair. Since I am not able to turn it on in any way, I just cannot reset to factory settings and erase data. \n\nI know that I can sign out from my email and Google account on my computer, but it won't make a difference for the already downloaded photos and files which would be in the phone in any case. \nI am worried that if anybody manages to turn it on and connect to a computer via USB, they would be able to download these files from corresponding folders. Because, just like anybody else, most of my photos were already in the storage of the phone (though most of them were backed up, a copy of them are physically in the phone when not reset)\n\nIs there any way to erase these data (downloaded photos, screenshots, files, business invoice pictures, etc) and make sure that it won't be accessible to any technician when the phone is repaired? \n\nThanks.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2020-05-21T00:26:49.911459+00:00",
    "reply": "4 Replies"
}