{
    "url": "https://support.google.com/pixelphone/thread/1919392/pixel-3-corrupt-boot-sector-after-monthly-updates-5th-time-rmaed?hl=en",
    "title": "Pixel 3 Corrupt Boot Sector after Monthly Updates, 5th Time, RMAed",
    "content": "After every monthly update on Pixel 3 XL Android 9 Pie phone crashes and never recovers without factory reset. Android 9 is supposed to have a new update system that is seamless which probably at fault.\nThis has happened 3 times now: \n\nNov 5th   - Purchased Phone Early November\nNov 16th - Android update causes storage to corrupt 9.0.0 (PQ1A.181105.017.A1, Nov 2018)\nDec 12th - Android update causes storage to corrupt 9.0.0 (PQ1A.181205.006.A1, Dec 2018, Docomo)\nJan 26th - RMAed device\nJan 29th - Received replacement device performed initial updates requiring restarts\nFeb 26th - Android update causes storage to corrupt 9.0.0 (PQ2A.190205.001)\nEdit: \nFeb 27th - Contacted Google Support regarding the issues and spoke with a very helpful representative.  After speaking with Engineers highlighted that it may be developer options causing the issue. She advised to disable auto-updates under dev options, then once an update is available disable developer options, update and re-enable them.\nMar 4th - Notification of pending update, was on vacation so waited.\nMar 18th - Successfully updated following instructions. Disabled auto-updates planned to rinse and repeat. \nMar 23rd - Android update causes storage to corrupt 9.0.0 (PQ2A.190305.002, Mar 2019)\nMar 26th - Contacted Google Support again after corruption, evidently the problem was fixed but somewhere after the update the phone autoupdated even with the option disabled in developer options. This representative was much less helpful in identifying the error (Android Recovery) and did not attempt to resolve the issue simply RMAing the device AGAIN.\nMar 26th (2) - Contacted Google Support again unsatisfied with the previous support agent. This go round was complete turn around quickly identified the problem and highlighted the OTA update regarding this fault.\nApril 5th - Android update RESOLVES Issue including change-log notes regarding OTA Failure. No Corruption. \nMay 14th - Android update pushed to phone. \nMay 17th - Android update causes storage to corrupt 9.0.0 (PQ3A.190505.002, May 2019)\nMay 17th (2): Contact Support provided previous case number. Explained how bug reports are not possible given that it corrupts the whole boot sector. Finally offered RMA replacement. I explain that I do not believe it is hardware issue and would like to have this issue escalated. Offered call back once Tier 3 (higher) was available.\nMay 18th: Finally receive call back, again deny RMA replacement and explain that this ridiculous. Put on hold disconnected. Finally, receive call back put on hold, disconnected. The third call was from Alan direct from Tier 3 support. Alan was much more sympathetic and apologetic regarding the issue. He offered an RMA Replacement and so I asked him well being technical support can you explain what new hardware is going to do to solve my issue. He explained that unfortunately it's the only route at this point, BUT that if it did happen again after the 2nd RMA I would most likely be eligible for a full refund for the device. Device will be RMAed and replaced pending the order.\n\n\nAndroid Recovery\ngoogle/crosshatch/crosshatch\n9/PQ1A.181205.006/5108886\nuser/release-keys\nCan't load Android system/ Your data may be corrupt. If you continue to get this message, you may need to perform a factory data reset and erase all user data stored on this device.\n\n\nPrevious Experience:\nhttps://www.reddit.com/r/GooglePixel/comments/9xby39/pixel_3_xl_failing_to_boot/\nhttps://www.reddit.com/r/GooglePixel/comments/a5mxqt/pixel_3_xl_corrupting_itself_second_time/\nhttps://forum.xda-developers.com/pixel-3-xl/help/pixel-3-xl-failing-to-boot-t3867497",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3 XL",
    "post_time": "2019-02-27T21:23:36.600963+00:00",
    "reply": "21 Replies"
}