{
    "url": "https://support.google.com/pixelphone/thread/59050438/is-pixel-support-the-worst?hl=en",
    "title": "Is pixel support the worst?",
    "content": "11 months have gone by and i don't have enough life span left to detail all the lies Google pixel has fed me. \n\nI want to know is Google pixel support the worst in the users opinion?\n\nPhone. Gets hacked.  I don't feel comfortable using a Google phone anymore.  They leave me with it and begin investigating. Lie, after lie, after lie occurs until 11 months later my case is closed without anyone informing me of such. \n\nA week or two after it's closed I'm asked by support why I'm complaining about a case that's already been closed. \n\nNext day supervisor emails me and states my phone is not hacked bc it has chip x and chip y there fore the phone can not be hacked. \n\nNobody will answer why it took 11 months to conclude what u could have concluded on day one. So when I brought this to the supervisor attention, along with having their department investigated , my case was magically reopened and raised to the highest team. \n\nThe \"highest team\" is then emailing me askiing me day one questions and asking me to submit stuff I've already submitted. It's almost as if there was no case or file created in The first place. \n\nI still haven't heard back from the so called higher team.   \n\nI continue to be lied to.  I continue to have a phone that is comprised  and I continue to have agents disconnect chats when they can't answer a rough question of just don't want to   \n\nThe entire time mind you, my device has been compromised and my identity and privacy at risk. \n\nThey took no steps to secure my personal privacy or security while investigating my phone. They left me hanging.  I'm still hanging.  \n\nIt's getting worst as now they simply ignore any question they do t feel like pro using an answer to or make up excuses like my case is escalated. Like today, I chatted in without any open case and that's what they told me to start lol. \n\nOh wow. Isn't Google pixel  the word?",
    "is_img": 0,
    "category": "Device Performance",
    "post_time": "2020-07-15T07:26:04.535746+00:00",
    "reply": "2 Replies"
}