{
    "url": "https://support.google.com/pixelphone/thread/100315063/from-the-seas-to-more-zzz%E2%80%99s-your-new-pixel-features?hl=en",
    "title": "From the seas, to more zzz’s: your new Pixel features",
    "content": "We regularly update your Pixel so that it's even more helpful, and even more unique. This latest drop includes the ability to easily access and share Recorder transcriptions, a new way to use the Pixel Camera app underwater and new wallpapers to celebrate International Women's Day. \n\nThe features will begin rolling out to Pixel devices starting on March 1st, continuing in stages over the next two weeks*[1].  Update to the latest Android version and update your Android apps to receive the latest features. Once updated, look out for a notification from the Tips app to learn more about all of the ways your Pixel just got more helpful. \n\nA more shareable Recorder.\nYou can now share links to your Recorder files, allowing anyone to hear recordings and see transcripts at recorder.google.com, even if they don’t have a Pixel*[2]. You can also back up recordings to your Google Account to help keep them safe*[3].\n\nTake your Pixel under the sea.\nYour Pixel now supports the Universal Smart Phone Housing for scuba diving by Kraken Sports*[4]. Get access to your Pixel’s camera features, like Night Sight, Portrait Mode, and video, directly through Pixel’s Camera app for high-quality images of you and your underwater friends. \n\nMessaging just got easier and more efficient.\nSmart Compose is now available for select messaging apps on your Pixel*[5]. It uses machine learning to help you complete your sentences as you type, so sending and replying to messages is easier than ever.\n\nWallpapers for cultural moments.\nIntroducing a new wallpaper collection that will celebrate different cultural moments throughout the year. The wallpapers will feature work from diverse artists around the world.\n\nA more seamless bedtime schedule.\nNow when you use the bedtime features in Clock with your Pixel Stand, you’ll see a new and improved bedtime screen, along with redesigned notifications to help you ease into a great night’s sleep*[6].\n\nSummary of Availability per Device:\n\n\n----------------------------------------------------------------\n\nDisclaimers\n*[1] Your Pixel phone will receive feature drops during the applicable Android update and support periods for the phone. See g.co/pixel/updates for details.\n*[2] Transcription is available in English only. Recorder sharing requires internet connection and Google Account.\n*[3] Cloud storage requires internet connection and a Google Account. \n*[4] Works with Pixel 2 or newer phones. Requires Android R, Camera Update 8.1 (Nov. 2020), Dive Case Connector app for Google Camera, KRH04 or KRH03 Kraken Sports Universal Smart Phone Housing (sold separately). See g.co/pixel/dive-case-connector-setup for more information. Kraken Sports is a registered trademark of Kraken Sports Ontario, Canada.\n*[5] US only. English only. Not available on all messaging apps. See g.co/gboardsuggestions for details.\n*[6] Not available on Pixel 3a, Pixel 4a, or Pixel 4a (5G). Pixel Stand sold separately. Available only on Pixel phones with wireless charging capability: Pixel 3, Pixel 3 XL, Pixel 4, Pixel 4 XL, and Pixel 5.",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2021-03-01T18:11:52.00689+00:00",
    "reply": "0 Replies"
}