{
    "url": "https://support.google.com/pixelphone/thread/18349299/how-do-you-leave-google-reviews-on-google-products-i-ve-looked-everywhere?hl=en",
    "title": "How do you leave Google reviews on Google products? I've looked everywhere.",
    "content": "\"My Google Pixel 3A XL is a lemon. It's been junk since I got it. In our family plan the three of us all got the same phone. Mine almost immediately had the speakerphone break. So since you want me to elaborate, I'll tell you the effects of these features breaking.... When the speakerphone broke, I did not initially realize it, so my alarm never went off, which meant I overslept. My job didn't take it very well, which..m why would they since I just started. Great way to kick off this new career. My \"niece\" whom I pretty much raised was just moved away to Indiana, and I live in Florida. We video call to stay in touch. I love her and miss her so much. I could not video call without a speakerphone. Luckily I had purchased a Chromebook and realized I could video call her on that. I missed two weeks though. BTW my phone could not be fixed by Verizon because I was behind on my bill. I had finally had time to go to the Verizon Store 32 days after I got the phone's. My bill was $640. How that was possible is still unknown, but they eventually took off $180 that was apparently an error. That took a couple weeks. I kind of just learned to deal with it. Then I started having intermittent charging and battery issues (known issue #2 by the way) I carry multiple battery back up and chargers everywhere. I'm a single father, and for my phone to die or not work is not an option, nor is it acceptable. Known issue #3... The Android 10 update finally came, I was excited...I hoped it would fix the issues I had. Lololol, that's funny. No, instead it ran through the whole update, asked me to restart the phone then proceeded to be stuck on the boot menu and never complete the download. Now I get to look at the notification for it every day. Another little Google pixel fun fact. I've been using swipe for many many years, now all of a sudden it hardly ever works. So I finger poke the letters, and continue to get an error where it jumps leaves half a word, that's not even a word, and continues inputting jiberish over and over. That feels like a game being played on me. I use my phone for work a lot, but not now obviously. So is that elaberated on enough? So what now, if I create a ticket someone you assign it going to try and fix it, as is Verizon. If it's too bad theyll replace it with the same phone. I do not want this phone back for obvious reasons. This company has billions of dollars. You can do the right thing and take this obvious  junk phone and send me something different. Like the pixel 4 maybe.\" \n\nThat was the email I sent... When the (6 times to get the right words there) 3rd person I had the be sent to.... Asked me to elaborate. Three days go by and this is the response. Remember..I elaborated.... And there is 5 known issues, 5!! In one phone, and this is what I get....\n\n\"I'm really sorry for the delay in response. I certainly understand your situation and would like to help you with the steps that might resolve this battery issues. \nHere are some steps you can try to fix problems you're having with your Pixel phone's battery.\" Meet Jasmine everybody.... She apparently understands my situation. By the way that was it, case fucking closed. Utterly refuse to do anythng for me. So I guess all I can do is try and help as many people as I can to not buy these garbage phones. Read the message boards",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-11-02T10:02:48.769805+00:00",
    "reply": "0 Replies"
}