{
    "url": "https://support.google.com/pixelphone/thread/105192857/pixel-4a-s-rear-camera-is-broken-and-google-does-not-honor-warranty?hl=en",
    "title": "Pixel 4a's rear camera is broken and Google does not honor warranty",
    "content": "I am currently living in Korea, so I bought Pixel 4a through a friend in the U.S. in December. (He sent me the device which is he bought from the Google Store.) \n\nBut around February, the back camera suddenly died black and it didn't work. Whenever I open the camera app, only got a pop-up message telling me to turn off and turn on the app again. There was also a problem that flashlight icon was grayed out and stated in being used. \n\nI've tried all the possible solutions google mentioned in help center. also searched in the Google community and found many people suffering same issues like me, but there was no clear solution. so I finally contacted Google Support to get an RMA. \n\nWhen I contacted them, they told me my IMEI number was blocked. However, when I checked my IMEI on another IMEI checking website(even google store page), it didn't say it was blocked. anyway Google told me to take over ownership from a friend because the email account and the owner did not match, and I asked my friend to transfer. Then they asked me to start a new chat again so that they can  authenticate my device and check the ownership. I did that and waited for their response.\n\nBut all of a sudden, they responded \"We have conducted an investigation and determined that this device is not eligible for a warranty replacement/refund due to previous illicit activity. We recommend you reach out to the place where you purchased this device, as they may be able to provide you with further information.\" \n\nWhenever I asked them what kind of illicit activity I was being accused, they only send the same answer over and over. They're driving me crazy. I'm told to reach out the place I bought it from but I bought it from you Google store! who do you want me to contact?  I've been suffering for two months and losing hope... All I want is RMA with warranty.",
    "is_img": 0,
    "category": "Camera, Google Pixel 4a",
    "post_time": "2021-04-06T07:41:56.39382+00:00",
    "reply": "1 Reply"
}