{
    "url": "https://support.google.com/pixelphone/thread/20930589/headphones-keep-suddenly-popping-before-audio-stops-working-completely?hl=en",
    "title": "Headphones keep suddenly popping before audio stops working completely",
    "content": "I use headphones in my Pixel 1 daily to listen to podcasts and music. Yesterday I began having an issue where I would press play on the podcast with my headphones plugged in, but the sound would only come through the phone speaker instead of the headphones. I found that resetting the phone with the headphones already plugged in fixed this problem, and the sound would then come through the headphones as normal, but it was annoying to have to reset my phone every time I wanted to use headphones. \n\nThen, yesterday evening, I had been listening to a podcast for about 2 minutes when my headphones suddenly made a loud, painful pop, after which no sound would come out of either the headphones or the phone itself. Spotify said the podcast was still playing as normal, but no sound would play. I reset the phone again and it seemed to fix the problem, but again after 2 minutes of listening to the podcast the same thing happened: a loud pop followed by complete silence. \n\nThe issue is not with the headphones, because I tried switching them out with another pair and it still made the same pop before it stopped working. The issue is not with Spotify, because I have tested this with other apps like Audible and Youtube and the same thing happens. This morning I tried factory resetting the phone but it still isn't working properly. I have tried cleaning the headphone jack with compressed air and contact cleaner but neither has fixed it. Is there anything else I can try or is the headphone jack just plain broken? The phone still plays audio through my bluetooth speaker perfectly fine, the issue seems to be only with the headphone jack and the phone speakers.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-11-23T16:23:33.787671+00:00",
    "reply": "4 Replies"
}