{
    "url": "https://support.google.com/pixelphone/thread/1661003/pixel-2xl-display-problem?hl=en",
    "title": "Pixel 2xl display problem",
    "content": "I'm going through a weird Pixel 2xl display problem.The problem appeared at the end of Nov last year. One morning when I woke up and woke up the phone. Found out that at the edges of the display can't work properly, like the LCD is leaking. And there were grey stripes on the display. So I thought it's the screen problem, I sent it to a repair shop to repjlace the screen, not official one, cuz I'm in China, there's no way to get official help although my phone is still in warranty. But after the guy got my phone he told me it's working perfectly, has no any display problem. And he tested for days, the problem didn't happen. So he sent me back again. But after I got the phone and used for no more than 24 hours same problem appeared again and got even worse. It flashed several times and then can't show stuff at all. So I sent it to that guy again but like last time the problem just gone when it got there. And he sent me back and once again in 24 hours same problem happened. I sent it to that guy he replaced one screen from another Pixel with one green line on it, and sent it to me to see if my problem will happen to this one. And no question, after I used it for two days same problem appeared. That guy told me he thought it's not the display problem, but he didn't know what it is. So I found a second guy who guaranteed me it's the display problem and replaced a new one for me. But as I thought, same problem just appeared after hours I got it. He replaced another one and told me the first screen did have some problem, now it's almost half a month after I got the new screen. And the problem appeared now. Still same problem, can't show properly at the edges like LCD is leaking, grey stripes from left to right. Will flash if I turn it off and charge. Also, the problem seems will happen faster if I play pvz2 and make it worse. I don't know how to upload pics. It'll be more clearly to see the problem.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-02-15T15:20:48.164264+00:00",
    "reply": "0 Replies"
}