{
    "url": "https://support.google.com/pixelphone/thread/17387259/pixel-3a-sometimes-crashes-and-suddenly-restarts-when-using-the-flash-on-the-camera-any-ideas-why?hl=en",
    "title": "Pixel 3a sometimes crashes and suddenly restarts when using the flash on the camera. Any ideas why??",
    "content": "I have a Pixel 3a that sometimes has an issue when using the flash on the camera that causes the phone to suddenly shut off/reboot. Usually, it's when I try to rapidly take multiple photos using the flash (within a couple seconds of each other), but it will sometimes have the problem even when just using the flash to take a single photo. To the best of my recollection, I have not changed any of the camera settings since I set the phone up, and the phone does not have any other issues. Everything else on the phone works properly and smoothly (other than the camera not focusing as quickly and accurately as it usually does; but this is not a big deal).\n\nI don't want to have to do a factory reset, but is it possible that a factory rest might help to resolve this issue? Also, I have cleared the cache on the Camera app multiple times, but the problem with using the flash causing the phone to restart still happens sometimes.\n\nI got the Pixel 3a as a gift and don't have the receipt and don't know that I could still get in contact with the person who originally bought it. Is it possible to try to get a Pixel phone fixed under warranty, if you don't have the original receipt to provide? Or, as I suspect, am I SOL when it comes to possibly being able to use the warranty (assuming that it's still active/valid)?\n\nSorry for the lengthy post. This isn't a major issue; but it it something that is really annoying when it happens, as I have to unexpectedly wait for my phone to reboot. If anyone has any helpful information, ideas or suggestions, a reply would certainly be appreciated.\n\nAlso, has anyone else had this camera flash issue with their Pixel 3a device??",
    "is_img": 0,
    "category": "Camera, Google Pixel 3a",
    "post_time": "2019-10-22T00:28:53.754189+00:00",
    "reply": "1 Reply"
}