{
    "url": "https://support.google.com/pixelphone/thread/55705867/google-support-won-t-honor-warranty-on-my-defective-phone-i-bought-from-best-buy?hl=en",
    "title": "Google Support won't honor warranty on my defective phone I bought from Best Buy.",
    "content": "The motherboard on my Pixl 4XL phone, I purchased from Best Buy in December was found to be defective in May. On May 7, and after putting $997 hold on my card I was sent a warranty replacement.\n\nThe warranty replacement I received was stuck in \"Admin Mode\" so Google Support instructed me to return it instead using the RMA given to me for my original. I retained my original first phone and returned the replacement on May 20. After that I was told by Google Support that their RMA department was having issues and that was why no further action had been taken because of their internal issues. \n\nI continued to wait with my original defective phone for a few more weeks before escalating the issue. After only being able to communicate through chat and email, each of which was a different person and different trouble ticket, I was finally told I would get a link for a replacement to restart the exchange process.\n\nI never received the link and after asking for it multiple times, I was told that the claim was being discontinued due to \"Illicit activity\" and that I should contact my retailer.\n\nAfter multiple attempts to find out what sort of illicit activity they found, each resulting in me being told they wouldn't elaborate, I asked \"What do I tell Best Buy?\" \n\nThere was no issue with my replacement initially and, had I been sent a working replacement phone, this could have been resolved in May.\n\nI have followed Google's instructions and done what I was told in good faith only to now have my inquiries shut down and left with a bricked phone I bought 6 months ago that Google will not support.\n\nPlease Help.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-06-26T18:01:25.030206+00:00",
    "reply": "2 Recommended Answers"
}