{
    "url": "https://support.google.com/pixelphone/thread/29142854/phone-restart-messed-with-so-many-functions-on-my-phone?hl=en",
    "title": "Phone restart messed with so many functions on my phone",
    "content": "Hi all. This morning I got on Facebook using the app on my 3a. The app stopped responding, and the window popped up that asked to stop the app. I selected the option to close the app, and my phone froze on the facebook screen. In order to get out of the app, I had to restart my phone, which I did by pressing and holding the power button until the \"power off, restart, screenshot\" button popped up. I selected the restart option. It restarted and I attempted to access facebook again. The app worked, but the home button and the switch between apps arrow no longer worked. I restarted the phone again. I tried accessing Chrome, with the same issue. The app itself worked perfectly fine. I could Google things and switch between my open pages, but I couldn't use the home button or switch between apps. I googled the issue, to no avail. Some similar issues suggested freeing up space by going to settings. After freeing up space from photos and deleting apps I no longer am using, I shut off the phone and let it sit for 5 minutes before powering it on again. After powering it on, the issue persisted, this time popping up after rebooting with \"digital wellbeing app not responding.\" I restarted it again, with the same digital wellbeing message, and again. I finally restarted it and that message no longer pops up, but I still can only access one app before having to restart the phone again, and I am not able to use the swipe down menu at the top or the swipe up menu at the bottom. It has also started vibrating like notifications are coming through but no notifications are appearing. I've tried everything available to me aside from a factory reset because my phone isn't backed up to it's most recent settings. Please help.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a",
    "post_time": "2020-02-19T03:48:17.879134+00:00",
    "reply": "3 Replies"
}