{
    "url": "https://support.google.com/pixelphone/thread/8618109/any-way-to-revive-this-pixel-2-xl?hl=en",
    "title": "Any way to revive this Pixel 2 xl?",
    "content": "Hi everybody,\n\nHave a Pixel 2 XL and the other day I dropped it, and the screen went black.\n\nI took the simcard out and put it in a different phone since I couldn't do a lot of testing at the moment.\n\nBasically, the screen doesn't turn on, at all, there is no light when I plug it or when I try to enter recovery mode, nothing at all.\n\nBut I do feel the phone vibrate, if I put my finger to the fingerprint scanner.\n\nI tried putting my simcard back on and restarting, and when I call from a landline I don't feel it vibrate or hear anything on the Pixel.\n\nBut I do hear the tone on the land line.\n\nI don't remember if there was any extra steps after putting in the simcard that I had to do, which I wouldn't be able to do anyway since I don't see anything.\n\nI ordered a replacement LCD from AliExpress, but it's still the same behavior. So now I'm not sure if the issue is just the screen, or if the motherboard or something else is failing.\n\nSo after playing a little bit with the power button and volume down, I got it to show up on Device Manager, and on fastboot devices.\n\nIs there anything that I can do from this point, having access to fastboot? \n\nCan I recover files?\n\nThis is what shows for fastboot device:\n\nfastboot oem device-info shows:\n\n(bootloader) Verity mode: true\n\n(bootloader) Device unlocked: false\n\n(bootloader) Charger screen enabled: true\n\nOKAY [ 0.007s]\n\nFinished. Total time: 0.007s\n\nI have not been able to get it to show up on adb devices, maybe because it's just to navigate not being able to see anything.\n\nI noticed that if I leave the phone for a few days (which I guess ends up draining the battery), when I first plug it in, it shows a red led (static, not blinking), for a few seconds, maybe a minute.\n\nThen it goes away and even if I unplug it and plug it back, it doesn't show up again.\n\nIf anyone has any suggestions please let me know\n\nThanks in advance!",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-06-24T13:39:39.582086+00:00",
    "reply": "1 Recommended Answer"
}