{
    "url": "https://support.google.com/pixelphone/thread/10676185/others-have-delayed-orders-because-of-bug-with-pixel-3-case?hl=en",
    "title": "Others have delayed orders because of \"bug with Pixel 3 case\"",
    "content": "Ordered Pixel 3, charger, and case on July 9th. Delivery date quoted at order was July 13-15. However, two days later, it was changed to \"delayed.\" I then chatted with three different customer support agents. The first reported that the delivery date may not be delayed, and just to wait and see. The second said it was delayed but should ship soon - I am returning my old phone and wanted to be sure that the new one would arrive before the 30 days I had to return my old one for credit. The last one, who I have now also emailed with multiple times, said that there is no way to know when it will ship - and, the part I found surprising, no way to know why it is delayed.\n\nI've asked to speak with someone in management so I can understand how a company that creates algorithms that can figure when I want to buy a new phone, before I even know I want to buy a new phone, can't understand why an order is delayed. I made an assumption that they were out of stock, but again, just wondered how they are unable to tell when they will be in stock again.\n\nThe reality was even more surprising, though... I received this message a couple days ago:\n\"The reason why the order was delayed because of the recent bug for the Google Pixel 3 Case (Fog) item that cause the whole order to be affected. ..\"\n\nWhy one item would hold up an entire order, I don't understand. I mean, I do understand it would cost more to ship two packages, but having the case hold up the phone shipping is odd in 2019. Even odder, they are unable to just cancel the case part of the order. I would have to cancel my entire order and place a new one.\n\nTo add more unnecessary (in 2019) complexity to this, I had an offer code that I used, and also a credit, from having ordered the 3a a couple months ago. So, I am waiting to see if they are able to apply those to a new order, if I cancel the existing one.\n\nThe above is a lot of background to see if others have had this issue? I have not been able to find another post online about it. Or, have you heard of this?\n\nFinally, does anyone have any insight into how Google, of all companies, has such an issue with basic logistics? I don't ask any of this to disparage them, I have been a user/customer since they launched the search engine, and have shared way too much of my personal data over the last twenty years with them. It's just an honest question for me.\n\nMy assumption is that customer service is just dead across the US, at this point, but as with my assumption on my order, I am hoping I may be wrong on that.\n\nThanks for reading if you have made it this far.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-07-26T14:22:44.096812+00:00",
    "reply": "1 Recommended Answer"
}