{
    "url": "https://support.google.com/pixelphone/thread/86983419/pixel-5-in-the-netherlands-no-5g-nor-access-to-a-repair-center?hl=en",
    "title": "Pixel 5 in the Netherlands no 5G nor access to a repair center",
    "content": "I'm trying to get 2 things resolved for my Pixel 5.\n\nI'm a Belgian customer living in the Netherlands and I bought my Pixel 5 over the German Google Store at the address of my German parents in law. It is a unified Europe for your information and it has a unified consumer market. Not officially releasing your phones in one country doesn't prevent European consumer in other countries from buying your phones.\n\nThe issues rising both relate to consumer discrimination based on where we reside in the European Union. This is against the intentions of European laws concerning customer protection. Google only releasing certain types of products in certain types of countries complicates things a bit. However, Google has stores in most of the European countries and the products are also sold by other stores to customers in countries where these products are not 'officialy' released by Google.\n\nTrying to resolve the issues, I experience very poor customer service by Google. It is almost impossible to get into contact. Answers given don't resolve anything. And it takes weeks to get a reply. Hey Google, that is embarrassing.\n\nThe first issue is that I broke my screen and that I'm unable to get it repaired in a Google Repair Center over my address in the Netherlands. I'm advised to use a German address. That is quite complicated as it requires me to send the phone to my parents in law, have to ask them to send it to the Repair Center and the same route back to my home address. The transport costs are the same for Google, however I have to make extra steps. Customer service also warned me to have it repaired at a local repair shop. That would make future guarantee claims impossible. But don't worry. You don't supply the parts to local repair shops, so nobody is able to repair my screen. Can you imagine I get quite angry about this situation?\n\nThe next issue is that this phone is supposed to be able to the 5g network that I have access to. However, Google hasn't enabled the Pixel 5 for use over the T-Mobile network in the Netherlands. So please Google, make that happen.\n\nI'm struggling with these issues for weeks now. A phone that promises to be able to use 5G networks and that cannot do that and a phone that is not repairable in the country where I reside is a useless phone. I would like to see these problems resolved. If I don't get a decent answer and if these issues cannot be resolved soon, I want my money back!",
    "is_img": 0,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-12-05T12:55:11.941655+00:00",
    "reply": "1 Reply"
}