{
    "url": "https://support.google.com/pixelphone/thread/93811468/why-would-my-wifi-and-mobile-data-stop-working-at-the-same-time?hl=en",
    "title": "Why would my WIFI and Mobile data stop working at the same time?",
    "content": "I have already discussed this with a Google tech specialist, and we ended up trying all the usual troubleshooting steps including rebooting it into safe mode, trying the SIM card in another phone (it worked), resetting network settings, and, finally, a factory reset.  I  now have an appointment for a phone repair, but I just wanted to see if anyone knows what this could be and if I could get it running sooner.  \n\nI was texting my Dad when my messages randomly stopped sending.  I noticed that my wifi was turned off, and it said \"no SIM card\" under the mobile data option.  When I tried to turn WIFI back on, the toggle switch turned to the on position, but the wifi remained off.  It did not show any networks, and when I left settings and came back, the toggle switch was flipped off again.  Here's the really weird part: I went to a restaurant, and my phone displayed the song name on my lock screen (while claiming it has no network connection of any kind).  Surely Google has not downloaded a complete neural net of every song in existence to my phone: this feature must require network connectivity of some sort. \n\nMy first instinct is to think this is a software problem, but I did a factory reset... twice, so I think we can rule that out.  Next, I wonder about a hardware issue, but I would assume the WIFI antenna and the mobile data antennas are two different parts, so what is the chance they both break at the same time?  This leads me back to thinking it is a software issue.  Could it be possible that somebody installed a virus on an app I downloaded that is able to protect itself from a factory reset (or maybe hacked into my phone through other means)?  Can anyone think of any other explanations/troubleshooting tips?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a",
    "post_time": "2021-01-17T01:37:55.147825+00:00",
    "reply": "3 Replies"
}