{
    "url": "https://support.google.com/pixelphone/thread/24514964/sound-not-working-on-google-pixel-3a-xl?hl=en",
    "title": "Sound not working on google pixel 3a XL",
    "content": "Hi all, \n\nstarted having sound issues with my pixel recently (I have had it around 6/7 months). Had issues last week when my mum tried to call and I couldn’t hear her although other calls were fine so put that down to signal issues (although now not so sure). I noticed today when on instagram I was not hearing any sound from the videos.got family members to call me and I could hear my ringtone but could not hear them speak. I tried playing Netflix and Spotify and also no sound at all. \n\nLooked online and tried a few things - turned off blue tooth, put onto safe mode, hard reset, disabled google play app. One person suggested cleaning the earphone slot and I tried that and it then seemed to wrk and was able to make a call! But three hours later... no sound again! (Although I do hear my phone ring and sound when headphones are plugged in)\n\nI’ve noticed lots of posts online where others have had the same issue and I wondered if anyone else has any other suggestions?\nI have switched it off for the night and will try again in the morning.\n\nI am beginning to feel VERY fed up with this phone - I had issues after having it for about a month where it would switch off in my pocket and I would need to do a hard reset to switch it back on. I took it to EE where I got it and it was sent off for a repair after I read this was a very common fault with the phone but they sent it back to me and told me it was water damage which I didn’t believe (they didn’t even open the phone). The problem seemed to go away - I think it may have been a software issue. \n\nCompletely unreliable phone - great to use but all these problems are NOT worth it. I use it at work (I work at a field centre) and need it when I am the oncall supervisor overnight when children and students are staying on site. Very frustrated with google and EE.\n\nThank you for any help - any suggestions appreciated!",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a XL",
    "post_time": "2020-01-03T01:37:07.318597+00:00",
    "reply": "2 Replies"
}