{
    "url": "https://support.google.com/pixelphone/thread/39844583/disable-contacts-sync-does-not-work?hl=en",
    "title": "Disable Contacts sync does not work",
    "content": "I have found that with my Pixel 4XL (or maybe it's Android 10) disabling Contacts syncing NO LONGER WORKS! With my older Pixel 2 it did work, and I would manually trigger a Contacts or Calendar sync when I wanted to. I have checked and double-checked all the settings (see below)... but it still syncs without me triggering a sync.\nThe settings I make are as follows ... Via Settings -> Accounts At the bottom of the main accounts page, there is a toggle named \"Automatically sync data\" with the text \"Let apps sync data automatically\". If this \"Automatically sync data\" toggle is ON and you then select your GMail account, and press the \"Account sync\" button, you are able to edit the(Google) apps you don't want to auto-sync (i.e. turn sync OFF). I do this (I switch all Google apps to off), and return to my GMail account page. I then see \"Sync OFF for all items\" in grey text under the \"Account Sync\" button (my upper case for OFF above). I then go back up to a higher level .. that is back to the main accounts page. The toggle \"Automatically sync data\" is still ON of course, and the grey text under it says \"Let apps sync data automatically\". I don't want this to happen, so I now set this \"Automatically sync data\" toggle to OFF. Here's the problem: after making this last change (i.e. \"Automatically sync data\" toggle to OFF), when I select my GMail account again, I now see \"Sync ON for all items\" in grey text under the \"Account sync\" button(my upper case for ON above)!! This is completely contradictory! How can it be that after first disabling auto-sync on all the Google apps and then switching off \"Automatically sync data\" Google signals \"Sync on for all items\" ?!?\nAnd here's the bigger problem: the above message is correct. Because if I leave the settings as above the Contacts does indeed continue periodically auto-syncing. (I know this because if I delete one of my contacts in the Google Contacts app in the cloud after a short period the same contacts on my phone disappear too! The \"short period\" can be anything from 3 to 30 hours).\nI have tried removing my Google account and adding it again, but without success. It seems to me that this is either (a) a bug in the \"Automatically sync data\" implementation .. OR .. (b) a deliberate implementation to either check data or mislead users.\nI have also tried all sorts of variations and checked Google account settings in the cloud too (not much there!), all to no avail. It seems I cannot now disable auto-syncing of Contacts ... If somebody thinks I'm missing something help would be appreciated?",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 4 XL",
    "post_time": "2020-04-13T19:00:27.4036+00:00",
    "reply": "5 Replies"
}