{
    "url": "https://support.google.com/pixelphone/thread/95328353/the-android-12-we-want-to-see-concept?hl=en",
    "title": "The Android 12 we want to see. (concept)",
    "content": "I asked a few Pixel communities what people want to see in Android 12, and added a few iedas of my own. This is the result.\n\n\nBlur\n\nMenus look great with blur on Android 12. The power menu, notification menu, recent apps menu and bubbles now have blur, and developers can add blur to their apps, like Tap to Translate in Google Translate, using the new Blur API.\n\nCustomizable Always On (Pixel exclusive)\n\nPick between several clock styles to match your look - or your setup. Show and hide parts of the Always On display to make it more minimal, or more feature packed.\nYour Always On display style is saved as a style in Styles & Wallpapers, along with the wallpaper and color scheme.\n\nScrolling Screenshot\n\nWant to capture a long thread or webpage in one screenshot? Scrolling Screenshot allows you to do that. Take a screenshot, then open the editor to take a long screenshot.\nPress the scroll button once to scroll down, or hold it to capture everything. Double press the button to change the scrolling direction.\n\nPixel Launcher improvements (Pixel exclusive)\nDon't like At a Glance? You can now - finally - remove it from the home screen. Another long-awaited feature is the ability to move home screens around.\nYou can also choose between the Google Discovery feed and the Google Snapshot screen as the left-most home screen, or disable it completely. Changing the color and transparency of the Google Search bar is now also possible.\n\nScreen recording improvements\nYou can now enable a floating button to stop recording in the screen recorder settings, to avoid recording your notification panel.\nTo save on space, screen recording compression and HEVC recording is available too. And, in case you really want to save on space, you can lower the resolution and framerate too, down to 720p and 30 FPS.\n\nOther improvements (Pixel exclusive)\n- The whole UI has higher frame rate, and everything runs at 90hz on Pixel 4 and 5.\n- The screen resolution is automatically lowered in Extreme Battery Saver mode.\n- You can now change the amount of icons in the notification panel, up to 4x5 on Pixel 3 XL and 4 XL.\n\nAlong with Android 12, some Google apps should get an update too:\n- In addition to searching the web and apps, Search can now search files and, on Pixel, settings.\n- Photos has an all new video editor and improved photo editor.\n- Tap to Translate has been redesigned to fit in with modern versions of Android, and uses the new Blur API.",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2021-01-27T11:08:07.821619+00:00",
    "reply": ""
}