{
    "url": "https://support.google.com/pixelphone/thread/22594213/google-s-support-is-so-bad-i-m-back-to-apple-%F0%9F%98%A2?hl=en",
    "title": "Google's Support is so Bad. I'm back to Apple 😢",
    "content": "Dear Google Pixel, \n\nJust thought I'd share my experience with your Google support team and why I'm going back to my ex, Apple, because of it. Below's my story of heartbreak...\n\nFirstly as a lot of Pixel 2 users have experienced our Camera Apps just stopped working. A well known problem by Google who just decided not to fix it for us. \n\nSo still within my warranty I contacted Google (that in itself is not easy) and as there was a small crack on the back of my phone which clearly had nothing to do with the software problem of the camera they created, I was told that to use my warranty I'd need to pay £120 to have this fixed - Thanks Google, I thought you loved me for me unconditionally. \n\nI agreed as a phone without a camera is quite annoying (especially while I was visiting China at the time and 2D barcodes are everywhere). \n\nI then get an email where Google says my phone is unfixable and I quality for a full replacement. - Lucky me I'm thinking maybe this will work between us, you've inspired hope and I think we have a future! \n\nThen I keep reading and I have to pay £160 on top of the £120 I've already paid for fixing the crack they're no longer going to even fix. \n\nMy only other option is to get the old broken phone back with no repairs and no refund of my original £120. \n\nThanks Google, that's how you keep people using your phone's! \n\nWhen I walked into the Apple Store to buy an iPhone I was reminded why so many people pay the Apple premium. I was so excited I bought an Apple Watch to match my iPhone. \n\nAlready I've needed to use Apple support, it's so simple they then give you a full replacement at no charge. It's so simple Google, how you can't figure out such a basic formula. \n\nWhen I switched to Google Pixel a few years ago I was so excited. I thought I'd be a pixel user for life, thank God I didn't buy the Google Slate to go with my Pixel like I was going to. I was really excited about committing to Google for life as I liked Android and use apps like Gmail and Drive, however I'm now finding these apps are all better on Apple products anyway! \n\nThanks Google, we could have been together forever. You pushed me away and I'll now never come back. I won't be hurt like this again, my pride will not be damaged. I've found someone else who treats me right. \n\nSincerely,\nHeart broken ex pixel fan 🙁",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-12-12T00:19:55.661405+00:00",
    "reply": "0 Replies"
}