{
    "url": "https://support.google.com/pixelphone/thread/1895792/rma-disaster-with-google-pixel-3-in-europe?hl=en",
    "title": "RMA disaster with Google Pixel 3 in Europe",
    "content": "I just want to share my experience with Google support and the constant lies, delays and general misinformation regarding the RMA process in Europe.\n\nA little while back I noticed a black blob in the top right hand corner of my Pixel 3. So far I haven’t had to many issues with the Pixel 3, just some reception issues which I hoped will get fixed in a future update.\n\nI contacted Google support through chat, got a good response and sent them a photo of the blob. Google’s response was that I they could see the blob, that it probably was a manufacturing error and that I should RMA the phone. No problem, issues can happen, it’s a cutting edge device and sometimes things go wrong no issue.\n\nNow, it’s important to note that I use my pixel a lot, not only for personal use, but also for business. I have small startup which is in the Google Cloud startup programme and we do a lot of business with Google using a massive host of their products and I’ve always been very happy with the support they have given. I showcase our product to a lot of clients using my Pixel 3 as it gives the best presentation of our technology in combination with Google. So having my pixel 3 is kinda of a big deal.\n\nAs I was on holiday it took me a while to ship the Phone to Google in Poland. But I sent it on Thursday, and it arrived on Monday at 10:00 AM. So far, so good. During my chat before the RMA the support person had said it would take a couple of days to get me a new device, again, not a problem, I understand that.\n\nOn Tuesday I rang Google support just to make sure they had received my phone and that the RMA was underway. The kind lady told me that, yes they had received it and the RMA was being processed. Excellent.\n\nOn Friday I got in contact with Google again, just to get an update as not having the phone was becoming a bit of a problem and if a cross-RMA was possible. I was told, that they would get back to me. They did, on Saturday, it’s in the RMA process, will take a couple of days, no mention of a cross-RMA. Starting to get frustrated, but hey, can happen.\n\nOn Tuesday contacted Google again, what’s the status. And if it would be possible to get a cross-RMA, explaining the situation. Again, a specialist will look into it, no comment on the cross-RMA. A day later, it is still in the RMA process, will take a couple of days, no comment on cross-RMA. On Friday I contacted Google again, where is my replacement phone?\n\nA specialist will look into it, we will get back to you in 24 hours. Got a response on Saturday, it’s still in the RMA process. No comment on Cross-RMA. Sent an email back, I really need my phone back and what is Google going to do to compensate this long delay?\n\nReply, a specialist will look into this. Received a reply on Monday. The RMA process takes up to 14 business days, no mention of cross-RMA or compensation. Replied again, please answer my questions and 14 days was never mentioned before. I would really like my phone back, cross-RMA ASAP and what is the status of a potential compensation from Google?\n\nGot a reply back on Tuesday from Anthony, a manager. I will look into it, if there was something I could do, I would. No mention of cross-RMA, compensation and I’ll get back in 42-72 hours.\n\nGot another reply from another support person (Joseph).\n\nUnderstand how inconvenient it would be to wait for such longer to receive the replacement device. As our specialists team mentioned that it takes up to 14 business days to inspect the device and then send out a replacement device, you might need to wait for few more days to receive a shipping confirmation email for the replacement device..\n\nAs it's still under the mentioned timeline, we might not be able to look into the compensation option as of now. In case it crosses the mentioned timeline, I'd be able request the specialists team for the compensation. I also understand how it feels to receive emails with same message to wait again and again. I really wish I could have more information to share with you. As it's still under inspection process, I don't have much details to share with you. I'd request you to wait till you receive a shipping confirmation email.\n\nNo you didn’t mention 14 days, that’s why I’m annoyed and why aren’t answering my questions. As for the compensation, you suddenly sprung this 14 days on me and why business days? Does Google shut down for the weekend, does the search engine have 2 weekend days? Does it have holidays too?\n\nI really appreciate your patience and co-operation in this regards!\n\nNo, my patience has worn out, I’m without a proper working phone, with horrible support, no end in sight to this ordeal and franky just fed up with the whole Google experience.\n\nI’ve always been a avid supported of Google and the Pixel line-up. Using Google product professionally, Nest at home, Chromecast, Google Home, Google Home Hub, Google Home mini. But frankly, how can I recommend these products any more if the support is so poor.\n\nFor example my colleague, who is laughing at me at this very moment, had a issue with his iPhone X. Went back to the Apple store, got a brand new one right that moment. No waiting around, no sending a dozen emails and getting constant, we’ll get back to you in 24-48 hours, thank you for your patience..\n\nMight as well switch to Apple or something else, this whole episode has been a disaster.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-02-26T22:21:16.504898+00:00",
    "reply": "0 Replies"
}