{
    "url": "https://support.google.com/pixelphone/thread/89898961/google-play-services-battery-usage?hl=en",
    "title": "Google Play Services Battery Usage",
    "content": "Hello, my name is Eric and I have a Pixel 5 which I upgraded from a 3 XL and I am an advanced Android geeky user haha....I absolutely LOVE everything about it. My two biggest factors for upgrading to it are the battery of course, the RAM, and the 90 Hz refresh rate. I' not a HUGE gamer by any stretch of the imagination on my phone. I have a few 3rd party apps on my phone including Pandora, Slack (for work), and Tapatalk for Android Central forums. I have noticed that with my moderate to light usage on my phone, whenever I am checking the battery break-down usage for my battery per charge, Google Play Services in the \"show system apps\" part of the battery break-down is ALWAYS the top contender. Now, i would love for something to explain to me if this is normal or not. I mean for my 4,080 mAh battery, I am getting 1 1/2 on heavy usage  t 2 full days on my average moderate usage. However, EVERY Single full battery charge cycle Google Play Services along with Android Messages is at the top. Whenever I am not using my phone, idle time seems great; meaning that the phone is sipping battery power which is good. I am just worried that something might be wrong. I did boot my phone yesterday into Safe Mode in order to test out my OS, and it seemed to use battery a little less. I'm not sure if it's my Slack, or my Tapatalk app which could be using Google Play Services in the background. What' I've done for those two apps, is restrict background usage in the hokes of the Google Play Services battery drain being less. Is this a good idea, or is there something else I can be doing to help my phones battery out? Thank you very much for any support! I really appreciate it!",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 5",
    "post_time": "2020-12-22T12:43:18.972716+00:00",
    "reply": "0 Replies"
}