{
    "url": "https://support.google.com/pixelphone/thread/89232267/my-second-pixel-4-not-xl-is-experiencing-the-same-green-scale-discoloration-please-advise?hl=en",
    "title": "My (second) Pixel 4 (not XL) is experiencing the same \"green scale\" discoloration. Please advise.",
    "content": "After receiving my first Pixel 4 device, the screen began to flicker green discoloration. The first few times that I rebooted the phone the correct coloration came back as the Google start logo splashed across the screen. After a few seconds the discoloration returned. I requested a warranty refund and was provided one.\n\nThe second Pixel 4 device worked properly for only a few weeks. I always keep my phone in a heavy duty case with advanced protective glass. Both devices were in perfect condition.\n\nOn this second pixel 4 device the same green discoloration affects the screen at all times. Ironically while waiting for the second device via warranty, the first one began working again. Based on message board speculation that this was a hardware issue I returned the first device only to be met with a much less reliable second device.\n\nI immediately filed a help ticket with Google, but just have not had the time or patience to do another reboot. I know that modern phones make it easy to transfer data without loss, but there are still some third-party apps that I choose not to back up in the cloud which results in extensive manual backup before I can do a factory reboot. Even with that said I know that the factory reboots DO NOT EVER fix things with pixel devices. I had my pixel one until I replaced it with the Pixel 4, but during that time I went through six faulty devices!\n\nSo, am I left to simply (not so simply) backup, hard reset, request warranty device, re-backup all of the missed data since my previous reboot, receive and reprogram the new device, then ensure seamless integration of various textual and visual libraries?\n\nI know that this is sort of just the nature of having so much information at hand on our devices, but quite honestly it's embarrassing for Google as I'm constantly making excuses for faulty devices to my personal and professional contacts. It just furthers the narrative that Google is unwilling to really look out for the people who not only purchase it services, but lend our data.\n\nIt would be supremely helpful if someone at Google would simply acknowledge faulty hardware, or bad firmware, or simply unwillingness to truly develop devices that eschew the traditional standards of capitalistic planned obsolescence.\n\nIn the meantime, can anyone provide a real solution within the settings of the device that might remedy the discoloration issue?\n\nIt's a small issue in the function of the device... Except when it comes to utilizing the photographic and videographic capabilities of the device, which is my primary reason for using the Google device. \n\nProducing and sharing media, for professional and simple purposes becomes unreliable. The failings of this device continue to inhibit the ability of the device to function at its highest level. The inability for Google to provide adequate support, as they did during the Pixel 1 days, through 24/7 direct chat with professionals who are proficient in the English language and capable of providing guidance via screen share, simply adds to the embarrassment of using a Pixel device.\n\nI'm thrilled to be in the Google ecosystem. I only wish I could rely on my Pixel device to not break down so frequently. After troubleshooting my way through the pixel 1, and following the problems with the Pixel 2 and 3, I assumed that the launching of a Pixel 4 flagship phone would usher in a newfound reliability. Can you prove me right? Can anyone offer support?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2020-12-18T03:58:58.6334+00:00",
    "reply": "0 Replies"
}