{
    "url": "https://support.google.com/pixelphone/thread/13020402/pixel-3a-and-google-photos-bug-different-behaviour-in-the-app?hl=en",
    "title": "Pixel 3a and Google Photos bug / different behaviour in the app",
    "content": "Hi,\nRecently (unable to specify a timeframe) I noticed a weird behaviour in my pixel 3a + google photos.\n\nBasically, after taking a portrait, usually the normal behaviour was :\nTake portrait\nIn google photos a single 'file' was created, this 'file' groups 2 photos as a single one.\nOne of the copies is a plain photo, the second one is one with depth/ blur effect\nWhen editing the depth/ blur effect and 'save a copy' a third copy of the photo was saved and grouped with the previous 2. This means, in the Google photos gallery, you see only one picture, once you select that picture, it shows you the 3 copies available (plain, blurred, blurred and edited)\nIf you select the (blurred and edited) you were able to see the depth/ blur value you choose previously (for example blur at 90% on that copy of the picture)\n\nNow the behaviour changed and it is somehow sloppy (this steps remain the same):\nTake portrait\nIn google photos, check 2 photos grouped as a single one.\nOne of the copies is a plain photo, the second one is one with depth/ blur effect\n\nEverything fine up to this point, but then:\nEdit the blur effect in the portrait and 'save a copy'\nNow a new file is saved in the gallery, this is instead of having a single picture grouping the 3 different versions of the same pictures, now you can end with multiple 'files' in the google photos gallery, which makes it a bit messy\n\nUnfortunately this is not the worse:\nSometimes it saves it as a new file, sometimes it groups the picture with the other 2 copies\n\nAnd to make it weirder\nIn every new 'file' or version of the picture which has the blur effect edited, the depth/ blur bar will always show the value at 50%, even that version of the picture was edited and maxed out the blur/ depth value\n\nIs anyone experiencing this?\nIs this a Pixel 3a problem or Photos problem? It looks like a service problem, but wanted to check with other owners if they are having this weird behaviour.\n\nThanks for the help\nHave a great day.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-08-28T12:06:43.223595+00:00",
    "reply": "1 Recommended Answer"
}