{
    "url": "https://support.google.com/pixelphone/thread/10242940/1st-gen-google-pixel-128gb-2016-randomly-forces-shutdown-when-battery-is-under-50?hl=en",
    "title": "1st Gen Google Pixel 128GB 2016 randomly forces shutdown when battery is under 50%",
    "content": "We have the 2016 Google Pixel 128GB models. Once the battery drops below 50%, the phones will randomly shut down at any given time between 50% and 0% battery. We will plug the phones back into the charger, and after powering on, the batteries will show at up to 50% charge when plugged in, but will drop down to 3% / 2%/ 1% as soon as the cable is unplugged. We have to let the phones charge back to 100% for reliable function. \n\nWe have tried everything that Google suggests, but we have not found any permanent fix if a phone is already experiencing the behavior. It seems the only thing that worked was to get a brand new replacement phone. But this issue took about a year or two of use to manifest, so who knows if a replacement phone is even a true solution at this point. \n\nBetween my spouse and I, we have had this same issue with THREE different models of the 1st Gen Google Pixel 128GB 2016.\n\nThis issue would be easy to fix with a simple refurb replacement from Google, except they only offer a 1 year manufacturer warranty for a $750 product, and they won't accept responsibility for this major hardware defect...\n\nLuckily my spouse paid for insurance with Verizon, so we received a replacement for her 1st phone that seems to be working OK so far.\n\nI did not have insurance, so I bought an out-of-warranty refurbished unit and within a week it was displaying the same behavior. So I sent it back.\n\nI took my original phone to the Google authorized 3rd party repair center to try a battery swap. Three days passed for a supposed 2 hour repair. I called to get a status update and they admitted that even after the battery was replaced with a brand new one, it was still randomly shutting down once battery was under 50%.\n\nI asked the tech what next steps would be to fix the issue, and he said if they can't diagnose the issue, there's nothing else they can do and I would have to contact Google support. So here I am. But it seems that Google is not offering any real solutions to this issue. \n\nWhat we have tried per Google instructions:\n- boot into safe mode\n- factory reset\n- replace chargers and cables\n- request replacement device under Verizon extended warranty (only option working OK so far)\n- replace battery via approved 3rd party\n- contact Google support\n\nThe only solution offered by Google is to buy a new phone!?\n\nWe did not even finish making the monthly payments on my wife's phone before the issues began. We bought these phones brand new at launch for $750 each. Her insurance cost us another $350. I bought the refurb phone for $150. The battery replacement was $100. The replacement cables and chargers were another $40. So I have spent over $2000 on maintaining two Google Pixel phones that did not last 3 years, and are only 50% reliable. Terrible.\n\nMy phone has turned off during business calls, once in a lifetime family photos, time-sensitive moments of need, and many more unforgivable circumstances. I regret buying a Google Pixel phone because this power issue has been negatively affecting our daily quality of life for nearly a year now. \n\nI was a huge fan of the Google Pixel / Daydream / Fi line of products and I guess this is the price I paid as an early adopter. I will be going back to flip phones and a GPS because flagship phones are too expensive and risky when manufacturer warranty terms are shorter than their typical device payment plan terms. Only way this consumer exploitation will change is if the customers vote with their dollar and take their business somewhere else. \n\nI see this same hardware issue is affecting other Pixel models, even with latest gen releases. Shame on the Google Pixel team for poor communication and accountability for such a major hardware defect on multiple devices across a flagship product line.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel",
    "post_time": "2019-07-20T00:01:12.576136+00:00",
    "reply": "1 Recommended Answer"
}