{
    "url": "https://support.google.com/pixelphone/thread/16064167/bad-experience-with-google-phone-and-the-service?hl=en",
    "title": "Bad experience with Google phone and the service",
    "content": "Wow, WHAT a pathetic service from Google. I thought it was happening with me only. But after seeing many posts such as this one, now I rest assured that Google's quality of phone and service is really deteriorating. I'm a Google phone user since the Nexus Era but now Google doesn't even want to listen to their customers. So, I decided to write down this post. \n\nI'm having a lot of issues with my a year-old Pixel 2 xl (like discharging in 2 to 3 hrs, bottom speaker turns off automatically and I have to restart my phone, phone hangs (though very rarely), etc, and from my worst experience of the service of Pixel 1, I never bothered to contact the service center because I knew they are no help nowadays) but I called the customer care today to check the price of a part that needs to be replaced.  I just dropped my phone on a wooden floor that too not from a very great height, and my phone's screen got shattered like a delicate piece of a glass toy. Is it really a tough gorilla glass? Anyways, I asked the support guy to tell me the price of the new glass but he wants me to hand over my phone to the courier service of the support team for diagnosis. Really? You can't just tell me the price of the part? Not even a simple estimation? My touch screen is good and responding well, I just need to know the price of top glass so I can decide whether it is worth changing. If Google doesn't change just the top glass and If I have to change the entire display (touchscreen + glass) then tell me the price accordingly. Please, just to know the price of the top glass don't make me wait for days. If the hardware support team cannot tell me this simple thing then why they are even there? Seriously, Are you for real?\n\nFrom original Nexus to Nexus 5 to Nexus 6 to Pixel 1 and Pixel 2 Xl, My experience of Google phones is going from Wow to WHAT!!. I guess it's time to change the phone to some other good brand like Apple, at least their service is best in the class and they listen to their customers. Google charges a lot for their phones and its customer loves Google phone but Google should love its customers too. It's sad to see the quality of hardware and the service response from my beloved phone's manufacturer.",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-10-05T08:38:38.290656+00:00",
    "reply": "0 Replies"
}