{
    "url": "https://support.google.com/pixelphone/thread/28998819/pixel-2-phone-shuts-down-suddenly-when-playing-audio-or-vibrates-on-low-battery-levels?hl=en",
    "title": "Pixel 2 phone shuts down suddenly when playing audio or vibrates on low battery levels",
    "content": "Got a Pixel2 since launch with it having Android 10 installed. Since the start of this year, I've been having issues that shut down my phone at around 25% battery or less whenever I play audio on my phone speakers/alarm sounds/or sometimes a vibrate from a incoming call. Whenever it shuts down, it does sort of a like a sudden screen blackout without warning, with a few horizontal white lines in the middle; then if its somewhat >10%, it just restarts, but otherwise will stay off. I've downloaded some apps to check battery life (Accubattery), and it seems to be at around \\~65% battery lifespan (though I'm not sure if this is an accurate measurement). However, I'm now very aware of when my phone is at low percentages, and am curious to know what could be causing the audio in low percent shutdowns to occur. As for physical damage to the phone, since a year ago ,I've only had one major drop to the phone's bottom left, with it landing screen side down causing a minor crack, but all parts of the screen still touchable and usable. Not sure if this is a common occurrence among the first set of Pixel2 phones, or this is just unique to my case. I've tried battery saver and turning it on/off to no avail, and also did a full battery charge to full drain to no improvement on the audio shutdown problem. I don't want to do a factory reset yet, as i am not sure if that's the fix for the problem, and would only waste time setting up stuff again if that's nit the solution. I need some direction to look into what I can troubleshoot or if this is a hardware defect, if someone has come across this before. Any and all help on this with this would be appreciated. Thanks",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-02-17T17:35:20.169341+00:00",
    "reply": "4 Replies"
}