{
    "url": "https://support.google.com/pixelphone/thread/48357694/need-help-getting-pixel?hl=en",
    "title": "Need Help Getting Pixel",
    "content": "Does anyone know how to reach out to Google? I know we can \"Chat\" 24/7 but sometimes that doesn't work out so well. I had an original Pixel. Loved it. Took great care of it. Unfortunately the motherboard is fried. Took it to a repair shop. Checked the battery/screen and those things seemed fine. Since it was slowing down during its last day and now won't turn on or show any indication that it can be revived I am certain that is the issue. Was trying to make due with no phone. My daughter was sweet and gave me hers. The issue is I need my number since she has medical issues. Going through a ton of people to change the number and then change it back just doesn't make sense.  \n\nWas going to wait for the Pixel 4a. A phone I can afford. Getting it new is what I need. So that I can have a phone that will last a long time like my original Pixel did. Again, to save money. During this time of COVID the money saving factor is really important. Thought it was coming out on May 22nd. Then the rumor mill pushed it back to first week of June. But hearing they pushed it back to mid July or even August? I don't think I can manage that. I understand as a company they want to wait until most of the market is open and customers can run to the store to buy a new Pixel 4a but..we can all order things online. Advertising can happen when the large launch happens in August.\n\nSorry, I though I should try posting this hear. Hoping that someone who knows something might speak up or offer some helpful info.  Maybe someone knows they do plan a soft launch online. Or something through Verizon or Amazon that fokes can get the 4a early or on time.\n\nLook I'm fully prepared to be denounced and have many explain to me that this is just the way it is and I have to deal with it. \n\nHonest to god..of all the times for my phone to go buns up why the hell now? Just making it through the summer and that would have done me right. \n\nSorry to bother everyone. Let the roasting commence.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2020-05-22T02:03:05.916542+00:00",
    "reply": "5 Replies"
}