{
    "url": "https://support.google.com/pixelphone/thread/101583608/warranty-esim?hl=en",
    "title": "Warranty & esim",
    "content": "Hi,\n     My name is Sanjit. I have been filming tech review shows since last 10 years with many reputed T.V channels & off late with YouTube. All my life I have been a pure die hard apple fan & user . Although my secondary phone was android. But never Google. As it always lacked  with the trust factor but of late I decided  should give a try at least once with Google. So I got a pixel 4a but it was showing some glitches. So I called the customer service \"infact I just filled up the boxes & in return I got a call. \" The gentleman told me any pixel model apart from pixel 4xl (Soli Radar) model will be under warranty in India. So I returned the pixel 4a & asked my brother to buy a pixel 4a 5g from Dubai via Noon (the e-commerce platform) . Now after buying the phone I realised that the charger pin is not designed for indian supplies. So when contacted again with the service center (as customer care support was not active with associates coz of covid) they said sir we can't even provide paid service. Absolutely discouraging for a person who just trusted someone from Google & investment a handsome amount at the time of pandemic. Being from the tech review community I know for a fact that a lot of people want to use Google but because of their lack of trust factor they end of buying cheap chines options . This is not encouraging from Google at all. It is the biggest tech company but trust factor & encouraging people to buy it's products is not there at all. Secondly I wanted to activate the esim for (Reliance jio). Now they are also saying sir esim activation for your perticular model is not there . I mean ridiculous, I spent 3 hours there people with iphone 12 mini did it with in 30/40 mins but aspiring Google user left empty handed. Hope you understand the dissatisfaction , disappointment, Angus, frustrations in my heart for taking an unpopular decision. In the end I would urge you kindly look in to the matter & consider the fact that India is the next technical hub in the world & biggest market. Encourage the aspiring buyers towards your brand . Google is big brand in the world but lacks trust factor in India. If you buy an iPhone/Chinese / samsung phone there are loads of accessories even with the road side vendors. But you can't get a decent case even in online platforms as far as Google is concerned. I hope you understand my pain & my situation kindly give a solution to it & encourage me & others like me to repeate purchase of your products in future as well. Because I know the things that I am asking for are not big deals . Hopefully I will be provided with solutions to my problems. Regards. \nSanjit Kumar Swain \n\n  Thank you for your interest in contacting Google. Unfortunately, you've sent your email to an unmonitored email address. Please visit support.google.com for options on how to contact Google support.\nThank you,\nThe Google Support Team\nGoogle Help Center\n© Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA ",
    "is_img": 1,
    "category": "Other, Google Pixel",
    "post_time": "2021-03-10T13:04:47.341198+00:00",
    "reply": "0 Replies"
}