{
    "url": "https://support.google.com/pixelphone/thread/84760312/anyone-have-any-luck-escalating-issues?hl=en",
    "title": "Anyone have any luck escalating issues?",
    "content": "I have no mobile data available on my phone to make a call. My phone states I am in airplane mode, but I'm not. This is a pixel phone issue, not a Google Fi issue, but the Pixel support team continues to transfer me to Fi. I have spent over 4 hours now troubleshooting with the representatives just to be disappointed. Their upper tier support team actually made things worse. I can't make or receive calls from WiFi. Their service team refuses to treat this as a priority. I use my phone for work and cannot do my job. I am seven months pregnant and can't even dial my doctor or 911 if there is an emergency. This is outrageous. \n\nI have filed an FCC complaint, and am fully prepared to file a small claims suit to remedy the damages this company has caused me in my career, the time they have wasted, for the lack of service I pay for but am not provided, and for all the energy I have devoted to resolving this issue.\n\nThe customer service is awful. All I keep getting are canned responses. I'm severely disappointed with Google Fi and Pixel support. I had a situation today where I had to call my midwife and I couldn't use my phone. My husband was away so I had to go next door to ask to use my neighbors phone to call.  As I stated prior, this poses a risk to my health and safety, as well as my baby's. \n\nI need a reliable phone and service, hence why I pay for a plan through a mobile provider and have a phone which is supposedly covered by a warranty. I am not getting the service I am paying for, nor am I getting the warranty I was promised. It seems that no one within the company cares enough to resolve this issue. No one even cares enough to communicate when this will be resolved. I do understand things happen, but the communication and follow through is what counts when things do happen. Google has shown the company does not value communication or follow through. \n\nHas anyone had any luck with getting anyone to assist with issues they have caused? If so, what have you done to get their attention?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2020-11-23T05:15:17.463195+00:00",
    "reply": "0 Replies"
}