{
    "url": "https://support.google.com/pixelphone/thread/25288940/still-waiting-24-days-and-counting-for-support-to-initiate-advanced-replacement-for-a-pixel-2xl?hl=en",
    "title": "Still waiting (24 days and counting) for support to initiate advanced replacement for a pixel 2XL.",
    "content": "Currently a Google Fi customer, have been paying the device protection fee for the entirety of my life on Google Fi. This is the first time that Google has completely dropped the ball. Started the phone replacement claim on December 17th 2019, As of January 10th 2020 they still have not started the advanced replacement. The closest thing I have been able to get was six days ago they initiated a standard RMA, which is not what I am seeking. Considering they are unable to order of replacement I am extremely uncomfortable with the idea of sending my phone and waiting for a replacement as current experience suggests I will then be waiting without a phone for multiple weeks (or months.) I have chatted, I have emailed, and I have talked on the phone with support. This problem was originally escalated on December 17th It was again escalated on January 4th neither of these escalations have done anything as of today. At the moment I am using my Google fi service with a cracked pixel 2 XL screen, desperate to pay $100 and have $1,000 hold  against my card. In most situations this is not hard to do as companies tend to want you to give them money, however like the other people who have posted on this forum over the last several months. Google Fi's customer service has completely and utterly failed me to the point that after 4 years as a customer I am starting to look at other providers. If there is anything I can do on this forum or that this forum can do for me please let me know otherwise I will go back to waiting in support limbo while paying my device protection each month in the vain hope that eventually Google support will actually support me.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-01-10T23:12:20.864247+00:00",
    "reply": "1 Reply"
}