{
    "url": "https://support.google.com/pixelphone/thread/66218738/mobile-network-doesn-t-come-on-after-any-android-updates?hl=en",
    "title": "Mobile Network doesn't come on after any Android Updates",
    "content": "Weird one here.  After ANY Android updates (been happening for over a year now), my Pixel 3 XL appears to work just fine until I need to 'switch' over to 'Mobile Network'.  It won't switch over, meaning that when I leave the house (and wireless), I don't have a connection to the Internet (or anything).\n\nI go into the Network and Internet settings, click on the \"Mobile Network\" (which says Google FI under it already) and it shows that it is \"Off\" - so, I try to turn it on again.  Says \"Switching to Google Fi, but then goes back again and no connection.\n\nSo far, the ONLY way I can get it to work again (which is weird also) is to tell it to 'erase sim'.  Then, it actually gets an error message saying I can't erase it and it goes back to the \"Network and Internet\" setting page whereupon I go into the \"Mobile Network\" (which still says Google FI), and  tell it to \"Turn on\" again and then it works...\n\nI am just kind of tired of having to do this whenever an Android update comes out - especially frustrating if I just grab my phone in the morning and head out only to have to pull over to the side of the road after realizing I have no 'Mobile Network' connection.\n\nVERY strange.  When it first happened, I called support, worked with them for over an hour trying to get it to work and they said I could also swap the phone out (if was new), which is what I was GOING to do, but I thought \"better erase the SIM card before I do so\"... that's when I found this 'jury rigged fix'...\n\nAnyone else getting this kind of thing?  Were you ever able to solve it so you don't have have to go through the steps to get 'Mobile Network' working again?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2020-08-21T16:37:41.277035+00:00",
    "reply": "3 Replies"
}