{
    "url": "https://support.google.com/pixelphone/thread/7262795/pixel-3a-s-dual-imei?hl=en",
    "title": "Pixel 3a's dual IMEI",
    "content": "Today I tried to purchase a Pixel 3a from a store.\n\nOn the retail box, it shows the model is G020F and from EU Ireland.\n\nI noticed something strange on the retail box,\nthe IMEI2 and the eSIM ID info were masked by a white sticker,\nso weird,\nI asked why, and the sales clerk told me that the white sticker was already there when they purchased it.\n\nI turned on the Pixel 3a for testing, also tore away the white sticker.\n\nI checked both IMEI on some websites,\nthey seem legit and refer to Pixel 3a G020F.\n\nWhen I dial *#06#, it showed the Device ID instead of IMEI.\n\nIn \"About phone\", it showed only one IMEI,\nwhich is the IMEI1 shown on the box not masked by sticker,\nand could not find another one anywhere,\nlooks like the second IMEI doesn't exist on this phone.\n\nIt looks really weird, as far as I know, except the Japan version with FeliCa,\nPixel 3a should have one IMEI for physical SIM and another IMEI for eSIM?\n\nIn the end, I didn't buy that phone.\n\nI wonder if that is a normal Pixel 3a? or a ripped version? or a special version for Ireland?\nor the second IMEI will not be shown up or available until updated to Android Q?\nor it is normal that the IMEI2 and the eSIM ID are masked by a sticker?\n... or a fake phone with reused real package box? :(\n\n--- Update ---\n\nHere is the picture of the retail boxes from the store where I tried to purchase a Pixel 3a.\n(The picture is not taken by me but the store instead)\n(I forgot to take pictures when I was purchasing, only copied down the IMEI1 and the IME2 on the retail box)\nhttps://imgur.com/oMcvNng\n\nFor comparison,\nI found many sample pictures of Pixel 3a retail box on the Internet,\nsame G020F models from EU Ireland,\nnone of them are masked with a white sticker which intended to hide the IME2 and the eSIM ID weirdly.\nhttps://imgur.com/wznw2go\nhttps://imgur.com/OfqgKAM\nhttps://imgur.com/j1oFjBw",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-06-02T10:48:58.148151+00:00",
    "reply": "0 Replies"
}