{
    "url": "https://support.google.com/pixelphone/thread/11662385/loud-weeping-sounds-when-in-call-when-someone-talk-to-me-but-i-cant-hear-it-on-my-end?hl=en",
    "title": "Loud weeping sounds when in call, when someone talk to me but I cant hear it on my end....",
    "content": "Same as Tanya said in other post:\n \" I have a Pixel 2 and about a week ago my partner said he could hear beeping on the line. I dismissed it but as of today 5 people have said the same thing to me that they hear random beeping every 10 to 20 seconds when they are speaking to me. It is not me accidentally pressing the screen, as it happens also when I use speakerphone. It happens when I am the caller or call receiver and I cannot hear the beeps. Has anyone else come across this before? I have had this phone almost a year but has just started. Thanks\" \nSo my problem is same and It seems no one is actually replying with anything useful. Hoping to grab someones attention and maybe find a solution for this. Tried making calls with iPhone device, Android Device and Landline same problem random loud beeping sounds. Have no idea whats going on and they are definitely not caused by my or theirs apps or notifications.... On the edge to switch to iPhone and as Android only user that says something... I do like Pixels and Google Eco system in general but I will not think twice this time. Enough of this already. Every new phone, software update, Android version update is full of bugs and hidden and later discovered problems. Sometimes we see them before we give you money but sometimes its just so stupid that makes me question my own decisions with Android.... BTW i saw some people are recommending turning off BT or NFC or Safe Mode and then playing inspectors and searching for \"ROUGE\" apps. Are you serious I want to use features that I have bought and I do think that \"Rouge\" apps are not end users problem, IT IS YOUR APP STORE not ours and if there are \"ROUGE\" apps then it is definitely reason to leave this OS behind even with iPhones stupid Notch...",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 2",
    "post_time": "2019-08-09T22:20:15.718871+00:00",
    "reply": "3 Replies"
}