{
    "url": "https://support.google.com/pixelphone/thread/3644145/refurbished-google-pixel-2-will-read-sim-cards-but-wont-get-any-service-or-bars-with-active-sim?hl=en",
    "title": "Refurbished google pixel 2 will read sim cards, but wont get any service or bars with active sim",
    "content": "So, I bought a Google pixel 2 that is claimed to be unlocked from amazon. It is refurbished.\n\nWell, long story short, I went to AT&T to get service for the phone. I signed up for their prepaid 8gb plan. The guy set me all up and everything.  But the problem is, the phone will not connect to the network. It says I have no bars,  and when I try to make calls it says to turn off airplane mode, yet airplane mode is not on. \n\nThings I have tried : \n\nTaking the sim out and cleaned it. No fix.\n\nUsing a different sim from a boost phone. This worked, of course it wouldn't let me use the service because my IMEI wasn't on the boost account.  But it read the sim and tried to configure network. So I know it can read sim cards. I did try to put the IMEI on the boost account and it said \"this phone isn't eligable for swap\" or something like that. Hmmm.\n\nI have tired factory resetting. Wiped it clean. Still no luck . \n\nThe att worker said the IMEI and the apn were correct, but I suspect he may have made an error. Because this doesn't make any sense.\n\nI have done *#*#4636*#*# and checked mobile radio on. It didn't change anything. I have also looked at preferred network type and it says unknown.\n\nIf I go into sim status, it says :\n\nNetwork unknown\n\nPhone number on sim unknown\n\nMobile network state disconnected\n\nService state radio off (even though I've checked mobile radio on)\n\nSignal strength 0\n\nMobile voice network type unknown\n\nMobile data network type unknown\n\nRoaming not roaming\n\nEID unknown.\n\n\nThere is also no option in the phone for Wi-Fi calling. \n\nIf I do *#*#4636*#*# I get this info:\n\nSet preferred network type : it gives me dozens of options, but when I restart the phone to apply the change it just goes to unknown.\n\nIf I run a Ping test all 3 categories pass.\n\nSmsc refresh and update both bring up refresh error.\n\nThere is a button that says toggle DNS check and next to it it says 0.0.0.0\n\nCall info refresh rate just goes back to disabled no matter what I set it to.\n\nPlease help me. I'm on my way back to att now to try again. \n\nI am a huge stock Android enthusiast and it is crushing to think that this phone might not work for me.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-04-05T18:20:17.189146+00:00",
    "reply": "0 Replies"
}