{
    "url": "https://support.google.com/pixelphone/thread/97173531/do-pixels-follow-a-different-standard-for-wired-headsets-with-buttons?hl=en",
    "title": "Do Pixels follow a different standard for wired headsets with buttons?",
    "content": "I recently bought the SoundMAGIC E11C, which is an in-ear headphone with a mic and 3-button controls. The headphone works fine except for one problem - pressing the volume up button on the headset remote triggers the Google Assistant for some weird reason. Just pressing it once is enough. Instead of the volume increasing, Google Assistant is triggered. I disabled Google Assistant and then tried again. Volume up button just does not do anything.\n\nI tried out the headset with 2 other Android phones. The buttons worked perfectly fine. I even tried them out on a laptop and the buttons worked fine there as well. So, I could definitely rule out the possibility of a defective pair of headphones. I had an older model from SoundMAGIC called the E10C. The E10C buttons work fine with my Pixel 4a. So, it is not a defective jack on my phone either.\n\nBasically, it boils down to a compatibility issue with the Pixel 4a and the E11C headphones. After some extensive search on the internet, I see that this kind of issue has happened with other Pixels as well. I found only a few reported cases since only a few Pixels have a 3.5 mm headphone jack.\n\nThis leads me to wonder if Pixels follow a different standard for wired headsets. I am aware the Apple used to have a different standard for 3.5mm wired headphones. So manufactures had to release separate models for Apple and Android. Some headphones like the E10C and E11C claim to have a microcontroller that automatically switches based on whether it is an Apple device or Android device. I need to know if this is the case for the new Pixel phones as well - whether they have a different standard like Apple does.\n\nIt would help me in buying compatible wired headphones in future.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-02-08T11:09:24.999515+00:00",
    "reply": "0 Replies"
}