{
    "url": "https://support.google.com/pixelphone/thread/16957573/issue-with-pixel-3-under-warranty-1-year?hl=en",
    "title": "Issue with Pixel 3 (under warranty 1 year)",
    "content": "Got my Pixel 3 in Feb 2019 and right now it is having issue with speaker and call quality. When I requested for help, google support asked they suggested some troubleshoot and nothing worked for 2 months. After 2 months, they agreed to provide replacement phone. \n   When I ordered replacement phone, it showed as if they are going to provide new phone and they had put $800+ on hold in my card. When I received a mail about replacement phone it showed as refurbished phone. I was requesting to stop the order and even after speaking with google customer support for 4 or 5 times, they proceeded with the order.\n   When I received the replacement refurbished device, i setup everything (took backup etc., spend another 2 to 3 hours of time) and tried calling my friend. As soon as I call, display goes off and my friend couldn't hear what I am speaking and from myside i am barely hearing what he is speaking.\n   Now I had two problems to solve:\n  1) Whether I need to return replacement phone\n  2) Also I am supposed to send the original phone (for which they put $800 on hold). If i don't return on time they deduct the $800 (for the phone currently worth not even $400)\n  I have been dealing with GOOGLE CUSTOMER SUPPORT endlessly and it is going in loop. At one point i am thinking in future not go for PIXEL phones as their customer support SUCKS.\n   THOUGH PHONE IS UNDER 1 YEAR WARRANTY WHY THE HELL I AM SUPPOSED TO GET REFURBISHED PHONE!!!! ON TOP OF IT WHATEVER PHONE THEY SEND IT IS ALSO FAULTY PHONE. I LOST HOPE IN PIXEL PHONES. I STRONGLY FEEL TO GO WITH IPHONE IF POSSIBLE AS ANY PROBLEM HAPPENS THEY IMMEDIATELY REPLACE THE PHONE WITHOUT ANY QUESTIONS AS THEY KNOW WHAT THEY ARE DEALING... :)\nGOOGLE CUSTOMER SUPPORT SUCKS :(\n\nNOT SURE WHAT ALL OTHER THINGS I NEED TO HANDLE WITH THIS POOR GOOGLE CUSTOMER SUPPORT.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3",
    "post_time": "2019-10-16T15:59:54.797099+00:00",
    "reply": "0 Replies"
}