{
    "url": "https://support.google.com/pixelphone/thread/93479897/very-strange-rapid-battery-percentage-loss-on-pixel-3xl?hl=en",
    "title": "Very strange rapid battery percentage loss on Pixel 3XL",
    "content": "Over the past 2 weeks or so, my Pixel 3XL has began to lose battery percentage incredibly fast. This was a very sudden onset, I've had no issues with my battery previously. It will drain to 10% in less than 3 hours of standby. Checking battery usage it says that no apps are draining power faster than normal. With normal use, my phone will go from 100% to 60% in about 30 minutes. The thing that is the most strange, however, is that it doesn't gradually drain -- It will suddenly drop to 20% and then 3% in literally seconds. It happens in safemode, too. I have noticed that it is much more likely to do this if I use Chrome or the camera app at all. I used my phone to record a 15 second video in the video app and it went from 70% to 3% all of a sudden. The most bizarre part of all is that it will stay at 3% for a very long time. The day it dropped to 3% when I used my camera, I put it in my pocket and didn't touch it again until I got home 2 hours later, assuming it would be dead based off the fact that it will lose battery in idle so quickly, but it hadn't drained any further. I used it for a couple of minutes and it then dropped to 1%. When I charge it (using an official charger) it charges way faster than normal, too. I can go from 1% to fully charged in around 30 minutes. Yesterday I used my phone at 1% for around an hour and a half and it didn't die. It appears that there's some strange bug with the battery percentage indicator, indicating that it's losing power faster than it actually is. That's all I can think of that accounts for the weird sudden decreases (there's no pattern to it, either, it's never the same percentage that it jumps to), it staying at low percentage for a very long time, the very rapid charging and the fact that Android says no app is pulling more battery than usual.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2021-01-14T17:16:40.93969+00:00",
    "reply": "1 Reply"
}