{
    "url": "https://support.google.com/pixelphone/thread/51520447/many-posts-about-pixel-phone-power-button-issues-not-working-consistently-or-1-click-camera-launch?hl=en",
    "title": "Many posts about Pixel phone power button issues - not working consistently or 1-click camera launch",
    "content": "I am surprised how many posts (Google Support forums, Reddit, tech sites) I found online with the same problem and it doesn't seem like Google got the issue resolved.\n\nI have a Pixel 2 XL that started having this issue maybe a year ago. The main issue is that the power button does not power the screen off most of the time. I have to click it 5-10 times before it accepts the click. And sometimes as I do that, the camera app launches with a single click. \n\nI looked this issue up back then and there weren't many complaints so I decided it to accept it. Now there are tons of others having the issue. \n\nAnother thing started happening a few months ago. I would be on a call with the phone near my ear and I need to look at something on the phone (usually email or a map). So I move the phone away from my ear and the screen remains pitch black. Clicking the power button doesn't turn the screen on. This issue persists until the other person hangs up. Sometimes if they don't hang up, I have to reboot with a long press.\n\nThe phone getting stuck in screen-off mode happens so often now, I usually end up rebooting the phone every other day. The reboots don't fix the inconsistent power button. These phone sometimes behaves normally and sometimes the power button feels like it's asleep. I also think the lack of responsiveness increases after watching a YouTube video. It's almost impossible to turn the phone off right after closing YouTube.\n\nThat and the launching of the camera app with a single click make me feel like I'm using a junk phone not a high end phone. I LOVE Android but these issues (I've had other hardware issues with previous Google phones... this is my 4th) make me strongly and I say this VERY sadly but strongly consider another maker for my next phone. I am one of few people in my company that use a Google phone. Everyone else uses an iPhone or a Samsung. I usually brag to them about the power of Android and how my Pixel gives me the vanilla experience. Google got too many chances and I feel this is it for my Google phone buying streak. UNLESS they make it right. Not sure if this is the right forum to request support directly from Google or not. The \"Contact Us\" option was for chat. I don't feel like typing back and forth for hours.\n\nHere are some links of others experiencing the issue... there are many more:\nhttps://support.google.com/pixelphone/thread/41669909?hl=en\nhttps://support.google.com/pixelphone/thread/17067447?hl=en\nhttps://support.google.com/pixelphone/thread/17067447?hl=en\nhttps://forums.androidcentral.com/google-pixel-2-pixel-2-xl/950305-power-button-2-xl.html\nhttps://www.reddit.com/r/GooglePixel/comments/987idi/pixel_2_xl_power_button_not_responding_most_of/",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-06-05T19:55:29.07312+00:00",
    "reply": "1 Reply"
}