{
    "url": "https://support.google.com/pixelphone/thread/77227275/pixel-wired-earbuds-wont-work-on-lock-screen?hl=en",
    "title": "Pixel wired earbuds wont work on lock screen",
    "content": "update***  I even tried just doing away with a lock screen and set it so I dont have a pin and the pixel wired headset still doesn't call the google assistant when the screen is displaying the clock.  I long press the middle button and nothing happens. If I take the phone out of my pocket swipe up so my phone is on then I can long press and the assistant appears.   I give up. If anyone knows of a phone and a wired headset that can just send a text while the phone is locked or the screen is off please let me know. I'm done with the pixels.  I ride a bicycle and this is pretty much the only thing I use a phone for.  I don't need to deal with pulling my bicycle off to the side every time someone sends me a text just so I can respond. \n\nMy assistant doesn't work on the lock screen. I am using the forums to walk through a solution but every \"community expert's\" advice is wrong.  The people who reply actually use the correct steps which is very helpful. This is so frustrating it reminds me of when I used to own an iphone and wanted to change one little thing and had to spend hours only to hit a dead end bc they lock everything down which was the reason I switched to android.  The ironic thing is when I used the iphone assistant to text it was amazing and worked 100% of the time with no lag.  Here I am with pixel 3 and a pixel 4a and can no longer use a simple feature like that.  All I want to do is click my middle WIRED headset button so the google assistant appears and I can say \"text so and so\".  \n Have you confirmed that the \"Allow responses while phone is locked\" option is enabled? You can find this at Settings > Apps & notifications > Assistant > See all Assistant settings > Assistant (tab) > Pixel USB-C earbuds > Allow responses while phone is locked.\n I found this in one of the forums but when I go to settings, apps, assistant, see all assistant settings then there is NO assistant (tab) there is a long list of every single option except assistant tab. I just need to find where I can click allow responses while phone is locked for Pixel USB C earbuds because I have followed the other 97 steps just so I can try to send a hands free voice text while my phone is locked. This is ridiculous.  I have already clicked turned on locked screen personal results and I have already turned on allow wired headset request with device locked and the button to call google assistant still doesnt work on lockscreen. It immediately works if I take the phone out of my pocket unlock the phone and then press it but by then what is the use of having a button to call google assistant if I have to go through all of the steps manually on the phone anyway.  \n \nHere is what I see when I follow the instructions above.\nHey google sensitivity\nAssignable reminders\nAssistant voice (I checked this it just lets me pick if I want a British Assistant)\nBasic Info\nCalendar\nContinued Conversation\nExplore\nFace Match\nFamily Bell\nFinances\nFood Preferences\nGeneral\nGetting Around\nHome Control\nLanguages\nMusic\nNews\nNotes and Lists\nNotifications\nPayments\nPersonalization\nPodcasts\nPurchases\nRadio\nReminders\nReservations\nRoutines\nShopping List\nShortcuts\nSnapshot\nVideos and Photos\nVoice and Video Calls\nVoice Match\nWeather\nYour data in the Assistant\nYour People\nYour places",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 3",
    "post_time": "2020-10-16T01:33:59.001719+00:00",
    "reply": "1 Reply"
}