{
    "url": "https://support.google.com/pixelphone/thread/14799895/the-pixel-3-tethering-hotspot-changes-frequencies-and-bands-fast-connected-devices-lose-connection?hl=en",
    "title": "The Pixel 3 tethering hotspot changes frequencies and bands fast, connected devices lose connection.",
    "content": "I set up the wifi hotspot on the Pixel 3 to connect my laptop and other devices to the internet through my phone. I had a different Android before the Pixel 3 and did the same thing. When I sit on the train and move through areas with lots of other wifi networks/hotspots, which I will see, because the Pixel 3 will offer to connect to them, the Pixel 3 will change frequencies five six times a minute even between channels from the 5Ghz and 2.4Ghz band. \n\nMy laptop will still show the connection, but the ping to the phone's IP (gateway) will fail. My other device behaves different. It will detect that the connection has failed and cease to show the wifi connected logo in the upper right corner, but none the less lose connection to the internet and have to be manually reconnected. \n\nThis did not happen previously on the same train that I use to commute every day, when using my previous phone.\n\nThere might be other reasons for the loss of connection besides the Pixel quickly changing frequencies. This is only my suspicion, since the connection loss happens when I sit on the train and the train moves through the inner city. And because I see all the channel switches in my log files of my laptop.\n\nI tried changing the preferred frequency. I usually have it set to 5 Ghz preferred, but the Pixel phone will most often still choose 2.4 Ghz. \n\nI also disabled bluetooth and wifi on the phone as well as the Google assisted location service (uses wifi) and wifi and bluetooth location search for apps. All of that does not help. \n\nI would love to force the Pixel to stop changing frequencies or manually set the frequency for the hotspot, but have not found a way to do that. Do you know how to enable that or do you have any other idea? My current workaround is to toggle flight mode on the laptop to reconnect about once a minute.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2019-09-19T18:27:10.42664+00:00",
    "reply": "3 Replies"
}