{
    "url": "https://support.google.com/pixelphone/thread/22212257/does-google-really-have-a-support-team-or-use-bots?hl=en",
    "title": "Does Google really have a support team or use bots?",
    "content": "I have been with Google fi now for a little over 2 months, I just paid my third bill, I did the join fi get a pixel 3 for $x amount. I am tax exempt was told I would have to order first then send in tax info and it would be applied to account. Well I'm still being charged taxes after sending tax info 5+times. All I've gotten for replies is that it's being looked into and being brought to a higher team. This is the 17th reply I got saying this \"I just wanted to let your know that as of this time we are still working on your case and waiting for an update from our higher team. We don't have any turnaround time yet but rest assure that I'll get back to you as soon as possible once I receive an update from them.\"\n\nNow onto another issue with no support help. When I purchased the phone I also went with the insurance, it is $7 a month. Well thankfully I did, a few days ago I dropped my phone out of my pocket, fell ~3ft with phone case and all broke the corner of the screen. So I do all the links from fi to find out how to get repaired, it's like a freaking puzzle\\maze of links to finally get to help. It states that screen repair is $49 the problem is they don't have a way to do it. The first person I talked to said I would be sent a refurbished then my next bill I would be charged $99?? Confused I said that it's says on the insurance page a screen repair is $49. I guess either because fi service sucks or I was hung up on contact ended after that.\nNow I have been trying to go through support using email all I get is this,  \"I completely understand your concern about the issue. Upon checking with your ZIP code, we could see that there are stores available nearby your location. In this case, I'd suggest you to please contact the manufacturer so that they can help you with the available repair options or else, if you wish to replace the device under device protection plan, please reply to this email so that we can proceed further.\" Over 10x now but that's not all I have gotten this reply 10+times also, \"I completely understand your concern about the issue. Upon checking with your ZIP code, we could see that there are stores available nearby your location. In this case, I'd suggest you to please contact the manufacturer so that they can help you with the available repair options or else, if you wish to replace the device under device protection plan, please reply to this email so that we can proceed further.\"\nI kindly asked if they were fucking with me, and advised them Google\\they are the manufacturer.\nAnyhow after I crack the code on getting my screen fixed I am leaving Fi.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-12-07T18:09:18.177775+00:00",
    "reply": "0 Replies"
}