{
    "url": "https://support.google.com/pixelphone/thread/14900746/android-10-connection-issue-with-android-auto-pixel-3-xl-and-pioneer-avic-w8500nex-car-head-unit?hl=en",
    "title": "Android 10 connection issue with Android Auto, Pixel 3 XL, and Pioneer AVIC-W8500NEX car head unit.",
    "content": "Since the update to 10, almost everytime I connect to my Pioneer head unit with Android auto or Bluetooth, i am having one or more of the below issues. \n\nTroubleshooting so far....\nI have deleted all phone profiles on the pioneer and \"forgot\" device connections for the pioneer in my Pixel and re-established the connections. I have completely reset the pioneer back to factory settings.  I have looked and there are no software and firmware updates for the pioneer.  All the issues still happen.\n\nConnection problems...\n1. My phone connects to the pioneer - then i see a message on the pioneer- \"your device will be disconnected\" - i have two options, \"cancel\" or \"continue\". It doesn't matter which i choose, nothing seems to happen and the phone stays connected.\n\n2. \"Connection Failed\" - my phone will not connect at all, not to bluetooth not to Android auto. But my Pixel shows connections to the pioneer via Bluetooth and WiFi. A reboot of the phone is the only fix i have found this far.\n\n3. Android Auto crashes over and over. Again, a reboot of the phone fixes the issue usually.\n\n4. Android Auto only comes up on my Pixel 3XL and will not connect to the pioneer. I usually turn off WiFi and Bluetooth and thay fixes it sometimes or Android Auto will start crashing. Then A reboot of my phone is required.\n\n5. Trying to connect to bluetooth only I get the message \"Connection Failed\".\n\n6. Dark Mode turns off, and stays off OR dark Mode may turn back on when Android Auto does connect to the Head Unit.\n\nAny help would be appreciated.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2019-09-20T23:18:45.394466+00:00",
    "reply": "0 Replies"
}