{
    "url": "https://support.google.com/pixelphone/thread/57803636/google-camera-app-on-pixel-3-crashing-since-july-4?hl=en",
    "title": "Google Camera app on Pixel 3 crashing since July 4",
    "content": "As of July 4 on my Pixel 3 my camera app crashes every time I attempt to open it. Also, as with many other comments I've seen online, my flashlight app is greyed out and cannot be turned on. Clearly the two are tied together.\n\nOf note, I am able to open Snapchat and use my selfie cam within the app. When in Snapchat there is no longer an option to switch to the back facing camera. \n\nI have tried clearing the data and the cache for the Google Camera app, uninstalling and reinstalling the Google Camera app, removing all permissions from third party apps to the camera, restarting my device multiple times, restarting my device in safe mode, clearing the data and cache of my Google Photo app, and I installed the July 5 software update as of just this morning, all with no resolution.\n\nI contacted Google's support via message option and was told that the only option left is a factory restart (which of course is only part of the trouble shooting options and as with any issue with a phone I've ever had will very likely do nothing to help, but I'm not able to try this this morning as I am not in a position to back anything up so I did not do so as of yet) and that since I'm out of warranty I am unable to send my phone in even if the factory restart does not resolve the issue. \n\nI informed them I've sent status updates multiple times since this started and inquired as to whether this is a known issue being addressed. Of course I was told it is not and that there is no work being done on what is clearly a software issue. I was told that they would pass on my issue and that \"there are many user reported issues coming through that need to be addressed\" but that they would pass this on at my request. \n\nI mentioned the fact that there was quite a bit of reporting done on the Pixel 2 camera issues and that if I have this issue then clearly others do as well and this has been reported to them, but as always they are going to play ignorant.\n\nOnce again Google is not owning up to software issues and is shoving them under the rug.\n\nTo add insult to injury the person \"helping\" me thanked me for my understanding, as if I had any choice in the matter.\n\nThank you, Google, for charging exorbitant prices for flagship phones that you do not support.",
    "is_img": 1,
    "category": "Camera, Google Pixel 3",
    "post_time": "2020-07-08T14:04:22.52023+00:00",
    "reply": "0 Replies"
}