{
    "url": "https://support.google.com/pixelphone/thread/5975175/boot-issue?hl=en",
    "title": "boot issue",
    "content": "The very unsatisfactory experience with using Pixel 1, which was bought in December, 2016. It was purchased in USA and in January, 2017, the device came to India. It was working good, till the problem came in January, 2018. The problem was of booting, the phone was restarting itself. So after discussing the problem with customer services in both the countries, India and USA. India's customer services drop their hands off saying that the manufacturing of the device is of USA, they can't do anything. After discussing so much to USA customer services, they agree to replace the device with refurbished Pixel. So, I sent the mobile and received the refurbished one in February, 2018. It was working fine, since May 30th, 2019. It is a fed up job to watch your phone going through same Boot problem AGAIN just a year later. Google being a most reliable brand, give an output like this. so I contacted India's service centre again. I sent the device to the B2X services in India, they gave me a estimating cost, which was Rs. 21,234 ( $ 303 approximately). The services itself acknowledged that the phone was in good condition and after talking to both USA and India help desk, they said it is hardware issue and can't fixed on troubleshooting or by flash. \nMy question is if it is the hardware issue (motherboard) and the issue doesn't involve me as guilty. Also, all the hardware are all Google verified. How can Google can't take the responsibility for fixing it? The 3rd party is costing in huge amount much more than my trust for the device, as this is my 2nd time facing the same problem.  After spending pretty amount of cash to buy the device, what good and most used \"brand\" device work only for 11 months after the purchase? How can I make others believe to purchase Google pixel, if I have such bad experience?\nDisappointed.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-05-12T09:36:31.505063+00:00",
    "reply": ""
}