{
    "url": "https://support.google.com/pixelphone/thread/57896246/when-will-google-make-a-pixel-phone-robust-enough-to-last-a-full-2-years-of-payments?hl=en",
    "title": "When will Google make a Pixel phone robust enough to last a full 2 years of payments?",
    "content": "My phone shuts down anytime I put pressure on it. I first noticed this when sitting down in the car with my phone in my pocket. But now I can easily reproduce the issue by pressing on the phone with both hands (1 palm on the screen, 1 palm on the back, moderate pressure). The phone is in good shape. Original screen. Always in a case. No dents or dings but see's a lot of on-time due to the nature of my job.\n\nI thought maybe it was the battery so I plunked down $90 for ubreakifixit to replace that (thanks Google for making a device no one wants to work on by the way). No dice. Same issues. I've been through the standard troubleshooting steps with support and reached the inevitable conclusion that I'll need to pay for some kind of repair because my phone is out of warranty. I'm estimating that to run me about 1/2 of the original price of the phone for a new motherboard or whatever. I'm not really willing to shell out that kind of money for a phone that's approaching 2 years old. h\n\nWhich brings me to the heart of the matter... When will Google get serious about their \"flagship\" HW and release a device robust enough to last long enough to get me AT LEAST through the 2 year of payments to the next device release? Seriously... how many people do you see walking around with 3 or 4 yr old iPhones & Galaxy's that might have needed new batteries at some point but are otherwise functional. Don't get me wrong, I'm an iphone hater and even this won't convince me to swap for IOS, but for crying out loud, a $1000 phone shouldn't be a throwaway device after 20 months!!! \n\nI like all the Pixel phones I've had, they take great photos, they work great (for the first 18months anyway) & I don't want non-google bloatware. But I'm seriously considering a switch to some other Android device...",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3 XL",
    "post_time": "2020-07-09T00:59:52.460661+00:00",
    "reply": "1 Reply"
}