{
    "url": "https://support.google.com/pixelphone/thread/54908851/local-mp3s-will-not-play-unless-live-caption-is-on?hl=en",
    "title": "Local MP3s will not play unless Live Caption is on?",
    "content": "So this is an Odd one. I've searched around and cannot find anyone with the exact issue.\nI was playing around with my new pixel buds and wanted to see what the sound amplifier was like. This seems to be the start of my issue. I left the 'accessibility' function (with the little man icon in the lower right corner of the phone) on after I was done messing with it - and didn't think anything of it till after the issue presented itself. I have a lot of MP3s locally on my phone that played fine in GPM till after I was playing with the sound amplifier. Now the local MP3s will 'play' but no sound comes out unless I turn \"live caption\" on. As soon as I turn live caption on the songs will 'play' sound. As soon as I turn Live Caption off the music stops but the timer continues to tick and the slider continues to slide, but nothing comes out my phone speakers or my ear buds or any other form of headphone.\nTo clarify it a little more. I can stream songs from GPM fine without LC on. I can play songs I have downloaded for off line play from GPM without LC on and they play fine. The only thing that gives me an issue is locally saved MP3 files. Which all play fine in VLC.\nI have gone through my Accessibility menu to try and turn off anything I can see that might remotely be connected to this, but have not found anything. \nI have unpaired my earbuds. No difference.\nI have re-paired the earbuds, no difference.\nRebooted the phone several times.\nCleared Cache on GPM. \n\nStill won't play unless Live Caption is on.\nAnyone have any other suggestions?\nIs there a way to reset the phone to an earlier time frame like there is in Windows....?",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-06-22T14:45:46.568163+00:00",
    "reply": "3 Replies"
}