{
    "url": "https://support.google.com/pixelphone/thread/43052525/weird-charge-discharge-issues-over-last-72-hours-p3xl?hl=en",
    "title": "Weird charge/discharge issues over last 72 hours (P3XL)",
    "content": "I noticed it about three days ago when I was streaming audio to a bluetooth speaker: after about an hour, the battery went from 70% down to 50%.  After eight hours of it sitting on the nightstand, the battery went from 40% to 19%.  Plugged it into the OEM charger and it went from 19% to 80% in about six minutes.  Finding that highly odd, I rebooted the phone and removed it from the charger.  \n\nA day of minimal use dropped to about 50%.  Now here's where the concerning part started.  Hopped in the car, started a bluetooth audio to the car, and brought up google maps.  The battery went from 49% to dead within five minutes.  I saw the \"your phone will run out of battery soon\" pop up on the screen and tick from 7% to 6% to dead within 30 seconds.  Plugged it into the OEM charger with the phone off and watched it go from 0% to 83% within five minutes.\n\nSame scenario for this past evening: went to bed with about an 80% charge, woke up to 41% charge.  Scrolled over to the google feed to check news and watched it drop almost instantaneously to 17%.  Saw an article about Stadia, clicked into it, and got the battery warning pop up, watched it drop from 11% to zero in a matter of seconds.\n\nI've reset the phone multiple times.  High battery drain is happening no matter what condition: wifi on/off, bluetooth on/off, location services, airplane mode, etc.\n\nOn the latest software version, no new apps installed, only app updates since I started noticing the issue.  Factory reset the phone and it has to remain on the charger cause pulling updates (apps) drains the battery just sitting there.\n\nI have been using Accubattery Pro to \"condition\" the battery (keeping it between 20% and 80%) for about a month now, which is when I started noticing some battery issues.  I was really hoping this thing would last till the P5 came out, but now I'm stuck using my old Droid Turbo...man how technology has changed.\n\nAny advice to see what is causing the issue would be greatly appreciated!\n\nTL;DR-Phone discharges within minutes randomly, high battery drain while idle.  OEM charger, phone defaulted, almost unusable.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3 XL",
    "post_time": "2020-04-28T16:03:13.241954+00:00",
    "reply": "5 Replies"
}