{
    "url": "https://support.google.com/pixelphone/thread/3614011/verizon-google-pixel-xl-bricked-by-april-1-update-hardware-is-working-condition?hl=en",
    "title": "Verizon Google Pixel XL bricked by April 1 Update (Hardware is Working Condition)",
    "content": "About a week after my phone was no longer covered by Asurion, Verizon pushed an update that bricked my Pixel XL. The phone was plugged in during the update, but my neighborhood lost electricity overnight when the update was installing, and therefore it died during the update.  \n\nI have spoken with Verizon and Google for about a dozen hours over the past 5 days, and get the line \"Your phone is out of warranty, and therefore send it to UBreakIFix.\"\n\nI have spoken to UBreakIFix, and their suggestion is to replace the board, which is not something I am willing to do, because fastboot information indicates the phone is in working condition\n\nAt this point there are two options, but I do not how to go about proceding:\n\n1) Any of the companies -- HTC, Verizon, or Google -- has the ability to flash the stock image back onto my phone. The bootloader is locked by default because of Verizon, which was not something I was aware of until it was too late.\n\n2) Since the phone was manufactured by HTC, the fastboot is technically \"unlockable\" by having my \"KS TOKEN\" signed by Google. HTC phones have the option from fastboot to request a token (via fastboot oem get_ks_token [number]) that can be signed by the manufacturer. This allows for the user to unlock their bootloader for a set number of reboots for repair, after which the phone returns to the locked state. \n\nI must say this has definitely soured my high regard of Google. As a software engineer myself, the only reason I chose to spend thousands of dollars on Google phones for my family and myself was because of the outstanding software, which has been basically destroyed on my Verizon model.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-04-05T07:44:31.456579+00:00",
    "reply": "12 Replies"
}