{
    "url": "https://support.google.com/pixelphone/thread/11570042/battery-usage-information-is-inconsistent-and-not-helpful?hl=en",
    "title": "Battery usage information is inconsistent and not helpful",
    "content": "I have a new Pixel 3, but I've had this issue with all my Android devices, including most recently a Pixel. Basically, the battery usage information is just not very helpful or actionable. I have never had a mysteriously warm phone and found an explanation for it through this interface.\nMy brand new Pixel 3 has been warm, warm, warm. This morning I looked at Settings->Battery and chose \"Battery usage\" from the \"...\" menu. I also selected \"Show full device usage\" in the \"...\" menu on the \"Battery usage\" screen. The top results are:\nScreen: 3 hr, 35 min; 23%\nGoogle: 14 min; 17%\nAndroid System: 4%\nAndroid OS: 2%\nGoogle Play services: 3 hr, 35 min: 2 %\nOkay, \"Screen\". No, I did not have my screen an and full bright for 3.5 hours. So I don't know how to interpret that.\nBut here's another thing: I've never seen this before, but back on the Settings->Battery screen I have the warning \"Phone used more than usual\". When I click on that message, a pop-up appears and says this:\nTop 3 apps you used since full charge:\nDIGI Clock Widget 3 hr, 29 min\nAudible 1 hr, 33 min\nPocket Casts 51 min\nSo two items in Settings->Battery give me two different takes on what is using my battery. I do suspect that the DIGI Clock Widget is my problem. Is that not reported on the other list because it is a widget and exists as part of \"Screen\"? Who knows? I can say that the DIGI Clock Widget does NOT appear anywhere on the regular \"Battery usage\" list. If that app is responsible, then it's only because of that (incidental) \"Phone used more than usual\" message that I learned that. And I have never seen that message until today.\nFWIW I use the DIGI Clock Widget because it shows seconds. I do wish the system's clock widget had that option.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 3",
    "post_time": "2019-08-08T16:34:11.871315+00:00",
    "reply": "1 Recommended Answer"
}