{
    "url": "https://support.google.com/pixelphone/thread/70016903/feature-request-bring-back-the-suggested-apps-search-bar-app-drawer-access-on-the-recents-screen?hl=en",
    "title": "Feature request: bring back the suggested apps/search bar/app drawer access on the recents screen.",
    "content": "A lot of Pixel people (including myself) absolutely loved the feature in Android 10 of having suggested apps, a search bar and access to the app drawer from anywhere, as they were present on the recents screen. \n\nPersonally, I really like the suggested apps because they were really accurate. These kind of AI features is the main reason why I bought a Pixel (and why people love Pixel phones - because of their unique AI features which other phones don't have). Having the app suggestions only on the dock now seems like a step back. Also, losing access to the search bar and app drawer from anywhere were really handy features, especially seeing how much space there is on the bottom of the recents screen, where now you can only find a \"screenshot\" and \"select\" button. \n\nSome sources which prove that people loved the feature:\n- AndroidPolice post about the introduction of dynamic app suggestions on the home screen, top upvoted comments:\n\"What they should really add (back) is app suggestions to recents\" \n\"I really hope they add these suggestions back to the recents menu; that's where I find them useful.\"\n\"It saves me from having to swipe up the app drawer because the app I want to open is probably already going to be suggested at the bottom. I can't believe they removed that and for what, a screenshot button.\"\n\n- Reddit post about introduction of Android 11, top upvoted comments:\n\"I'm not a big fan of the change to the recent apps menu. The view seems a lot more clunky now that you can no longer use the Google search bar, click on a suggested app or go to your app drawer.\" \n\"The search and suggested apps in the recent apps menu was one of my most used features. Really hating that those are gone.\n\"Suggested apps as an option on all my home screens seems like a step back.\" \n\"Oh god, the bottom bit for the launcher is actually gone? I've been so accustomed to tapping the suggestions (because they're that good) that I don't even scroll through the previous apps anymore.\"\n\"Damn I wouldn't have updated if I'd known 😖 What a dumb change. Hopefully they add an option to get these features back\"\n\nAlso on 9to5google's Android 11 feature overview, they are mainly talking about losing this feature:\n- \"RIP overview suggestions. Used it daily.\"\n- \"You can turn it off in Home settings luckily. I love suggested apps but didn't like them on the home screen\"\n\nI really appreciate all the hard work that went into developing Android 11. But to me, and a lot of other people, it would be a good decision to bring this feature back, maybe as a toggle which you can turn on or off. \n\nThank you.",
    "is_img": 0,
    "category": "Homescreen and Launcher, Google Pixel 2",
    "post_time": "2020-09-09T10:34:18.470391+00:00",
    "reply": "4 Recommended Answers"
}