{
    "url": "https://support.google.com/pixelphone/thread/85227187/pixel3a-stopped-working-i-did-a-hard-reset-after-logging-back-in-it-shut-down-again-will-not-boot?hl=en",
    "title": "Pixel3A stopped working, I did a hard reset, after logging back in it shut down again, will not boot",
    "content": "Yesterday morning I woke up to find that my Pixel 3a had shut itself down, even though I had been charging it overnight. I switched to another charging outlet, but the phone still would not start up. I decided to attempt a factory reset, so I held down POWER + VOLUME DOWN for a few seconds, after which I got the \"no command\" screen. I pressed POWER + VOLUME UP to get the menu options. At this point the phone started acting erratically. It would only show the menu options for a very short amount of time before rebooting and kicking me back to the \"no command\" screen. Finally I got it to actually begin the factory reboot. It displayed a black screen with small white text at the bottom saying something like \"wiping /data...\" It seemed to be stuck in this state, but I was afraid to interrupt the process, so I left it overnight (plugged into a working charger).\n\nThis morning I woke up to find nothing had changed, so I used POWER + VOLUME DOWN to restart the device again. Once again I ended up at the \"no command\" screen, so I used POWER + VOLUME UP to get to the menu. The phone seemed to be acting less erratically now, and I was able to select Factory Reset again easily. This time I got the \"wiping /data...\" message again, and it only lasted a few seconds before prompting me to restart. After restarting, I was able to begin the account setup process normally, so I thought I was in the clear.\n\nOne thing worth mentioning is that this is a company phone, and I had previously been using my company-managed gmail address for it, but during the reset process I had trouble with the 2-Auth on that account, so I switched to my personal gmail address instead. Nevertheless, everything seemed to be going smoothly, I was able to connect to wifi and set up my fingerprint again, and then the phone started downloading some recommended apps. I could see that the battery was fully charged, so I left it to finish the app downloads.\n\nWithin less than half an hour, the phone shut itself down again. This time I was unable to restart it no matter what I tried: holding POWER for over 30 seconds, holding POWER + VOLUME DOWN for over 30 seconds, holding POWER + VOLUME UP for over 30 seconds, holding POWER + VOLUME DOWN + VOLUME UP for over 30 seconds, plugging it into the power charger again, etc.\n\nAs far as I can tell the phone is completely unresponsive, and to make it more frustrating, any attempt at searching the web for solutions to this problem just leads me to instructions on how to do a factory reset, which I already did twice, and which is now impossible to attempt again because I can't even get into that boot menu anymore.\n\nIF YOU ARE READING THIS AND PLANNING TO TELL ME TO DO A FACTORY RESET, PLEASE READ AGAIN THOROUGHLY FROM THE TOP. I HAVE ALREADY DONE A FACTORY RESET, IT SEEMED TO WORK, AND NOW I CANNOT EVEN ACCESS THE MENU TO ATTEMPT ANOTHER FACTORY RESET. THANK YOU.",
    "is_img": 0,
    "category": "Homescreen and Launcher, Google Pixel 3a",
    "post_time": "2020-11-25T16:07:45.011077+00:00",
    "reply": "1 Reply"
}