{
    "url": "https://support.google.com/pixelphone/thread/17789592/pixel-2-gps-accuracy-in-europe-galileo-could-it-be-improved-comparison-vs-pixel-4?hl=en",
    "title": "Pixel 2 gps accuracy in europe (GALILEO). Could it be improved? (comparison vs Pixel 4)",
    "content": "Hi All \n\nI'm user of a Pixel 2 and Pixel 4. \n\nI noticed that the Pixel 4 is very accurate (regarding the compass direction) in Europe old towns (like in Barcelona old quarters with very narrow streets).\n\nThis is the first phone that gives me a good accuracy here (at least so far). \nCompass is always 80-100% pointing in the right direction.\n\nI decided to compare Pixel 2 vs Pixel 4 and I noticed the following:\n\nWhen opening \"GPSTest\" app in the Pixel 2, only 1 default GALILEO Satellite appears. And then the phone basically stays with 1-2 satellites, but it struggles to find them. \n\nWhen opening \"GPSTest\" app in Pixel 4, more than 4-5 GALILEO Satellites appear right after launching the app. And then a few more might appear, but that probably is not that required.\n\nAnd finally: I also noticed that if I put Pixel 4 close to my Pixel 2 while the app is open, the Pixel 2 start to catch a lot of more galileo sattelites (Like if the Pixel 4 was enhancing the Pixel 2) --> Anyway, this last case,is weird, but I tried it two times only, maybe I need to try it more times, to confirm is not a placebo. (But the Pixel 2 didn't seem to catch lot of european sattelites by its own, without the Pixel 4 doing the same).\n\nNow my main question about all this topic is: \n\nIs it possible to add more gallileo sattelites to the Pixel 2 configuration? Perhaps this improves the bad the GPS accuracy in some european places? \nI think the Pixel 2 is missing some sattelites in some config file. Could be possible to increase the initial satellite count from 0/29 to 0/37 like the Pixel 4? \n\nI'm just trying to know if it's possible to improve the GPS accuracy in Europe with the Pixel 2. \n\nHere we have some screenshots. \n\n\nPixel 2 (when app starts, only 1 European satellite - so 0/29 instead 0/37): \n\n\nPixel 2 (after putting Pixel 4 and Pixel 2 using GPS together, or at least, after letting Pixel 2 use the GPS for some time): \n\n\nPixel 4 after opening the app (0/37): \n\n\n\nThanks\nSebastian",
    "is_img": 1,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-10-26T19:13:39.959313+00:00",
    "reply": "3 Replies"
}