{
    "url": "https://support.google.com/pixelphone/thread/94450346/pixel-4a-non-5g-static-noise-on-3-5-mm-jack?hl=en",
    "title": "Pixel 4a (non 5G) Static noise on 3.5 mm jack.",
    "content": "Phone: Goole Pixel 4a\nOS: Android 11\nHeadphone: ATH-CKR30\n\nSituation:\nThe situation is similar as \"Static noise on my USB-C earphones\" in the community, but it's on 3.5 mm jack. It has static noise or crackling noise when I am playing music, it doesn't happen on louder music, it happens on quiet part of music like symphony orchestra. If you need a testing sample music, you can search a song called \"Key\" on album \"Minecraft - Volume Alpha\" on Youtube music app. The music is quiet at the beginning and the noise sound is obvious.\n\nWhat I have tried:\n1. I've tried on Safe mode, and it still happens.\n2. I've tried to listen on lossless music of the song \"Key\" I talked about, it still has the noise sound\n3. It does not happen when I listen on my computer and another phone with same lossless music and with same headphone.\n4. I've tried a few other headphones (in-ear, non-earbud) in store, it still has the noise.\n5. I've tried on another Pixel 4a (non 5G), it still has the noise, and also the noise appear timings are totally same.\n6. I've tried to recording a video on Android function, and check on my computer, it doesn't have noise on the computer.\n7. I've tried to listen same music on another phone from another company, it doesn't have the noise.\n\nSorry it's hard to record a video to show the issue, and also my speakers are totally no problem.\n\n\nI'm not sure if that's because the 3.5 mm jack is 0.3 Volts so I have to use some specific headphone. Hope your team can figure out this problem. And also, English is not my first language, hope you can understand my words and it's fine to help me correct the question title.\n\nThank you so much.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-01-21T11:52:44.194622+00:00",
    "reply": "0 Replies"
}