{
    "url": "https://support.google.com/pixelphone/thread/24168177/my-volume-and-power-button-don-t-work-on-my-pixel-3?hl=en",
    "title": "My volume and power button don't work on my Pixel 3",
    "content": "I have restarted my phone, I have made it into safe mode, I kept it completely off for over 10 hours, and nothing has been fixed.\n\nThis problem started with my volume randomly going full blast. I was unable to change that until I moved it down with the slider but that was ineffective as the slider would show up again, moving the volume all the way up. I thought that I would just restart my phone so I tried to use the power button. That didn't work either. I wasn't able to turn off my phone at all, so I took the time to search online if anyone's had the same problem but, nothing was of use. Then, I noticed something very strange. Getting out of chrome by sliding my finger up from the bottom, there were parts of my phone flashing green. I went to my home screen, swiped left to where I read about articles but as I did that, the whole screen turned to green until it fully displayed the article page. I kept swiping back and forth to get a better view of it and decided that, from my home screen, I'd go back into chrome to find more answers. I accidentally left the app and saw that the animation of literally anything on my phone would turn green until the animation was done. Going in and out of apps, the icons were surrounded in translucent green squares. Viewing all the windows of the apps I had opened, the bottom portion, where the home button and the back button were, lit green as well. I kept my phone idle so it would automatically turn off so I could be able to go to my lock screen. Nothing was happening there. The power button worked so I had the chance to turn off my phone completely.\n\nHere's where I got the most scared. I left my phone off without charging the whole night. I woke up in the morning to plug it back in but it displayed a picture of the body of the green android mascot lying down with it's body open, showing a red triangle and an exclamation mark inside of it. Under was some white text saying \"No Command\". The rest of the screen was black. Every couple of seconds, the phone would cut to the white screen and the google logo as if I had just restarted it, but just before going to black again and returning to the \"No Command\" display and the lying android. this would go on into loop until I held the power button for seven seconds and it turned off.\n\nI was able to turn it back on but I'm afraid that it's on the same chain of events now because the volume won't give up on being as high as it an be. Please help me fix this!",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-12-30T00:10:11.073262+00:00",
    "reply": "1 Reply"
}