{
    "url": "https://support.google.com/pixelphone/thread/105940706/stay-alert-with-heads-up-beta?hl=en",
    "title": "Stay Alert with Heads Up (Beta)",
    "content": "If you’ve ever tripped on the sidewalk or walked into a pole while texting, you’re not alone. Heads Up is a new Digital Wellbeing feature that helps remind you to be aware of your surroundings while you’re on the move. If your phone screen is unlocked and you’re walking, you’ll receive a gentle nudge to look up and pay attention to what’s around you.\n\nTo use Heads Up, join the beta program in the Digital Wellbeing app. You can help us continue to improve the experience by using the “Send feedback” button in the notification.\n\nWant more information about Heads Up? Keep reading for answers to some of your questions:\n\nWhy are you doing this?\nDigital Wellbeing recognizes the safety and wellbeing-related benefits of not using our phones while walking, so created this as a gentle reminder to look up and pay attention.\n\nHow accurate is this feature? Can I rely on it to keep me safe while walking? \nWhile we have tested this feature to be as accurate as possible, do not rely solely on this feature to keep safe. Please always use your best judgement, and use this feature as a gentle reminder when you do find yourself distracted while walking.\n\nWhen is this feature triggered? Is it based on how long I’ve been using my phone? \nThe feature is triggered when walking. If you have granted the location permission, then it will also take into account whether or not you’re outdoors. \n\nDoes this feature work when I’m jogging or running? \nIt should also work while jogging or running, since your phone’s motion sensors will detect that you’re moving. \n\nHow are physical activity sensors and location being used by the app? \nThe app uses sensors in your phone that detect movement to understand whether or not you’re walking, while the location is used to understand whether you’re walking indoors or outdoors. Location permission is optional but makes for a better experience by identifying situations that are more likely to be hazardous and require your attention. This data is only used on the device and is never shared with Google. \n\nIs the Digital Wellbeing app constantly monitoring or tracking my physical activity and location? \nNo, Digital Wellbeing detects when you’re walking while the phone is unlocked, and only checks indoor or outdoor location. Digital Wellbeing doesn’t monitor any other kinds of activity, and your specific location is never shared with Digital Wellbeing. \n\nIs any data shared about how often I’m using my phone, my physical activity or location?\nYour location and physical activity data is only used for on-device activity recognition. Digital Wellbeing never shares it with anyone. We only collect generalized data when a user interacts with Heads Up notifications.",
    "is_img": 1,
    "category": "Other",
    "post_time": "2021-04-12T16:10:38.764657+00:00",
    "reply": "1 Reply"
}