{
    "url": "https://support.google.com/pixelphone/thread/20411183/pixel-3-keeps-crashing-and-rebooting?hl=en",
    "title": "Pixel 3 Keeps Crashing and Rebooting",
    "content": "Phone first crashed a little over an hour ago, just froze and rebooted itself. Okay, weird, but no big deal because glitches happen. Less than three minutes after reboot, happens again. Now it's a problem. Quickly look up on my phone possible solutions and again, within three minutes, it freezes and crashes.\n\nBarely able to glean that I could try safe mode, I try booting into safe mode. After clearing the three-minute hurdle, I search again online. Right around the five-minute mark, it happens again while in safe mode. After several reboots, 20% battery drain, and several quick-typing google searches in-between reboots I see that I can do a factory reset because it could be a faulty system update.\n\nThat makes me a little nervous, but my phone is essentially useless otherwise and I'm running out of battery. This is where it gets worse. After reset, phone goes into setup mode, except there's a big problem -- I'm using Google Fi and have two-factor auth on my account. I can't finish setup on the phone because it needs to verify my login via text; I can't get texts because I don't have Google Fi app installed; I can't install it because it requires access to the Play Store -- see a pattern? Oh, and mid-setup it still keeps freezing and restarting. So, problem isn't solved, but I now have a factory-reset phone that I can't log into and can't access phone service on that just happens to reboot every 3-5 minutes.\n\nThis abruptly started out of nowhere and now is extremely frustrating to deal with as I'm traveling abroad for at least another three weeks. I'm now at the airport, luckily several hours early for my next flight, but I can neither access my flight information on my phone, nor can I get in touch with those I'm supposed to be meeting up with when I land.\n\nBy sheer luck, I was able to get my laptop working long enough (it's been finicky lately) to get this written up and disable two-factor auth, but I don't know how much my luck will last. Any advice on how to remedy the phone situation would be abundantly helpful.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-11-19T01:02:22.34279+00:00",
    "reply": "1 Reply"
}