{
    "url": "https://support.google.com/pixelphone/thread/16268950/pixel-2-xl-audio-accessory-issue-not-charging?hl=en",
    "title": "Pixel 2 XL audio accessory issue not charging!",
    "content": "I purchased my phone new about 1 year ago. I have always loved Google phones because the software was clean with no bloatware. After upgrading to Android 10 my phone was working just fine. However, about 2 weeks in with Android 10 when I plugged in my charger my phone was not charging. I got an error about an audio accessory. I troubleshooted the issue with Google Support which resulted in being advised I would have to send the phone in. I was told I would not have a phone for 5 to 10 business days. This is where Google lost me as a customer:\n1) No loaner phone provided\n2) Shipping provided was 5 day shipping!\n3) Customer support is simply giving me the run around and still have no idea where my phone is\n\nThe courier confirmed delivery to Google on September 27. I have been in contact with Google Support 4 times now. I contacted them originally a few business days after I noted they had received the phone and nobody contacted me. I simply wanted confirmation that they received my phone and it was being worked on. I still have no yet even received that simple confirmation. I have been given the run around between product specialists, shipping, and now a \"dedicated team\" is supposed to contact me. After each contact I was told I would get an answer within 24 hours. Never has that come true which is why I have to keep initiating contact. Today I was told someone will get back to me in 24 to 48 hours. \n\nI do not understand how a company of this size is unable to tell me where my phone is that I had shipped to them. As I read through these forms I see all the different people posting issues with charging and no responses by Google Support. \n\nI was once an absolute Google fan! This one experience has left me unable to support their product. I can only hope that they will do something for all of us Pixel purchasers. These problems are not isolated. \n\nWill keep you all updated over next 48 hours.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-10-08T01:57:12.557962+00:00",
    "reply": "4 Replies"
}