{
    "url": "https://support.google.com/pixelphone/thread/76861519/has-google-figured-out-the-obvious-issue-they-have-with-software-clashes-on-pixel-phones-yet?hl=en",
    "title": "Has google figured out the obvious issue they have with software clashes on pixel phones yet?",
    "content": "Well here goes , long story cut short. Since the day i setup up my pixel 3a it has had soft and hardware issues.  Could be multiple issues but i have identified a few and realise a new one that is causing problems. Google play music since day one seems to notify me it trying to update.  I don't use it and have not for years. Had one song one it.  But seeing as they are phasing it out and starting YouTube music.  Why have they bothered to preinstalled it on my device. Issues got worse when i opted to enjoy a free 6 month trial with apple music offered by my network provider.  Honestly i don't think the apple music app does well on a pixel anyway. But it has affected hardware mainly volume of music and various other software issue. issues. But last night i decided to access Google dashboard to try and wipe permanently the play list it claim i have in play music account that are not.  It offered to transfer them to yt music so i though go for it.  What is did was transfer playlists i had set up in apple music. So clearly a clash between and Google play music and yt music app issues. And now all those playlist are on yt music . With the one song i had in Google account. But yt music app setting are now clashing in the triangle of google play music, apple music and yt music app.   I am finding the yt music web page has amazing play back volume through chrome of all browsers, but absolute shockingly low and the equaliser settings seem to be like a petulant toddler that change themselves or do not change at all in the app. This has had a profound affect on my device and has definitely caused it to  suffer before its time .  So how do i get them to accept this and get a replacement that has not suffered the strain due to Google not thinking this through.   40gb data plan a month and i ain't using more than 12% because i just have given up with my phone.     It really has not helped with all the ways Google back up you data in various ways as you can not getting it clear enough. Device personalisation services just another spanner in the works that pushes the issue even after factory reset.   Feel so let down as i have been an android user since htc first released smart phones . Now Google the creator of android have come so far and messed up spectacularly.  And honestly i really hope i am right about this because if not then not only have they left use with a worse os than year gone by but clearly are producing poor quality hardware.  I am one of thousands having similar issues. This is not a user issue, but a google problem 😥\n\n\nP.s. they also have the nerve to call this a community but yet i can not comment on others questions that are having the similar issues. Why, because they do not want users communicating and figuring out between us that they are at fault.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 3a",
    "post_time": "2020-10-14T09:38:00.457142+00:00",
    "reply": "3 Replies"
}