{
    "url": "https://support.google.com/pixelphone/thread/7403895/1st-gen-pixel-battery-draining-and-performance-suffering?hl=en",
    "title": "1st Gen Pixel Battery Draining and Performance Suffering",
    "content": "Currently experiencing a couple of issues with my 1st Gen Pixel.  The main issue is making & receiving.  I am occasionally able to hear and be heard (usually after a restart), but having intermittent issues other times where the call is going through (call timer starts) and I can't hear anyone, or the call doesn't go through at all (stuck on \"calling...\") and I hit the hang up button but it sits like it's still in a call and the notification display goes dark.  From there I usually have to restart or hard reset the device.  I also had someone attempt to call me and I believe my phone didn't ring, but then I saw the notifications for a voicemail & missed call and when I tried to unlock it said that the phone hadd\n\nFor this issue I have restarted and hard reset my device a number of times.  When I first started noticing the issue with calling, I also tried it in safe mode and ran into the same issue.\n\n\nI haven't noticed a huge drop in performance as far as speed, but the other issue that I've been seeing is the battery being drained while my phone is locked.  For example this morning, I had only used my phone for a couple of minutes on Facebook & Snapchat, but I was already down to 31% (attached screenshots).\n\n\n\n\nFor the battery and the calling issues I had turned off the usage access for JUST digital well being, but today I turned off the usage for all of the apps including the system apps (attached images)\n\n\n\nI\"m hesitant to do the factory reset, but seems to be the only option assuming that stopping the usage access for all applications on digital wellbeing resolves both issues.\n\nThanks",
    "is_img": 1,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-06-04T15:38:25.852857+00:00",
    "reply": "1 Recommended Answer"
}