{
    "url": "https://support.google.com/pixelphone/thread/62924302/google-messages-app-has-rcs-glitch-after-clearing-data?hl=en",
    "title": "Google Messages app has RCS glitch after clearing data",
    "content": "I had to clear the data on the Google Messages app because it was randomly crashing.  After that, it fixed the random crashing issue however any RCS message thread I have with pictures that are received by the other person are now showing 2 versions of the picture.  One version is the correct high res version I received at the time but the other version is a low res version that seems like it should be a thumbnail version like when you see the preview in the conversation list before going into the message to \"read\" it.  This seems to only happen with the RCS conversation threads and it's only the previously received pictures.  Anything that I sent is fine, anything new after clearing the data is fine and even gifs and videos that were received are fine and not showing this weird second low res version of the same picture.  I have tried clearing the cache, clearing the data again, force stopping the app, uninstalling the app updates and when that made no difference I then reinstalled the latest version.  I have cleared the cache on the carrier services system app but that didn't help.  I've also turned chat features off and checked but no difference in those pictures.  I also downloaded a third party messaging app, used that to \"delete\" the low res version of the picture since the Google messages app won't let me select that version independent of the full res version but I found that deleting the low res version deleted the high res version too so it seems they are the same file.  I have also used a 3rd party app to backup one of the RCS message threads and then deleted the thread from Google messages and then restored the messages using the 3rd party app but the issue persists.  Google chat support was no help.  is this a bug that can be fixed?  Is anyone else able to duplicate this?  Easy steps to reproduce: 1. Clear data on Google messages app. 2. Go check any RCS conversation you have with a picture received and see if it looks like this.",
    "is_img": 1,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-08-05T00:28:01.388328+00:00",
    "reply": "0 Replies"
}