{
    "url": "https://support.google.com/pixelphone/thread/39194596/returned-google-pixel-4-xl-on-4-november-2019-and-no-refund-yet?hl=en",
    "title": "Returned Google Pixel 4 XL on 4 November 2019 and no refund yet.",
    "content": "I ordered the new pixel 4 xl for myself during the launch event. After reading through thorough user reviews, decided that perhaps this phone wasn't for me.\n\nShipped the device back to Google with RMA number. Passed the package to Google's local courier partner on 6 November 2019, and haven't received a refund till now. Note also that there was no tracking link provided by Google's local courier partner. \n\nOn 29 December 2019, received an email from a staff of Google:\n\n\"Hi Daniel,\nGood day! I hope this email finds you well.\nInstead of escalating the case to our Shipping and Refunds Team, I have consulted my support about it instead. We have checked the return status and we just received the item back our warehouse on December 23, 2019. The refund has been processed already and will reflect on your account in 14 business days. \nOrder number: XXX\nItem: Pixel 4 XL (64 GB, Oh So Orange)\n\nShould you have further questions, please let us know.\nThanks!\nXyrylle Anne\nThe Google Support Team\"\n\nExcept, the refund never came. Finally reinstated my account at Google, and now, they came back with this email on 10 April 2020:\n\n\"Hi Daniel,\nThanks for contacting Google!\nI do apologize for the late response. I'm glad to inform you, your account has been reinstated! This means that we can process your refund. However upon checking with the buyer's remorse RMA02412946, there hasn't been any trace that your device was delivered to us.\nI understand one of my colleagues before has mentioned that we received it, however as I am processing the refund it is not going through because there hasn't been any trace that your device was delivered to us. I have checked with our warehouse team, and we would need the tracking link that was sent to you when you return your device to us, so that we can proceed with the refund. Please provide it to me so we can escalate this further. Without the tracking link, we would not be able to process the refund for you.\nThanks!\nRose\nThe Google Support Team\"\n\nThe problem is that, no tracking link has ever been provided by their local carrier. How am I supposed to track it?\n\nThis is getting really frustrating, I've all that credit stucked on the card for the past 6 months or so, and nobody ever seem to understand what I am going through.\n\nThis has been quite disappointing, frustrating and traumatising experience with Google so far, I can't talk to anyone who can get me a proper Answer, so many levels of customer service/support. \n\nSomeone, Please help...",
    "is_img": 1,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-04-10T14:33:04.324398+00:00",
    "reply": "7 Replies"
}