{
    "url": "https://support.google.com/pixelphone/thread/83780163/pixel-5-users-does-cpu-temps-and-usage-fluctuate-on-idle-what-is-considered-normal-cpu-behaviour?hl=en",
    "title": "Pixel 5 users - Does CPU temps and usage fluctuate on idle? What is considered normal CPU behaviour?",
    "content": "Hoping Pixel 5 users can shed light on my potential issue. I'm new to Pixels in general so I am not sure if what I am experiencing is normal or not. I will go through everything I noticed and did incase a part of this helps someone else.\n\nTLDR - Read 3, 5 and 6. The rest is background info which may be useful.\n\n1) I noticed that when I do simple tasks on my phone, such as browse chrome, after 15 mins or so, my phones battery temperature would rise to over 30 degrees celcius. This peaked at around 36c. I thought this to be strange as the phones screen was noticably warm and what I would normally expect from a phone that has been doing some heavy gaming.\n\n2) I downloaded CPU Monitor to try and find the cause of the high temperatures and concluded the cause of my battery heating up was due to high CPU usage. My overall CPU usage never went below 50% and kept periodically shooting up to around 84-94% before dropping to 54%. This was after I killed all background processes and had nothing but this app open. The periodic loading also made the CPU temperature jump from 25c to 35c, gradually getting hotter and hotter until it never fell below 30c. This was gradually heating up my battery.\n\n3) I managed to improve my CPU usage after discovering this was due to a system update that was not installing. So after the update, my overall CPU usage was now down to 31% @ 25c but on occasion, it still spikes up to usually 70% or 80% and the temperature would jump up to 29c instantly before dropping down to 31% @ 25c. Cores 1-6 all go up usually by the same amount to around 84% max. Because the temperature still spikes up and down, the phone will eventually reach the top of the spikes (29c-32c) although this takes longer than before I updated my software.\n\n4) I have an old Galaxy S6 which I used the same app to check usage and I found that it idles at around 32% @ 25c. It also jumps up and down like the Pixel 5 but only to 49%. The temperature is very stable and doesn't fluctuate when this occurs. It only uses cores 1-4 when the spikes occur, sometimes its only cores 1-2. It eventually rose to 28c after I left the screen on to monitor this which is expected. The battery in this phone stays the same temperature as the CPU since it is so stable. The CPU in this phone is a Samsung Exynos7420. \n\n5) Do you guys think my CPU is defective or is this to be expected from this phone? \n\n6) It would be helpful to myself and potentially others if Pixel 5 users could shed some light on their CPU performances when the phone is idle so that we can understand how the phone should typically behave. I have included some screenshots of CPU Monitor to try and illustrate what I am experiencing when then phone is idle (all apps closed but CPU Monitor).\n\nPlease upvote this post if you are experiencing the same issue!",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 5",
    "post_time": "2020-11-18T21:34:03.68177+00:00",
    "reply": "4 Replies"
}