{
    "url": "https://support.google.com/pixelphone/thread/52823091/pixel-4-xl-camera-along-with-google-photos-very-poor-peformance?hl=en",
    "title": "Pixel 4 XL Camera Along With Google Photos = VERY POOR PEFORMANCE",
    "content": "I’ve been having some poor performance out of my Pixel 4XL and Google Photos and I am not sure what is causing it.\n\nThere are several things going on…\n\nYou can sometimes take 3-4 photos and it is fine but then the slowness starts in, starting with the preview of the photo you just took resulting in a black screen. \n· When taking a photo, there is a significant delay before you can see it in Google Photos.\n· If I take a photo, the “processing” of it can take 10-30 seconds, more so on portrait mode and it will produce a black screen fore as many or longer seconds.\n· If I take a screenshot and immediately try to open, it again, 10-30 second delay.\n· Editing a photo or screen shot produces the same 10-30 delay.\n· Bulk deleting photos can take a long time and leave little placeholders for the photos.\n· Sometimes just going into Google Photos, it can leave placeholders for several moments of time.\n\nTroubleshooting So Far\n\n· Cleared cache and data.\nDeleted apps that might cause it.\no This resulted in taking Google Photos hours to recache my photos in the app.\n· Safe Mode\no Loaded safe mode and cleared cache and data and then rebooted.\no Still took hours to recached.\no Performance improved for a while but then poor performance returned.\n· Factory Reset\no Factory reset provided short term relief but problem returned.\n· Different Pixel 4XL\no A second, new Pixel 4 XL resulted in the problem returning.\n\nI tested a Note 10+ and it has no issues...so thinking it has to be a combo of Google Photos and Google Camera or perhaps my Photos Account. \n\nWhat could this be? I would think since this happened after factory reset and new phone that it is a Google Photos problem? Could it be another app doing this?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2020-06-11T14:59:35.387682+00:00",
    "reply": "1 Reply"
}