{
    "url": "https://support.google.com/pixelphone/thread/71368527/how-do-i-get-a-replacement-phone?hl=en",
    "title": "how do I get a replacement phone",
    "content": "It's been really frustrating to get the replacement from google I have never been so disappointed with a product as i have been with my google pixel 4 phone.My phone is under warranty and stopped working .I sent my phone back for a replacement and after a week got mail regarding that google shipped a replacement phone through fedex.I have made the request to fedex immediately once they send me the confirmation email that package was delivered.The update from Fedex is inaccurate. The parcel was never delivered.\nI dont even know whether the parcel was shipped in the first place.  I stay at an apartment and the property required delivery services to make use of lockers due to security reasons. If the fedex delivery person puts in the locker i get a notification immediately.\n\nI am questioning the intent of the fedex driver and that of google as well.\n\nPlease let me know if i should go to the police to investigate these fradulent practices.\n\nFirst,\nThe package suddenly got into delivered status after 5 days being in pending delivery.\n\nSecond, \n\nIt's a $600 device. Why would you not buy coverage or have it receipt signature enabled so there are no such cases. \n\nI raised a concern immediately when FedEx said it was delivered.\nWhy is it taking you 3 weeks to open an investigation\n\nThird\n\nI am still not convinced that google actually send the replacement in the first place. \nfourth \nAccording to google contact  courier partner for file a claim and fedex is like only shipper can file a claim. \nIt's been 3 weeks of mental harassment for me to get a simple replacement and  tossing between fedex and  Google. All i keep hearing is that my case has been escalated to the \"specific team\", \"the higher team\", \"the shipping team\" working on it.\n its all that when you  intrested to buy a google phone it all comes with No Support.Now they have my money and my phone both.\n\nAll in all if looks like a conspiracy to me. \n\nI am questioning the intent of the fedex driver and that of google as well.\n\nPlease let me know if i should go to the police to investigate these fradulent practices.\n Do I need to explore my legal options?",
    "is_img": 1,
    "category": "Other, Google Pixel 4",
    "post_time": "2020-09-15T22:14:37.054726+00:00",
    "reply": "0 Replies"
}