{
    "url": "https://support.google.com/pixelphone/thread/80280652/issue-with-one-app-after-android-11was-undated?hl=en",
    "title": "Issue with one app after android 11was undated",
    "content": "I had no problem before the new update when my phone was running android 10.\n  I can't pair my Bushnell Phantom golf GPS to my phone app. I have uninstalled and reinstalled the app. The Bluetooth is on both the phone and GPS. When I tried to pair the GPS the passcode comes up on the GPS, I put the 6 numbers into the phone and then the app says cannot communicate with GPS.\nMy phone is a Google Pixel 2 software is up to date android 11 and GPS is also running latest update. This is what I have done so far. I have done a hard reboot on phone and GPS.\n1            Try alternate web browsers (Chrome, Explorer/Edge, Firefox)/Or, clear out your current browser's cookies and cached data.\n2            Make sure your device is powered on before you connect it to your computer.\n3            Try all USB ports on your computer (safely eject from computer first before physically removing from USB port).\n4            Try resetting the device by pressing the power and down buttons for 7 seconds (while it is disconnected).\n5            Disable security settings that may prevent data transfer (3rd party antivirus software and/or firewall protection).\n6            Try an alternate cord, if possible.\nIf all fails, we would recommend attempting on a different computer to verify if it is a specific computer configuration or program that is preventing the transfer.\n I have tried all suggestions. The update was successful but still will not connect to my phone.\n  I removed GPS from the app. Tried another phone and computer, the same thing happened. The update was successful but still will not connect to the phone. Both phones were running android 11. I tried one more time with my laptop, the update was successful and used an apple 8 iPhone. I loaded the app and connected the GPS to the iPhone with success. So I have to say there is a problem with the app because it is not compatible with the new android 11 system but works fine with iPhone.\n  So do you have any suggestions on how I can run the app?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2020-11-01T02:13:13.923576+00:00",
    "reply": "3 Replies"
}