{
    "url": "https://support.google.com/pixelphone/thread/106424560/google-will-not-provide-support-or-help-about-my-pixel-4-not-working?hl=en",
    "title": "Google will not provide support or help about my pixel 4 not working",
    "content": "My device won't start and Google support has no answers, advice, or response, although it is under warranty still. It simply shows the loading G icon and will occasionally prompt in Android recovery mode giving two options; the latter of which is to factory reset. After several hours of non-responsiveness and/or rude and offensive agents ignoring my questions and outreach, I opted to factory reset seeing as how no other viable outcome would present itself that would salvage my data, and based on the prompt stating that said data would likely be lost if repeated attempts did not yield a favorable outcome or restart of the device (restarting was the other option which never worked despite repeated attempts over the course of several hours). I have no clue what went wrong with the device, nor how. In its current state an error screen offers recovery or rescue mode, as well as barcode, and shutoff. None of these options work to start the device though. The only prompt that shows up in recovery or rescue mode is an error message, it basically says no command, and it shows the android bot, presumably dead, with a red exclamation point sign above its chest. As stated, I have no knowledge of what caused this to happen, but what I know is that the device died unexpectedly on me from the battery draining completely from ordinary use (there is no warning before the battery drains completely, only up through 7% does the device give a final warning). I plugged in the device to charge for several minutes before attempting to power it on, and that was late last night, the last time it worked and the last time I could do anything with it. My outreach to Google has largely gone ignored with the exception of a few troubleshooting steps that did not accomplish anything. I have already given up any hope of restoring the device with any of its data which puts me at a tremendous, albeit inevitable, loss. This is not the first time I have had issues with Google products and services that resulted from their defective nature, and not damages. I just am tired of waiting for answers that offer no resolution and delaying what limited options I may have any further which continues to add tremendous costs to the already significant losses.",
    "is_img": 0,
    "category": "Other, Google Pixel 4",
    "post_time": "2021-04-16T14:36:51.663422+00:00",
    "reply": "0 Replies"
}