{
    "url": "https://support.google.com/pixelphone/thread/10619832/unable-to-maintain-ip-address-connectivity-to-a-non-internet-enabled-wi-fi-hotspot?hl=en",
    "title": "Unable to maintain IP address connectivity to a non-internet-enabled, Wi-Fi hotspot",
    "content": "I have a development device which operates in Wi-Fi hotspot mode, but doesn't have an internet Gateway (this is by design). I connect to the device with my Pixel 1 in order to manage it via SSH. For maybe the past couple months, my Google Pixel running Android 9 shows the below behavior (phone gets a IP address via DHCP yet can't ping the connected hotspot's IP, 192.168.43.1). Another older Android phone (as well as my laptop), works fine as a client for the same hotspot.\n\nTemporary workaround, I have to:\n==========================================\n'Forget' the development device's access point\nRe-connect (re-typing password) to the access point\nWait several seconds until the ..Stay connected?` message appears and tap \"Yes\"\n\nSymptoms; Wi-Fi shows connected but:\n==========================================\nCan't SSH to the development device from the Pixel (using JuiceSSH)\nPhone has an IP yet can't ping the development device (192.168.43.1)\nPhone stays connected to the hotspot but status is:\n              Wi-Fi has no internet access\n      Tap for options\n\n           ..and the below status appears in the Android swipe-down menu:\n\n              This network has no internet access. Stay connected?\n\n           If you tap \"Yes\" and _also_ check the box:\n\n              Don't ask again for this network\n\n           ..it's not clear what this actually does, if anything. A short time later, the hotspot is back to the same broken state. Additionally, the Stay connected?` option is not persistent (disappears when it feels like it) in the Android drop-down drawer.\nSome time after using the temporary workaround, the hotspot is back to the same broken state\n\nI can't imagine this is not a bug. What use-case is there to stay connected to an access point AND deny IP connectivity because there's no public internet access? If there's a health check being performed that fails and causes this, what is the check? HTTP GET to a Google server; ping to a DNS IP etc?\n\nEdit: I ran a packet capture on the dev hotspot and saw DNS requests to connectivtycheck.gstatic.com which lead me to the below post. I tried the below steps and it is working currently (could be too soon to tell).\n  https://support.google.com/pixelphone/thread/1265464?msgid=1265906\n  Settings > Network & Internet > Wi-Fi > select the \"Settings\" gear icon next to the name of your home network > Advanced > Metered > Treat as Unmetered\n\nMy note about this being a bug is still relevant, to me. If it's going to behave this way, it should describe \"Metered connection\" and hint what that means in one of those pop-ups. I shouldn't have to run packet captures to solve a problem like this.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-07-25T17:21:33.344987+00:00",
    "reply": "4 Replies"
}