{
    "url": "https://support.google.com/pixelphone/thread/1594187/my-pixel-2-xl-is-with-google-service-centre-since-more-than-1-5-months-need-help?hl=en",
    "title": "My pixel 2 XL is with google service centre since more than 1.5 months.. need help",
    "content": "Pathetic customer service in India. Phone is faulty and they refuse to replace it. Phone is with service centre since last 1.5 months. Within 5 months of purchase, had to send phone to service centre twice and a lot of hassles.. \n\nTo give you a background, I am an Indian Chartered Accountant working since the last 14 years with multinational accounting firm and then with a reputed listed company in India. Am giving you the background so that you know this email is not a sham or a means to defraud your company.\n ·         I bought Google Pixel 2XL on July 22, 2018 from a store in Mumbai. Within 2-3 months of using it, I started facing problems in it – proximity sensor issue, sudden black screen, very bad camera quality, phone suddenly getting muted / on hold while talking, etc. I complained to the customer care. They asked me to perform some trouble shooting steps. I did those but the problems persisted.\n ·         Suddenly one day, the phone shut down and wasn’t restarting. I complained to the customer care again. The Google customer care arranged to take the phone to the service centre (that too after a lot of haggling with them about the timing. Apparently, they did not have enough staff as their staff was on leave!!!!). They took my phone on Nov 12, 2018, diagnosed my phone and returned it to me after a few days saying the mother board has been replaced i.e. it was faulty and so it is replaced now.  This is only within 4 months of use.\n ·         Again after a month in December, I started facing troubles with the phone – after typing any message or receiving a call, a strange sound started coming from the phone. This happened after SMS, call, whatsapp message. Couldn’t see any video or hear songs on the phone since there was only that strange beep like sound coming from the phone. Coupled with that there was again the proximity sensor issue, bad camera, poor voice quality. I was pretty upset with this and I called the customer care again. They again asked me to follow some trouble shooting steps. I did this but the problem wasn’t resolved. So they said they will arrange for a pick up of the phone. The person who came to collect my phone again performed some mandatory checking (which took an hour or so) while I was in my office. Since they again said that the staff was on leave and therefore they couldn’t come to collect the phone at my convenient time, I had to call the person in office and spend more than an hour in his trouble shooting procedures. He told me my phone is fine now and therefore I need not give it to the service centre.\n ·         Immediately again in a few days, I started facing same problems with the phone. Totally frustrated, I called the service centre again. The person who came to pick the phone again performed some trouble shooting steps (which again took almost an hour). He took my phone on December 29, 2018. I asked him to put in a request for refund because I was totally frustrated with the phone.\n ·         I am haggling with the service centre since then. My phone is with the service centre since December 29 i.e. more than 1.5 months. I have written to them various times and called them as well. After a lot of emails and calls which I made, the customer care told me that there is no refund policy. .  I requested for a replacement phone since this phone is causing a lot of problems. I asked for a replacement as it is a right of a customer to get a properly functional phone after paying a hefty price for the phone. The service centre personnel do not respond to emails till the time they are sent repeated reminders. Some even gave frivolous reasons such as they were on leave since few days!!! Really!! Isnt there a handover takeover?? If a Google personnel is on leave, then would the customer have to wait till he or she returns?? Google customer care personnel promised me over the call that I will get a resolution on the problem by a particular day; but there would be no email or call from them on that day! Are they are shirking from talking to a disgruntled customer?\n ·         The customer care personnel told me that in India, they wouldn’t replace phones while in US, they have the policy of replacing phones if the phone is faulty!! This is ridiculous. Why such a discrimination against INDIANS???\n In a nutshell, My experience with the product was bad but my experience with the customer care personnels was worse. I am still struggling to get a replacement phone. It actually seems that no one in Google cares about its customers. If B2X is managing the service here, doesn’t Google have a check and balance on them? Or is it that Google itsef doesn’t care for Indian customers?? If that’s so, why should an Indian customer buy a Google product? There are many other products available in the market which have great customer service. Please don’t make a customer so disgruntled that he stops using your product completely.. Isnt Google concerned about its reputation and brand image here?? My phone is with the service centre since 1.5 months now and no one in the service centre is bothered to check with me about this.. Is this CUSTOMER SERVICE??? Really?? This interaction with the service centre has caused a lot of mental harassment for me. All I ask Google parent company to do now is give me refund of my money OR a new replacement phone. I don’t think it’s a big ASK from a customer who has paid hefty price for your product.. I hope a company like yours wont be so indifferent about a customer’s problems with the phone and leave the Indian service to some third party operator.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-02-12T04:53:15.035979+00:00",
    "reply": "1 Reply"
}