{
    "url": "https://support.google.com/pixelphone/thread/17227374/pixel-destroyed-by-android-10-update-boot-loop?hl=en",
    "title": "Pixel Destroyed by Android 10 Update (Boot loop)",
    "content": "This is the second time my Pixel 2016 is destroyed by an update\n\nMy first post is here from 2018 Pie Update\nhttp://www.google.com/url?sa=D&q=https%3A%2F%2Fsupport.google.com%2Fpixelphone%2Fforum%2FAAAAb4-OgUs4BAWdGPJh2E%2F%3Fhl%3Den%26gpf%3Dd%2Ftopic%2Fphone-by-google%2F4BAWdGPJh2E%3Bnoredirect%253Dtrue\n\nMy phone was destroyed by Pie update in October 2018 where it was stuck in boot loop UBreakIFix changed my motherboard back then.\n\nMy phone is now broken again in October 2019 after the Android 10 update it is stuck in a boot loop\n\nWant to know the similarities between these 2 cases?\nIn October 2018 the Pxiel 3 was being announced\nIn October 2019 the Pixel 4 was being announced\n\nIt seems quite suspicious that when they release a new phone they seem to brick all the phones with an update.\n\nThe last time it was a known issue and this time it is a known issue:\nhttps://www.androidcentral.com/android-10-update-stuck-boot-screen-youre-not-alone\n\nI have tried all methods to fix it and it seems to be stuck in a boot loop that could only be repaired by switching the motherboard. The last time my motherboard was switched for free due to the issue related to a bad solder joint causing audio issues. I was lucky last time but this time they are sure they can replace it for me again and Google is fighting this issue saying it is \"impossible\" that this is caused by the software update even though this happened with Pie Update as well and you will insist it is a hardware issue. They then claim there is no recourse for me since the item is out of warranty. Rather than help the customer they just want to force the customer to buy more of their products. When the warranties expire they will release updates that corrupt your phone and tell you there is nothing they can do and you would need to buy a new phone or new motherboard for about half the cost of a new phone. I have tried everything to rectify this boot loop and nothing has worked.\n\nGoogle you are letting us all down. What you have done twice Android Pie + Android 10 is shameful. If you search \"Android 10 Bootloop\" and \"Android Pie Bootloop\" you will find people.\n\nI am Canadian and cannot participate in the class action lawsuit and even if I could missed the deadline by 12 days because my phone broke again 12 days after the class action closed.\n\nIt is clear that you wont replace my phone an hide behind horrible excuses. Perhaps lagal action is the only action worth attempting. Or sharing the intentional destruction of devices with the media might change your mind about how you treat your customers.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-10-19T23:38:46.369781+00:00",
    "reply": "5 Replies"
}