{
    "url": "https://support.google.com/pixelphone/thread/15627590/google-pixel-all-models-have-very-bad-car-bluetooth-interactivity?hl=en",
    "title": "Google Pixel (all models) Have Very Bad Car Bluetooth Interactivity.",
    "content": "So for quite some time now I've noticed that every car I've driven has never offered me the full range of music playing options on the infotainment screens in the cars. At first, I thought that maybe it was just the cars I was driving at the time not being too great with Bluetooth on Android devices (iPhones seemed to always have this feature in my cars and it made me jealous of my friends a little from time to time). \n\nHowever, 3-4 cars down the line I find myself still stuck with this problem of only having the options of \"Next Song\", \"Previous Song\", \"Pause / Play\", and that's it. I thought the problem would then be that I was using Spotify instead of the phone's built-in music players; so I have switched from Spotify to Google Play Music as I currently use a Pixel 2 XL. This also hasn't fixed the issue though as I am still only given the same options. \n\nBut when two of my friends got in my car I let them connect their phones to cars to play music and oddly enough, they had a lot more features than I ever have with any of my Google phones. Both of my friends were able to shuffle, repeat, browse playlist and queue, and also select other playlists entirely. Those friends have a Samsung and an iPhone, meaning both Android and Apple devices are capable of the technology. It just seems that while I am very impressed with my Google phone so far, they are also very basic in terms of quality of life aspects. \n\nI'm here to ask if anyone knows any workarounds or ways to improve the features that a Pixel gives off as a media player when connected through Bluetooth? \n\nCheers.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-09-29T20:18:09.394952+00:00",
    "reply": "1 Reply"
}