{
    "url": "https://support.google.com/pixelphone/thread/15953519/pixel-3-screen-is-always-off-after-freezing-but-the-phone-is-working?hl=en",
    "title": "Pixel 3 screen is always off after freezing, but the phone is working",
    "content": "During a phone call I opened the \"Easy Voice Recorder\" app, then clicked the \"Record\" button (at that time I didn't know that this app doesn't support recording phone calls on Android 10), then the app displayed an error message that it couldn't use the microphone, because it's already in use, however it started recording. When I finished my phone call, I clicked \"Stop recording\" button in the app, and immediately screen turned off. From this moment the screen doesn't work. The phone partially works: alarm rings every morning, but it doesn't respond to calls. The touchscreen works, the phone vibrates when I draw a pattern on the locked screen's surface, but the display is off.\nRecovery attempts:\nI tried restarting the phone by holding the Power button. It didn't help.\nI tried to boot it in Safe mode: I press the Power button, then click on the screen (where the OK button of the confirmation dialog should be located), the phone restarted, but it didn't help.\nI restarted the phone to the 'fastboot' mode (Power + Volume Down). The screen is black. I can use 'fastboot' tool via USB, but it's useless, because debug mode is not turned on, and I can't enable it without a picture on the screen.\nFrom the 'fastboot' mode I can go to 'Recovery' mode. The screen is black. I can use ADB tool via USB, but I wasn't able to run Factory reset or switch it to the 'Sideload' mode (which I could use to flash a full-OTA image). I tried different sequences of Up/Down button presses, but ADB returns an error: adb: sideload connection failed: closed\nadb: trying pre-KitKat sideload method...\nadb: pre-KitKat sideload connection failed: closed\nTo understand what's currently displayed on the turned off screen in recovery mode, to help me navigate through its menu, I tried to take a screenshot by ADB tool, using the script that I found on the XDA forum (it loads current image from the frame buffer). It didn't work.\nPhone info:\nAndroid Version: Android 10, with a September's update\nBootloader Version: b1c1-0.2-5672671\nBaseband Version: g845-00048-190722-B-5745561\nSerial Number: 8ACX0____\nIn use: less than 1 year\nPhone is unlocked\nDebug mode is OFF\nI would appreciate any ideas.\nI don't know if I can send it for repair (it's under warranty and is not damaged), because I'm currently in Belarus. Can I send it for repair to the USA or another country?",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-10-03T20:50:47.208792+00:00",
    "reply": "0 Replies"
}