{
    "url": "https://support.google.com/pixelphone/thread/92304612/send-recieve-mms-without-data-bug?hl=en",
    "title": "send/recieve mms without data bug",
    "content": "I believe there is a bug in Android 11 with the Pixel 4a (and possibly other Pixel phones). It's to do with the feature found in your mobile network settings called \"Send/receive MMS when mobile data is off\".\nSee photo:\n\n\nWhat happens is this:\nWhen the feature is enabled, and you send or receive MMS, the phone enables your mobile data for EVERYTHING, but does not tell you it will do this, nor does it enable the switch for mobile data on the same settings screen seen in the photo above.  Your apps that use data will immediately begin to use data and notify you as if you had manually turned your mobile data on.  It remains in this state for many hours, and possibly until you turn it off.\n\nThis is how you test it (assuming your phone plan has data):\n1. disable mobile data\n2. disable wifi\n3. verify and ensure that data is in fact off by testing internet access\n4. verify the \"send & receive MMS messages when data is off\"  function is turned on\n4.5 verify that RCS chat features are turned off in google messenges and has been off for at least a few minutes.  restart messenges app possibly as well ( i don't use that feature at all and this step might be redundant)\n5.  send an MMS message to a contact using google messages\n6.  verify that data has been turned back on by trying an app or browser (but settings menu shows data off)\n\nBefore you jump to conclusions and say \"but data needs to be on to send MMS\" this is not true, you can plainly see the function is there, and other phones from other brands have had this function for years despite not having the toggle switch in the settings menu. (Realme X2 was the most recent phone I've seen that can send/receive MMS without data on).\n\nLastly, please read the steps above carefully and perform them EXACTLY how I have outlined to test this \"bug\". Most people I've asked either miss a step or don't do them at all. In fact, there's a few threads started here about this issue but none have tested it in this way and all threads are locked for some reason since the issue never gets resolved.\n\nAnd yes I've reported this scenario through the feedback function 3 times, once a month since I've had the phone after each monthly security patch since October, on Android 11.",
    "is_img": 1,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 4a",
    "post_time": "2021-01-06T17:36:14.668125+00:00",
    "reply": "4 Replies"
}