{
    "url": "https://support.google.com/pixelphone/thread/7790045/pixel-2-xl-does-not-work-with-oem-charger-and-most-power-delivery-usb-c-chargers?hl=en",
    "title": "Pixel 2 XL does not work with OEM charger and most Power Delivery USB C Chargers",
    "content": "Hello, \n\nAbout 3 to 4 weeks ago my Pixel 2 XL stopped working with the OEM chargers. I have 3 OEM chargers, and they all stopped working at the same time. When they are plugged in the phone does not recognize them, however they work perfectly with any other USB C device. \n\nThe phone also no longer connects regularly to my laptop via USB C when Power Delivery is enabled on the port. This was another symptom that points to a software issue specific to Power Delivery. It also makes updating the phone via the laptop and adb very difficult. My Phone constantly crashes when plugged into my laptop or 3rd party USB C chargers if Power Delivery in enabled from that source. I have tried cables numerous different brand and quality of cables and the behavior remains the same. If a USB C charger does not use Power Delivery the phone charges, however not rapidly.\n\nAnother strange aspect, but I cannot pin down if it is random or there is a pattern is how Power Delivery chargers work. When I use a charger type for the first time all seems well, power delivery or not. However subsequent attempts with that charger will fail. AN example of this was using the USB C port on the back of my LG monitor. It worked yesterday while I was testing, however when I attempted to use it today it did not work and my phone shutdowns immediately when it's plugged in. The same behavior has been seen with my mac book pro charger and my ZEROLEMON or AUKEY desktop chargers. \n\nI can get my phone to work with a USB C charger/port with Power Delivery randomly, however the majority of times it crashes. When it does crash it goes to the block screen, flashing the charging icon (with the bolt) repeatedly until unplugged, it cannot be started while it remains connected. Once unplugged it shows the battery symbol with the current charge and turns off, at this point the phone can be restarted as normal. \n\nUSB A to USB C is fine for the most part. USB C to USB C without Power Delivery is fine however, even with these chargers the phone does crash randomly. That means alarms are now useless because on a few occasions I have woken up to the phone in a powered-off state, because it crashed overnight while plugged in (USB A to USB C). I have tested this numerous times, with numerous chargers. All theses changers still work fine with any other devices that support USB C and Power Delivery. \n\nThis behavior began after the May update and it would seem this is a software issue and I am trying to figure out how to get it properly escalated so it can be fixed.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-06-10T22:27:35.959401+00:00",
    "reply": "7 Replies"
}