{
    "url": "https://support.google.com/pixelphone/thread/70179081/pixel-4a-touchscreen-sensitivity-with-screen-protector-android-11?hl=en",
    "title": "Pixel 4a touchscreen sensitivity with screen protector & Android 11.",
    "content": "After the Android 11 update, many Pixel 4a owners (including myself) have had issues with the touchscreen sensitivity. Scrolling through apps is difficult and causes \"phantom presses.\" Navigation gestures are often unresponsive or erratic. Gesture-based keyboards are nearly impossible to use.\n  https://reddit.com/r/Pixel4a users have been documenting this issue, & they have determined that the only current fix is to remove the screen protector from their 4a. This issue did not exist on the same phones with the same screen protectors when running Android 10. Some sort of screen sensitivity setting has been changed on the Pixel 4a through the Android 11 update that has made using the phone nearly impossible when a screen protector is installed. Some users also report that the issue becomes worse/more prominent when their 4a becomes hotter, like after/during charging or playing a game.\n  After the Android 11 update, the Pixel 4 has a touchscreen sensitivity toggle in the settings to make the phone work better with screen protectors. The 4a doesn't have this toggle, but is it possible that some software changes made on the Pixel 4 carried over to the Pixel 4a, causing this issue?\n\nAgain, as of right now, the only \"solution\" discovered for this issue is to remove the screen protector (or to downgrade back to Android 10). The following \"fixes\" were tested without success by multiple Pixel 4a owners on r/Pixel4a:\nReboot (sometimes seems to alleviate the issue, but doesn't fix it permanently)\nSafe mode\nClearing cache of different apps\nChanging accessibility settings\nFactory reset\n\nI'm posting this not as a plea for help from community members (though, I'm sure you're all lovely people), but more as an attempt to ensure that Google is made aware of this issue, as it is clearly something that can only be solved by a software update pushed to Pixel 4a devices.\n\nNon-exhaustive list of threads of Pixel 4a owners discussing the issue on r/Pixel4a & r/GooglePixel:\nAndroid 11 Touchscreen Sensitivity Fix(?)\nAnyone else having issues with touch responsive after update?\nAndroid 11 Touch Sensitivity Issue - Caused by Screen Protectors?\nTo update to 11 or not?\nCan someone make a downgrade tutorial?\nTouchscreen issue after Android 11 update, i was touching the screen continuously but after a while the phone start registering it as multiple taps\nDo not update to Android 11 yet\nGestures/swiping and ads\nTouch screen sensitivity\nTouchscreen Issues",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2020-09-10T02:23:55.55195+00:00",
    "reply": "4 Recommended Answers"
}