{
    "url": "https://support.google.com/pixelphone/thread/70683858/forced-screen-rotation-after-android-11-update?hl=en",
    "title": "Forced screen rotation after Android 11 update",
    "content": "Ever since the Android 11 update, many apps (mostly games) that are supposed to be displaying in Landscape orientation ONLY, somehow intermittently glitches and force rotates the app into Portrait orientation. This happens randomly during normal usage and without any triggers (phone was stationary in Landscape orientation during normal usage).\n\nUpdate (13/9): It has been noticed on several occasions that unplugging the device from a power source may trigger the forced rotation. Thanks to @Adavid for highlighting! \n\nOnce this happens, the wrong orientation \"sticks\" and physically rotating my device (gyroscope) or toggling the Auto-Rotate setting does not work to return it to its rightful orientation. There is also no manual \"rotate\" button on the bottom next to the home button when rotating my device.\n\nWhen the forced rotation happens, the image is disproportionately resized (length is severely compressed and width is severely expanded) but the app continues to function.\n\nForce quitting and restarting the affected app does not revert it and it instead launches into the wrong orientation from the get go.\n\nI have also noticed applications that can rotate and display itself upside down which I don't think has ever been possible prior to this. For these cases, they can Auto-Rotate to it's correct orientation without issue.\n\nGoogle Support recommends clearing the storage and cache of Pixel Launcher (Settings > Apps and Notifications > See All Apps > Pixel Launcher > Storage and Cache > Clear Storage and Clear Cache).\n\nHowever, Google has no guarantee that this will resolve the issue completely. As this issue occurs intermittently, I am unable to reproduce the exact scenario to see if it has been resolved. I have sent feedback about my phone to the engineers with the logs.\n\nWARNING: Be reminded that the above troubleshoot method clears the entire home screen of your device and you will need to manually add your apps back to your home screen one by one.\n\nI am rather annoyed that Google Support did not warn me about this when they recommended this troubleshoot. In the end, I came to them with a problem and they gave me another arguably worse problem of wrecking my home screen preferences.\n\nYet another example of Google's poor QC.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a",
    "post_time": "2020-09-12T12:10:54.838722+00:00",
    "reply": "3 Recommended Answers"
}