{
    "url": "https://support.google.com/pixelphone/thread/68947010/regarding-repair-of-google-pixel-2xl-by-b2x?hl=en",
    "title": "Regarding repair of Google Pixel 2XL by B2X",
    "content": "Sir, ma'am,\nThis is regarding my google pixel 2xl, with which I was facing some problems relating to the USB port in July 2019. My complaint was that the headset and charger USB cable getting disconnected abruptly while being used and that I could hear the noise as if the port was rusted while attaching and detaching the cable from my phone. My complaint was addressed when a B2X service engineer came to my place and cleaned the USB port there itself. I told him about the same and he said that the cleaning would work, and it did for a temporary basis. But after a month or so the problem was still there with the charging function, as I had to keep my phone in one position while it was being charged, I thought that the issue was due to some problem in the cable and thus didn't bother much. But then suddenly after sometime in August 2020. My phone stopped charging completely with the OEM charger and cable, and even the Headset dongle wasn't working. I registered a complaint and my fone was sent for repair outside the warranty, costing me about Rs. 2100/-. As stated in my complaint this time the fault was written as \"corrosion in a USB port\".\nHad my issue been taken seriously the first time, when my phone was under warranty I could have been saved from this extra spending and the hassle of going through the process, again and again, I am a layman and not an engineer myself to diagnose my phone for the issues and problems. It is your job to provide me with that service, at which you have failed. If the issue had been taken seriously the first time I indicated it was not working well!I don't know whether it was your lethargy or incompetence, but it has cost me. My phone is currently under repair at the B2X center in Mumbai, and I am attaching my service id for this time and also for the previous time. Hoping that you would take this issue seriously now.\nYashdeep Singh Ahluwalia",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-09-04T03:09:48.506459+00:00",
    "reply": "1 Reply"
}