{
    "url": "https://support.google.com/pixelphone/thread/13718086/what-s-is-the-escalation-after-india-pixel-escalations-google-com?hl=en",
    "title": "What's is the escalation after india-pixel-escalations@google.com ?",
    "content": "Hi Team , \n\nMy pixel 2 restarts whenever battery is low, I logged many ticks but due to below reasons they cancelled my tickets \n\n1 ) Pickup hour are 9 am to 1 pm.... usually people go to work between thses times. ..no option for pickup in evening ...and Sunday aswell.\n\n2) Your loaner mobile(nexus) doesn't support my sim- Airtel H2 , I don't know why ??? Coz it's a normal sim.\n\n3) Every time the schedule get cancelled and I need to book it again ...no option to reschedule it .\n\n4 ) Everytime I call to support person he doesn't have slots which are suitable to me.\n\nWith almost 7-9 calls and 4-5 pickup request ...I just no where ...till now ...coz I need to book an other request ... \n\n\nNow they gave me below reply , no slots are available also no loaner mobile they have ...\n\nOn Thu, Sep 5, 2019, 4:18 PM <store-support@google.com> wrote:\n Hi Himanshu,\nThank you for contacting Google Support Team.\nI understand that you want the device to be picked up on Saturday. \nI tried contacting you on your registered phone number but your number was busy. We checked our resources and found that we do not have a slot available for device pickup via Field Service Technician as of now, so we can only arrange for a pickup via the mail-in process. In mail-in, the device is picked up and delivered by our courier partners and no loaner device can be provided for the same. Also, the turn around time for the mail-in process is 15 business days. Please confirm, if you agree for the device pick up via mail-in process, so we can create a new service request.\nAwaiting your response.\nThanks!\nTarun\nThe Google Support Team",
    "is_img": 1,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-09-06T12:23:12.938451+00:00",
    "reply": "1 Recommended Answer"
}