{
    "url": "https://support.google.com/pixelphone/thread/38921906/please-bring-vowifi-provisioning-setting-switch-to-all-pixel-devices-on-all-carriers?hl=en",
    "title": "Please bring VoWiFi provisioning setting switch to all Pixel devices, on all carriers",
    "content": "Hello,\n\nI understand that Google team will systematically give an answer like \"It depends on your carrier\" etc., but the fact is, it can be triggered on user's side by modifying some settings with root permission. Of course I contacted my carrier about that and they said the service is enabled on my line, and normally with that devices from OnePlus, Xiaomi or even Samsung can work with minimal software modifications (no root). I know you consider it as an non-essential feature, however, for the time being, many carriers are using cell towers to illegally collect user's movement data without consent using the pandemic as an excuse, which makes me feel totally uncomfortable and not safe. That's why I need VoWiFi so that I can turn off cellular radio on my phone and still be able to call & text using WiFi. So, I don't hope that Google can make things easy like on iPhone, but please, at least give users a simple setting switch, with a warning about risks of non-compatibility on uncertified carriers.\n\nI don't know why but every iPhone has it working on any supported carriers, no matter which resellers or original carriers do they came from. Everything is simple and it works. I know there's a lot of differences between two platforms, but as I mentioned above, it can be modified by software, so why don't you let users have their choices? I thought it's the main point of Android over iOS? I love Pixel phones as well as Android but if things regarding very basic features (voice call) and privacy like this don't change, I'll probably have to switch to iOS.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth",
    "post_time": "2020-04-09T12:36:03.507781+00:00",
    "reply": "1 Recommended Answer"
}