{
    "url": "https://support.google.com/pixelphone/thread/72808263/pixel-support-beware?hl=en",
    "title": "Pixel Support: Beware",
    "content": "This post has two purposes: \n1. See if anyone has any suggestions on how to get out of the mess I'm in with Google support\n2. Document somewhere online just how dreadful the support system is at Google in the hopes of trying to persuade others to either not purchase from Google and certainly to think twice before returning a phone for support\n\nI bought a Pixel 4XL in November 2019. By the summer of 2020 it was starting to randomly shut off because of overheating (or so it would tell me when it rebooted) despite being in very normal environmental conditions. I contacted Pixel Support and they said I could send it in and they would evaluate it and potentially replace it. I was hesitant to go without a phone for some time but they assured me the whole process would only take 5-10 days. They gave me a label and I mailed it on Sept 19th, 2020. They received it a few days later, per the tracking number. Five days later, I contacted them again through the front door support line and they told me the phone would be replaced but that because of stock issues, they didn't have a replacement to send me. I asked when a replacement would be available and they simply said to wait. \n\nThis went on for two weeks such that, by the end of that period I asked for my old phone back. It wasn't clear when they were going to get new stock since the Pixel 4XL had been discontinued in August and no one I could reach was ever able to get me an answer. While I floundered to get them to send me my phone back (various agents, since I didn't have a single point of contact, would just tell me to wait, that the case had been escalated, that they couldn't help me, etc), they sent me a replacement device. In the email, it suggested that the device was refurbished. I asked one of the agents about this because I didn't realize that that was the industry norm and would have wanted to consider, again, just getting my own phone back. She told me over the phone that it wasn't actually refurbished but that it just showed up that way in the email.\n\nA few days later, the clearly refurbished phone arrived. I turned it on and was immediately met not with a normal boot screen but with an error screen (see photo) that said \"Your device is corrupt. It can't be trusted and may not work properly.\" I contacted them immediately to report this and, for over a week now, I've been stuck trying to get someone to help. Their attempts at a solution have varied but their latest is that I bring the refurbished phone (which they now refer to as \"your phone\") into a local repair shop that they have a partnership with. It has been over 5 weeks since I sent my phone to them and I have put an embarrassingly large amount of time trying to resolve this. This phone is corrupt and it erodes at my trust with all refurbished devices, frankly. What's more, they're expecting me to spend a bunch of my time making up for their defective original device AND defective replacement device.\n\nI think this is mainly a failure of product support and the post-sale side of their business. It seems to be purposely difficult to reach someone who can resolve the issue (\"supervisors only communicate through email\", the associate who does follow up on emails seems to switch every day, the people on phone and chat can't seem to escalate to anyone in a timely fashion). I've literally been told that this has been escalated over 10 times. They have now had my phone for about 15% of the time that I've owned it. Frankly, I'd be happy to just have my original phone back but they're claiming that this too is impossible. \n\nThere seems to be no recourse in a situation like this except to vote with one's *next* purchase. \n\nAppreciate if anyone has any advice and, for Google agents monitoring these threads, yes: it has already been \"escalated\". ",
    "is_img": 1,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-09-23T14:06:25.597714+00:00",
    "reply": "5 Replies"
}