{
    "url": "https://support.google.com/pixelphone/thread/1707274/pixel-3xl-android-auto-can-t-hear-voice-commands-after-ok-google?hl=en",
    "title": "Pixel 3XL Android Auto can't hear voice commands after \"OK Google\"",
    "content": "Audi MMI 3G (2014):  I connect via bluetooth as a handsfree AND media source, Android Auto launches automatically, I say \"OK Google\" and the four-color drop-down appears, but then it can't hear subsequent commands from me.  the drop-down then displays \"Try saying 'what can you do'?\" for a while then gives up while I yell anything at it.  What is going on?\n\nFor reference, same procedure above using an Xperia XZ2 running Pie and latest Android Auto works perfectly fine - hears commands and plays on car speakers set to bluetooth media.\n\nI have tested Android Auto on the Pixel 3XL on other bluetooth headsets and voice commands work fine, though audio comes through in much poorer quality than the music - maybe that's the age of my bluetooth speakers? Or Pixel 3XL Android Auto is using some other profile?\n\nSo the Pixel 3 is doing something strange via bluetooth and android auto.  Another thread pointed to being able to turn off HD for certain connections in Oreo, but those options aren't in Pie anymore.\n\nJust using the Google Assistant normally via bluetooth outside Android Auto is a bit buggy - it takes two squeezes to get it to listen to me, but when it does hear me it responds via the car speakers.\n\nWhat is going on?\n\nI am not an expert in Bluetooth profiles, but it feels like once you say OK Google it is switching to handsfree profile but the car mic is not active.  These are older bluetooth head units that have separate phone and media profiles.\n\nHow come Sony has figured this out?\n\nIs there an app that lets me control individual bluetooth pairing audio quality?",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel 3 XL",
    "post_time": "2019-02-18T01:42:45.529591+00:00",
    "reply": "8 Replies"
}