{
    "url": "https://support.google.com/pixelphone/thread/22375080/pixel-3-xl-lte-connection-keeps-restarting-rma-d-device-new-one-resolved-issue?hl=en",
    "title": "Pixel 3 XL LTE Connection keeps restarting (RMA'd Device, New one resolved issue)",
    "content": "I'm hoping someone has seen this and knows the solution.\nI have a Pixel 3XL, bought Nov.`18. Unit has a case, never dropped outside, it's in immaculate condition.\nA few weeks ago, I noticed the LTE Connection would restart every 8 to 12 seconds (going from LTE - LTE+, back to LTE)\nI did a ton of things (restarted device, safe mode, Factory Reset with stock setup (no backup) and even did a Factory Image restore of Android 10 from September)\nNothing has resolved this issue. The case has been removed, a different SIM Card was purchased.\nEven when changing the connection to 3G, it changes from HSPA - to 3G every 10-15 seconds. I've disabled VoLTE and even used the phone after factory image restore, with a new google account (to make sure no settings were copied over from previous install). Checked APN settings, all good there. I've had every PIXEL phone on my carrier (Rogers, in Toronto) without any issues like this.\nWifi calling is Off/ phone updated to December Android 10 Build.\n\nVideo of LTE Connection:\nhttps://streamable.com/zsylg\n\nAt this point, I am thinking hardware.\nDoes anyone have any insight into why this would just start randomly in November? I see others have had this issue without a real solution.. If a full factory image restore (from September, Android 10 build) won't resolve the issue, it must be a hardware issue. Can this be escalated to Google Engineers? I have called Google Support, but they cannot help. This needs to be escalated through the proper channels somehow.\n\n------------------------------------------\nUPDATE:\nGoogle sent me another device since mine was in warranty, and the new device works perfectly. So as I suspected, this is a hardware issue and Google needs to look into this because a lot of people are experiencing it.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2019-12-09T16:58:24.5727+00:00",
    "reply": "0 Replies"
}