{
    "url": "https://support.google.com/pixelphone/thread/106041640/google-support-refund-offer-rescinded-case-id-4-1340000030631?hl=en",
    "title": "Google Support Refund Offer Rescinded - Case ID [4-1340000030631]",
    "content": "Hi All, \n\nI'm starting the process of making this full exchange public due to the grossly negligent anti-consumer behaviour I've experienced from Google Support. Long story short - due to a defective Google Fabric case my brand new Pixel 4a glass shattered from a drop of approximately a foot. The new design has a gap where the mic insert which causes the top left corner to pull back with ease - lending no protection for a drop. It just pushed back with the slightest touch. \n\nI had an exchange with Google Support starting on November 2nd, 2020. Twice I was offered a refund on the case after investigating images. Here are their responses verbatim committing to the refund and admitting fault: \n\nNovember 10th, 2020: \"I have checked with my higher specialist team and got an update that as the device got cracked accidentally due to Google fabric case which didn't fit, we can only go ahead and help you with an exception on Google case.\"\n\nThis was after a round of very detailed photos highlighting the very clear issue with the top right corner of the case. I wasn't happy with the resolution as admitting the case was defective in turn suggests the damage to my phone is the fault of Google. After requesting more photos for a 'deeper' investigation by the support team I received this reply: \n\nDecember 1st, 2020: \"We have got an update from the team post investigation and was advised for a refund of case. However, as we have mentioned earlier any accidental or physical damages will not be covered under warranty and the screen might have got cracked due to the angle, surface and other variations that have got it cracked.\"\n\nThis is where I started reaching out to a lawyer in the family and they suggested I start requesting additional information, and acknowledge receipt of replies as they come in, and push for refund or coverage of the screen repair costs. Sounds pretty simple, not a lot more money for Google to push out for a lifetime customer that has spent thousands on Google products for personal and business use. This is when Google Support went dark, on December 10th, until I followed up on March 24th, 2021 - figured I'd give them some time, and see how long it would take for them to reply after saying the 'will get back to you shortly with the further information'.\n\nIn the interim I reached out to my telcom provider and received an estimate to repair the screen of $75CDN. So I reached out: \n\nMarch 24th, 2021: \"We haven't received an update since December 10th, 2020. Can you please confirm your best offer is to replace the case or refund the cost of the case rather than cover the repair cost (estimated at $75).\" \n\nThe reply I received dropped my jaw to the floor: \n\nMarch 25ht, 2021: \"I've reviewed your entire support interaction history. I want to sincerely apologize for any inconvenience caused. As physical damages are not covered under warranty, the repair will be charged. Also, we would not be able to refund the repair cost or the case cost.\"\n\nNext, I followed up, pasting in the several times the support team offered a repair for the case, and admitted fault / confirmed it didn't appear to fit (it did not fit properly). I received this reply: \n\nMarch 26th, 2021: \"Thanks for writing back to us. I'll look into the refund options for you. Please help me with the Google store order id to assist further. It starts with GS. Awaiting your response.\" I was out of the house due to a family health issue so I had a lapse on my end - they followed up with below.\nApril 6th, 2021: \"For me to proceed with the refund, your account must be authenticated. Please help me with the best calling number and preferred time so that our team can call you to authenticate the account.\"\n\nNext we had a back and forth where I was asked to set aside some time for Google Support to call me to verify the account - which I thought was odd as the email is connected to the purchase order. They called and verified my information and I was told on the phone they would proceed with the refund to the payment method used. Google Support emails me to confirm the same: \n\nApril 8th, 2021: \"I see that the account is authenticated. I'm now in touch with my team for the refund options. I\"ll get back to you with an update in next 24-48 hours.\nThanks for your patience.\"\n\nI start thinking - great, finally some closure after 6 months of exchanges with Google Support. After requesting two batched of detailed photos, stringing me along, admitting case defect, offering refunds on several occasions. I decide I'm okay eating the repair if I can get the cost of the case back as I'm certainly not going to use it again.\n\nThen, this comes in:\n\nApril 9th, 2021: \"I've checked with my team. I'm sorry to inform you that we'll not be able to refund the phone case charges as per our terms and conditions. I do apologize for the inconvenience caused. For the miscommunication earlier regarding refund, I'll add $15 Google store credits to your account. We would like to get your acknowledgement regarding the matter below to add the credits. For a limited period of time necessary to resolve your customer support issue, you agree to allow Google customer support to access data about and associated with your Google product and account, which may include product information such as IMEI, Serial Number, country in which your product was purchased, account history and limited historical usage data. The data accessed will be used to improve your customer service experience, to troubleshoot issues with this product, promotion history and for fraud prevention. Google will handle this data as described in Google’s privacy policy. Kindly response with I CONFIRM or I ACKNOWLEDGE in order for us to proceed.\"\n\nSo here we are. 6 months. Refund offers. Google Support admitting fault. 3 month delay in reply. New offer to proceed with refund and verification process, then this. I almost feel like I'm getting trolled. The final offer is $15 tied to a request to access all of my data tied to my device for a limited time. \n\nSo here's where I'm headed next. I've been told by legal counsel I have more than enough to proceed with a grievance and claim. I'd love not to do that. It wouldn't cost me anything but my time, but I value my time, and Google has taken enough of it, but I will proceed if I have to out of principal for other consumers in the hopes this won't happen to another (I can dream). Aside from that, barring Google making good on their multiple refund offers, I'll be taking this to Reddit, etc., with full transcript so it's on the public record for others to see for information purposes - to help inform folks re: making a decision to purchase a Google product in the future knowing how their support team operates. \n\nBeyond that, it turns out I went to school and worked with some Google employees based in Toronto that are interested in hearing more about this. I was told I couldn't escalate this further, but those outside of Google Support at Google have asked for the case ID and more information. \n\nSO. Here's to hoping something changes. I've been a Google fan most of my adult life. I've brought many over to the fold. I have a Nest, Google Home, business accounts for my consulting business (which is marketing research by the way, many years spent ironically helping companies improve their customer service process), a Pixel, Pixel 2, and Pixel 4a. We have 3 Fitbits. Depending on how this all pans out, and I don't have high hopes for a positive outcome, we're ditching it all. The recent releases around Chrome privacy handling doesn't help either.  \n\nStay safe out there everyone. Be kind to each other. Look out for each other. ",
    "is_img": 1,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-04-13T14:26:45.087618+00:00",
    "reply": "1 Reply"
}