{
    "url": "https://support.google.com/pixelphone/thread/81592823/google-rma-received-empty-box-from-me-when-i-shipped-the-phone-been-trying-to-resolve-2-months?hl=en",
    "title": "Google RMA \"received empty box\" from me when I shipped the phone been trying to resolve 2 months",
    "content": "I had a pixel 4XL and the charging port began to stop working. One night I plugged in the charger like normal and the phone began vibrating like crazy and didn't charge again. I was deemed eligible for an RMA.\nI got the label and everything sent to my email, the only thing is I didn't have time to print out the label and ship the device until like a month after because I was working from 9-9 like everyday of the week (self-employed). I found time around a month after (I got the labels on August 14th) and ended up printing the labels and shipping it on September 9th. Only afterwards did I read the email and realize it said that you have to ship it within 14 days. So I freaked out and contacted google customer service and told them what happened, but they told me that it would be alright, and they would process it like normal and there was nothing wrong. The phone was delivered the day after and I got the UPS Delivery Notification, but I became worried because I didn't get any sort of indication from google that they had received the device. So again I didn't want to lose like a $1000 phone, I contacted google support and they just told me the standard \"5-10\" business days. I was still worried because they had not indicated to me directly whether they had received the device or not so I decided to try my luck again, and once again I received the exact same response of \"5-10\" Business Days. So twice I tried my luck and they didn't give me a direct answer. Basically told me to shut up and wait ten days. So I did and didn't bother asking them again hoping I would get the device on the 10th day.\nI contacted them on the 11th day saying I hadn't received the device, and they told me they had \"launched an investigation with their shipping provider\". They stalled me for another 4 days upon waiting for the investigation. Finally on the 5th or 6th day they contacted me saying that they had received an empty box. As in a box with no phone in it. I was soo angry that they made me wait this long for the result to be this.\nI had the shipping Label with the proof and everything. The shipping label clearly said that the package weighed one KG when it was shipped, and that it was signed and received by a google employee at the warehouse. I contacted google with this information but they tried to get me off their backs by saying \"Contact the shipping company that you used.\". So guess what? I did. UPS made it clear to me that I couldn't do anything whatsoever because I technically wasn't the shipper (The labels were from google). They told me to get in touch with google and to tell them to file a claim with UPS.\nNow I've emailed them and called them back and forth for 2 months trying to tell them to do this, but they keep on throwing it off. One email literally said this in response to me telling them to file a claim with UPS. \"We can confirm that the box was received empty and thus in this case we will not be able to provide a replacement device.\" We had already established that like 2 months ago. At the very least if they have filed a claim I would just like to explicitly hear a customer service rep say so which I haven't so far. I just want them to file a claim so I don't have to be without a phone any longer. Apparently I also managed to reach the highest tier of support but I don't see anything being done there either. Most of my interaction so far has been stuck on the \"waiting for updates\" stage.\nI visited the UPS location that I shipped it from and the guy literally told me that assuming the package was damaged or empty, its googles fault for signing for it, and thus they are held accountable for the package. He told me there's a very low chance that a UPS driver stole it because there are like camera's everywhere and every step of the way. He told me its highly likely that there is something sketchy going on at Google's warehouse especially because they keep putting me off.\nIts been super stressful thinking I might not get my $1000 Phone back because someone either lost it or stole it, and google wants to put it on me. I am not quite sure what to do and any help and advice would be appreciated. Thank you!",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-11-07T20:48:08.865668+00:00",
    "reply": "1 Reply"
}