{
    "url": "https://support.google.com/pixelphone/thread/8641470/does-google-even-care-about-their-customers-anymore?hl=en",
    "title": "Does Google even care about their customers anymore?",
    "content": "Loyal Google customer since the Nexus 5. \n\nI bought a brand new pixel 3 from Google directly, a few months ago. Since I received it, the thing gets unbearable hot when charging and turns off from over heating. I've dealt with it since I don't use my phone excessively. I don't own many electronics at all, that's why springing for the newest model phone as a birthday present for my self was such a big deal. All of a sudden last week, it stopped detecting my blue tooth devices. \n\nI contacted Google because I had tried everything short of a factory reset and was hoping I wouldn't have too. First I tried the chat. The guy would not help me at all, he stated it was \"required\" for me to provide a picture of my phone. He would not accept the answer \"I can't take a picture of my phone with my phone and it's my only camera \" in fact he just kept repeating himself. I tried calling two separate customer service numbers and both times I was met with the same roadblock. I'm at the point where I'm not willing to jump through hoops.  When I asked to speak to their supervisors, I kid you not, he said \"I would need a picture of the phone to escalate this to a supervisor. Eventually one guy helped me with my Bluetooth connection, had no idea how to fix it and suggested a factory reset, the thing I was trying to avoid. After also not helping me with the over heating problem, he had the audacity to say, \"well, we at least fixed one of your issues, correct?\" They wouldn't even consider looking into my the heating issue. The worse part, I backed my phone and pictures properly, I know I did, and yet the factory reset didn't back up anything that was saved on my phone. I am a rock climber and lost hundreds of dollars of pictures and videos I can't get back. I backed up my phone and each individual picture album. And yet even my messages app has no messages in it from the last two days. This is absurd. The phone came brand new and barely fuctional, yet Google doesn't seem to give a crap. \n\nSince when did Google stop caring about us? I've been a loyal customer since the Nexus 5 and Google fi customer since it's inception. \n\nIt seemed to happen around the time they removed the credo \"do no evil\" and started taking on govt  military contracts. \n\nAt this point, I will not spend another dime on a Google phone. Not worth my money. Now I have a 900 dollar brick. I've never been more upset at customer service in my life.",
    "is_img": 1,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-06-24T20:50:24.674561+00:00",
    "reply": "3 Replies"
}