{
    "url": "https://support.google.com/pixelphone/thread/110853253/smart-lock-trusted-places-not-working?hl=en",
    "title": "Smart Lock \"Trusted places\" not working",
    "content": "I am trying to use Smart Lock to keep my device unlocked at home.  'Trusted places' setup appears normal but does not keep the device unlocked.  'On-body detection' and 'Trusted devices' are working properly but not useful in my application.  My location shows accurately in Google Maps and Google Earth.  Things I have already tried include changing the Home label and changing it back again, deleting and re-adding the Trusted place, using the current location as a Trusted place, using only a single Google account on the device, Wipe cache partition, reset app preferences, confirming that Google and Maps have location access allowed all the time.\n\nI also have a Samsung Galaxy Tab A7 (using the same Google account) that has the same issue.  My friend has a Pixel 4a (5G) and a Samsung Galaxy Tab A7 (using a different Google account); both also have the same issue.\n\nEdit:\n\nI did some additional testing from a location a few miles from home.  I set it as Trusted, but the phone will not stay unlocked, even without moving it at all.\n\nAlso, I attempted to set Home as Trusted on an old Moto G5 Plus running Android 8.1.0.  This also failed, even though it had worked at one time.\n\nSo, I believe that I have ruled out the device, the OS version, the specific location, a general problem with Smart Lock, trouble determining the current location, and permissions.\n\nMy guess is that 'Trusted places' has somehow been disabled for my Google account, but my friend has the same issue and there is a similar post today\nhttps://support.google.com/pixelphone/thread/110904280/smart-lock-is-not-working\n\nI'm out of ideas.  Please help.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 4a (5G)",
    "post_time": "2021-05-23T01:14:06.586707+00:00",
    "reply": "1 Recommended Answer"
}