{
    "url": "https://support.google.com/pixelphone/thread/56080505/google-pixel-4-at-t-device-accidentally-factory-reset-than-24hrs-after-changed-google-pword?hl=en",
    "title": "Google Pixel 4 (AT&T) - Device accidentally factory reset < than 24hrs after changed google pword",
    "content": "I stupidly (or someone intentionally) screwed up screen lock on device (Android) required at startup (pword, not a PIN or pattern), after having just changed underlying Google account pword (only this Google account on only this device - no, I have not logged in from another device, trusted or otherwise, that will allow unlock or Google pword reset).  \n\nI have provided beyond sufficient information about myself, the account, the device, the dates, the original Google pword, etc., etc., to account recovery to allow me to access Google account (without which no Protonmail, no VPN, no reset codes, etc., life falls to sh-t, lose job, don't ask)...Why, when I know correct Google pword, and have 2 fac turned on, is there no way to recover Google account? Especially when the only google account (except perhaps very briefly this one) was ever on device (and same issue as Google authenticator/original b'up codes on device for that also). \n\nPlease help me get my life and job and sanity back.  Attaching screen shots of screen and greyed out top option plus fact that I cannot get to settings on device and get one time code (nor log in elsewhere to do same).  It's literally a phone that's barely past 90 days old and cost A LOT. AT&T kicks to Google. Google has automated Covid-19 line and algo support apparently to mock people in my situation. ARGH!\n\nThank you all for time and advice and suggestions!\n\nBest,\n\nBKH - a very frustrated, and frustrating, first time (soon to be last time, if this isn't redressed given consequences to my life, and YES, it was most likely due to HUMAN ERROR ON MY PART, but doesn't deserve expulsion) AT&T, Google Pixel 4, and Google user).\n\nPS Last time something similar happened a friend who was working at YouTube sent one internal email and recovered my account in 24 hour, he no longer works there, I desperately need to salvage my account and serenity after almost one full month of being run in circles!",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 4",
    "post_time": "2020-06-29T01:05:23.862685+00:00",
    "reply": "2 Recommended Answers"
}