{
    "url": "https://support.google.com/pixelphone/thread/21292417/ref-gl0090315?hl=en",
    "title": "Ref :GL0090315",
    "content": "If you ask me to rate about the service instead of rating in positive value, i will rather rate you with negative value\n\nI purchased the Pixel device in May,2017 and with in one month there were issues and when i visited Google Service center they have replaced mother board and gave it.\n\nI have used it for 2 years and now i have raised request to get the battery replaced as i see the battery is draining faster and even facing issues with mic. But still i was able to make use of device with out any reboot of device.\n\nI raised request for battery replacement while picking up device it was conveyed that if any issues are there they will fix everything. I had crack on my lower part of display but it never affected touch screen. Since it was in Google terms and condition that If device has to pick up i have to agree upon the replacement of Display and i agreed for it and handed over my device.\n\nI was waiting for my device to arrive with fixing the issues, and surprise to see a quotation of 27K for fixing my device and when i called to customer care they mentioned that battery is draining due to some issue in motherboard. I raised my concern here that how come it can be motherboard issues since the mother board was already replaced.\n\nIf have to fix the battery issue they were suggesting to get the motherboard replaced and accept the quotation whatever they have sent to me saying no partial fix can be done(replace battery,screen and mic).\nI was ready to bare expenses for the Battery replacement, Screen replacement and mic along with service charges.\n\nI rejected the quotation since the amount that they have quoted is too much for a used device and i at least expected the device to return back in a running condition.\nThe worse thing is the device is not even switching on after i got into my hands.\n\nFeedback i can give not to Purchase Google phones in India as the service is worse if a working mobile is given to service you will return back in more worse condition.\n\nI don't understand what kind of motherboards are you guys manufacturing, with in one month of the purchase motherboard was replaced and now you say again its mother board problem and due to that battery is draining.\n\nHow should i believe you guys that the replaced motherboard in past of perfect condition one.\nPurchasing mobiles costing 50K plus and when it comes to service this is what customer gets in return\n\nI am thinking to go to consumer court about manufacturing cheap motherboards and cheating  customers by selling product with huge price and no proper support\n\nNo fool will get a device repaired with a price that you quote,customer will get a new handset.\n\nIts better not to sell the google phones in India and even i would not recommend others to purchase it as they even have to go through this phase some other time.\n\nRegards,\nSidhartha",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-11-27T11:05:15.281164+00:00",
    "reply": "2 Replies"
}