{
    "url": "https://support.google.com/pixelphone/thread/7166451/google-pixel-wifi-connectivity-issues?hl=en",
    "title": "Google Pixel Wifi Connectivity Issues",
    "content": "We bought our daughter a Google Pixel for Christmas and it has never connected to our home internet. It attempts to connect, gets stuck at Obtaining IP Address and then either disconnects or is connected with no internet.\n\nWe have AT&T U-verse with an Arris NVG589 gateway, 2.4GHz. All other devices (laptops, iPhones, iPads) connect with no issues. Pixel is updated to Android 9.\n\nThe Pixel phone connects to other wifi networks with no issues.\n\nI have tried all of the usual suspects - resetting network connections, restarting modem, restarting phone, forgetting network etc. multiple times, to no avail. I have tried safe mode and it still does not connect.\n\nI've seen multiple other posts from people with a similar problem, most of which remained unresolved. One recommended enabling MAC randomization in the developer settings, but this phone doesn't have that option.\n\nI myself have a Pixel XL which is 2 years old. When I first got it, it had the exact same issue and after multiple hours with Google and AT&T tech support, I managed to get higher level tech support free of charge. I don't remember which company it was with, but I do know that they talked me through changing some settings in my phone (I believe VPN and/or DNS, but I could be wrong as neither of those is showing anything out of the ordinary now) and it has worked ever since. Unfortunately, calling AT&T and Google support on this occasion has not been successful - they have no record of the solution to my problem, and they won't connect me to level 2 support without payment (and I'm not about to pay them to fix a problem that is none of my doing).\n\nSince I'm not super tech savvy, I have no idea what could be causing the problem and how to fix it on my own. Arris routers have been mentioned in several of the other posts, so I'm wondering if it could be anything to do with this, and could be fixed with a new router.\n\nIf anyone has any knowledge of this issue and a potential solution, I'd be very grateful!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-06-01T00:40:16.628755+00:00",
    "reply": "1 Recommended Answer"
}