{
    "url": "https://support.google.com/pixelphone/thread/53485331/brand-new-pixel-4-with-touch-screen-problems?hl=en",
    "title": "brand new pixel 4 with touch screen problems",
    "content": "My wife received her new Pixel 4 phone last week, and we started the process of setting it up on Friday.  Today is Sunday and tomorrow I plan to ask for a replacement.\n\nOn Saturday we went for a long walk.  While we walked, the phone on its own placed a call and several times it turned off her music.\n\nWhile playing a game (Pokemon GO) the phone ignored some simple select gestures (trying to push a \"button\" in the game) and misinterpreted sweeping gestures (trying to \"throw a pokeball\").\n\nWhile texting, I myself noticed misbehavior in Gboard - I placed my finger on the right end of the middle row (around the \"L\" key) and dragged from the right to the left in a STRAIGHT line.  Gboard showed a purple horizontal line approximately up to the \"H\" key, at which point the curve dipped down until it almost touched the top of the bottom row of keys, until my finger (still drawing straight across) reached the \"S\" key, at which point the curve steered back up to the middle row and continued from there straight to the left.  The \"distortion\" was repeatable at the time.\n\nAt this moment, the phone is behaving, so the behaviors are intermittent.  We have not had the phone long enough to discern a pattern - but my wife is not a professional phone troubleshooter, she's just a user.  We bought her a brand new phone and I want her to have a working phone with the associated functioning experience.\n\nI am reporting this to you in case you have a \"magic bullet\" solution(*), but lacking a rapid response with just that, I am going to pursue getting a replacement expeditiously.\n\n(*) I have tried power off/power on, and factory reset, but since I can't reproduce the problem, I have no idea how to get the problems to recur.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2020-06-14T21:43:17.916624+00:00",
    "reply": "1 Reply"
}