{
    "url": "https://support.google.com/pixelphone/thread/70591406/problem-returning-faulty-device-no-shipping-label?hl=en",
    "title": "Problem returning faulty device / no shipping label",
    "content": "I saw a couple of other Pixel owners have had this issue. I had some technical problems(UI problems, dropped calls, incomplete search but the final straw was battery drain from 80% to 0 in under an hour, couldn't restart the phone) with my Pixel 3 & after an hour+ chat w/ support, they determined I was eligible for a replacement.\n\nThe replacement - which also has issues - arrived today  with no return label. No big deal, I thought, I'm sure this will be an easy fix.\n\nNope. Was in an hour+ chat w/ Google, w/ no resolution. Was told I'd hear something within 2 business days. I tried calling them & was automatically disconnected. I respect that things are different & harder for everyone right now, but that was bad customer service.\n\nSo I called The Assurant, the company through which Google provides the policy that replaces phones, & the first time I called, they put me through to the same Google voice line as before & I was disconnected.\n\nThe second time I called, after being put on  hold a few more times, they told me I'd have to get the label from Google, like it says on their website..which I tried to do.\n\nIt shouldn't be this hard. That whole process should be automated. \"X user has a claim validated by us & Assurant? They said they need a return label? No problem, here's a link to a shipping label.\"\n\nBetween explaining my problems with the phone, including repeating information to each new person (3 Google agents last night, 2 Google agents today, 1 Assurant agent yesterday, two Assurant agents today) I've lost about three hours all told to this process. The first hour - fine, the phone was a gift & proving ownership shouldn't have been too easy (I had the receipt & all relevant info). But to be told ownership had been transferred last night & then have it to be obviously untrue is aggravating.\n\nAlso, when you start a conversation with a new Google agent, they'll ask you for 3 - 5 minutes to review the previous conversation, & then ask you to repeat every part of what's already been discussed.\n\nThe whole thing is frustrating. Pixel is a beautiful phone, & Google Fi is reasonably priced cel service. It shouldn't be this hard to get a simple request met. *Buying* the phone initially sure wasn't difficult. Looking up this issue I see I'm not the only person with this issue, & some people were reporting it before the pandemic as well.\n\nWho else out there has had this problem?\n\nThanks for reading this.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2020-09-11T22:51:31.824804+00:00",
    "reply": "1 Recommended Answer"
}