{
    "url": "https://support.google.com/pixelphone/thread/105350438/horrible-experience-with-customer-service-customer-higher-support-google-repair-centre?hl=en",
    "title": "Horrible experience with customer service! Customer higher support Google repair centre",
    "content": "Avoid Google products as the aftercare/repair service is appalling. \n\nI'll keep this short as it's wasted at least 20 hours trying to get resolved!\n\nHad a faulty screen, went on Google support page was told could be a chargeable repair so gave credit card details and waited for the £ was surprised the repair centre in Poland (Google) inspected the device and told me it's classed as under warranty so won't be any charge! wow amazing I thought! \n\nPhone arrived back but adhesive was all over the top right hand corner thus the lcd wasn't glued down properly, contacted Ed in Google support he apologised but felt it shouldn't be repaired again but replaced! wow again amazing service! he couldn't find my address on Google maps (even though they arranged collection and returned it back) was handed to the so called Specialist higher support!!!!! \n\n15 emails of chasing the reply;  \n\n\"Thanks for contacting Google!\nI do understand, it is not the best of feelings to have, the device which is not working as intended. We at Google, always ensure that our users derive maximum satisfaction to the products and services that we deliver. Even after checking twice with the specialist we still have the same response from them. \nWe have conducted an investigation and determined that this device is not eligible for a warranty replacement/refund due to previous illicit activity. We recommend you reach out to the place where you purchased this device, as they may be able to provide you with further information\"\n\nI kept on saying I don't want an exchange all I want is the Google repair centre in Poland take my phone back and do the repair in a professional way! wasn't too much to ask!\n\nI've sent them every email/screen shot from DHL from the Repair centre saying it's been inspected and it's under warranty/ screen shot from DPD that it was received back to me yet they won't do anything due to previous illicit activity\n\n\nWhat I've found out is that Google support isn't actually Google themselves but a 3rd party call centre  in India using English names, the repair centre in Poland Isn't Google but a 3rd party repair centre. I feel they are calling me a Fraudster with the comment  of..... previous illicit activity\n\nThey need to get out of the \"computer says NO! syndrome\" now if i was a so called  Fraudster why on earth would I give my credit card details and then send my phone into them in the first place\n\nThey want me to take it back to the retailer? it that so the retailer can rectify the poor workmanship of the so called Google engineers???  Guess what the retailer said......TAKE IT BACK TO GOOGLE.\n\nGoogle this is an absolute disgrace!",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2021-04-07T14:36:53.601169+00:00",
    "reply": "1 Recommended Answer"
}