{
    "url": "https://support.google.com/pixelphone/thread/4780395/google-pixel-support-provides-pathetic-service-i-regret-buying-pixel-phone-i-had-sent-my-pixel-2-phone-for-repair-when-it-stopped-working-my-phone-was-not-having-any-physical-damage-when-i-sent-it-and-was-under-warranty-their-support-team-responded-saying-there-is-internal-damage-and-sent-a-quotation-for-repair-saying-it-won-t-be-fixed-under-warranty-when-i-asked-them-to-share-picture-of-damage-they-later-changed-it-to-term-called-pressure-damage-in-the-photo-which-they-sent-i-couldn-t-find-any-damage-i-asked-them-justify-that-and-there-was-no-reply-later-on-so-quotation-was-rejected-by-default-later-they-said-they-are-going-to-send-my-phone-as-it-is-later-when-i-received-my-phone-there-was-big-damage-on-screen-so-i-denied-to-accept-my-phone-after-informing-all-these-they-are-not-even-responding-never-buy-pixel-phones-please?hl=en",
    "title": "Google pixel support provides pathetic service. I regret buying pixel phone. I had sent my pixel 2 phone for repair when it stopped working. My phone was not having any physical damage when I sent it and was under warranty. Their support team responded saying there is internal damage and sent a quotation for repair saying it won't be fixed under warranty. When I asked them to share picture of damage, they later changed it to term called \"Pressure damage\". In the photo which they sent, I couldn't find any damage .I asked them justify that and there was no reply later on. So quotation was rejected by default. Later they said they are going to send my phone as it is . Later when I received my phone, there was big damage on screen. So I denied to accept my phone. After informing all these, they are not even responding. Never buy pixel phones please.",
    "content": "Google pixel support provides pathetic service. I regret buying pixel phone. I had sent my pixel 2  phone for repair when it stopped working. My phone was not having any physical damage when I sent it and was under warranty. Their support team responded saying there is internal damage and sent a quotation for repair saying it won't be fixed under warranty. When I asked them to share picture of damage, they later changed it to term called \"Pressure damage\". In the photo which they sent, I couldn't find any damage .I asked them justify that and there was no reply later on. So  quotation was rejected by default. Later they said they are going to send my phone as it is . Later when I received my phone, there was big damage on screen. So I denied to accept my phone. After informing all these, they are not even responding.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-04-24T05:25:43.011736+00:00",
    "reply": "0 Replies"
}