{
    "url": "https://support.google.com/pixelphone/thread/21901163/pixel-4-xl-randomly-shuts-down-and-won-t-stay-on-for-longer-than-a-few-minutes-battery-is-100?hl=en",
    "title": "Pixel 4 XL randomly shuts down and won't stay on for longer than a few minutes (battery is 100%)",
    "content": "First some information about what's happening.\nYesterday I received my phone and it was working perfectly. Played with it all day and installed my apps.\nThen I went to sleep at night and it had about 13% battery percentage left and I put it on the charger.\nThis morning the device was turned off and when I pulled the charger out and plugged it back in it said it had 0% battery. But I could turn it back on again and then it said it was 100%. So I left it in the charger while it was turned on for a few minutes and when I came back to it, it was turned off again. If I removed the charger it wouldn't even start up. It would at first give me an icon that the battery was too low. And if I waited a few minutes it doesn't show anything on the screen. After that I put it on the charger again and when I booted the device it immediately shut down when it was on the lockscreen. I even had it shut down while booting. Also every time I wanted to boot the phone I needed to pull the charger out and put it back in. After this I tried booting it in safe mode, but the same story here. It turned off after a minute or so. So I went to work and left it off for about 45 minutes. I put it on the charger at work and turned it on while leaving it still on the table and it stayed on for a few minutes. A colleague suggested to shake the device to see if it would shut down suddenly and it did. He thinks it is a battery connector issue.\nSo I tried the last thing I could do, a factory reset. It shut down when the device wanted to start erasing all data. Then when starting it up again it erased all data and I was in the welcome screen. The battery was 100% and I pulled out the charger and it turned off again.\n\nTo sum up what I tried:\nBoot without charger (doesn't boot up at all)\nBoot with charger connected (shuts down after a minute or so)\nBoot in safe mode (shuts down after a minute or so)\nFactory reset (shuts down in start screen as well)\n\nI really don't know what to do right now. I just received it yesterday :(. Also I ordered it from the UK and I live in the Netherlands, so if there is anything I can do without sending it back that would be awesome.\nIf I do need to send it back, how will that work? Do I need to send it back to my friend in the UK which will send it back to Google? And how do I start the send back procedure?\n\nI hope someone can give me some more information about what's happening. Thanks in advance!",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4 XL",
    "post_time": "2019-12-04T09:16:34.359743+00:00",
    "reply": "6 Replies"
}