{
    "url": "https://support.google.com/pixelphone/thread/65988383/pixel-4xl-stopped-turning-on-after-several-days-of-being-stuck-at-50-battery?hl=en",
    "title": "Pixel 4XL stopped turning on after several days of being stuck at 50% battery",
    "content": "I had this same issue with my Pixel 4 XL. It progressively got worse until the phone would not turn on after a couple days. The phone would start going into a boot loop. Trying to work with Google support to get a warranty replacement has been the worst customer service nightmare I've ever experienced and I will never buy a Google phone again.\n\nI work for a NASA center and my phone is critical to my job so it was important to me to get a phone back that would be easier to work on rather than the burner I got for basic functions while working on getting my Pixel 4XL replaced.\n\nI went to AT&T where I bought the phone to see if they could help me with the replacement but they told me I had to go through the manufacturer, Google.\n\nI contacted Google support and took the phone to the 3rd party repair partner (Ubreakifix). Almost all of the stores in the Los Angeles area were listed as temporarily closed due to COVID-19 and the only store that wasn't listed as closed wouldn't answer their phone and the voicemail inbox wasn't set up so I figured they were closed also. I opened a RMA for a warranty exchange with Google. \n\nThe next day I happened to drive by the Ubreakifix store and noticed that they were actually open. I dropped the phone off and they told me that they would change the battery and have the phone ready by the end of the day. This store wouldn't answer their phone and as I mentioned, the voicemail wasn't set up, so I couldn't check if my phone was repaired and ready for pick up. So I drove back to the store only for them to tell me that the battery replacement didn't work.They offered to order a new motherboard and replace that. They told me the phone would be ready in two days since they had to order the motherboard. On the second day I called them (this was the only time they actually answered the phone) and they told me it would be ready at 2 pm. I tried calling at 2 pm to make sure it was ready but no answer on multiple calls, so I drove back to the store (45 minute drive) and arrived well after the time they told me it would be ready and they told me the motherboard replacement hadn't fixed it. No one had called me to tell me this, like I requested, so I wasted my time driving to them for nothing. I took my phone back from them and decided to go back to Google support for a replacement. This Google partner, Ubreakifix, was incompetent and unprofessional.\n\nI contacted Google support again that day and asked for an elevation of my case to have a phone sent to me before sending my bricked phone in in order to avoid the 10-15 day turnaround for the standard replacement. The customer service agent at Google told me that this would have to be approved which would take 24-48 hours. I didn't hear anything for 4 days and the agent did not reply to the email thread we had been corresponding in, so I opened another ticket. They told me there was no update and there was no one else I could talk to. I tried again the next day with the same results. On the 6th day after they told me 24-48 hours, I contacted support again. Only after that call did I get an email response from the original service representative saying that the escalation had been denied and that I would have to go through the standard replacement process and would only receiver a refurbished phone, not a new one.\n\nAt this point, after such a terrible experience with Google and their 3rd party partner, I have no faith that Google will even send me a replacement phone if I go through the standard replacement process. Their service has been so incompetent that I don't trust this to be resolved. It's been nearly 2 weeks since my phone stopped working and all they have done is wasted my time.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2020-08-20T14:48:25.4303+00:00",
    "reply": "4 Replies"
}