{
    "url": "https://support.google.com/pixelphone/thread/3664869/google-returned-my-pixel-2-phone-in-broken-condition?hl=en",
    "title": "Google Returned My Pixel 2 Phone in Broken Condition",
    "content": "3/08/19: Google received my Pixel 2 trade-in phone that was quoted at $227\n3/12/19: Google claimed the touch screen didn't work and they would ship it back to me\n3/20/19: Got my phone back. It won't turn on or anything. Completely broken. Not the condition I sent it to Google, nor the condition they even claimed to receive it.\n3/21/19: Contacted Google\n3/21/19: Google asked for my phone details, I sent reply\n3/22/19: Received canned response from Google on how to turn on my phone\n3/22/19: Resent Google details of what happened\n3/25/19: Google asked for my address and phone number\n3/25/19: Responded with details Google requested\n3/25/19: Google agreed to replace my phone\n3/25/19: Google sent link to order replacement phone and send back the phone they broke\n3/25/19: Followed Google's instructions, ordered replacement phone. Hour later my order was cancelled without reason\n3/25/19: Contacted Google to find out what happened\n3/27/19: Google claimed to be investigating issue\n3/30/19: Google claimed to be investigating issue\n3/31/19: I asked Google what was going on\n3/31/19: Google sent a canned response saying they were sorry my phone wouldn't turn on!\n3/31/19: I asked what they were talking about, they were supposed to be fixing my phone that they promised to do\n4/01/19: Google requested I send pictures of my phone\n4/01/19: I sent Google pictures of my phone\n4/01/19: Google confirmed receiving pictures. Said investigating\n4/03/19: Contacted Google asking for an update\n4/04/19: Google says they are investigating\n4/05/19: Contacted Google asking why they are not honoring previous email promising to replace phone\n\nAs you can see this is ridiculous. I have an email from Google promising to replace my phone they sent back broken. However, they are investigating something again. \n\nI want my Pixel 2 back in the working condition it was in when I sent it for trade in. This needs to be resolved in a timely manner and shouldn't be in an investigating state when Google already promised to fix it. I'm so beyond frustrated with Google.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-04-06T03:42:41.067134+00:00",
    "reply": "0 Replies"
}