{
    "url": "https://support.google.com/pixelphone/thread/55870149/i-am-not-receiving-google-verification-message-after-enabling-chat-features-google-messages?hl=en",
    "title": "I am not receiving Google Verification message after enabling chat features - Google Messages",
    "content": "     First, a little background.  My carrier is Verizon Wireless and this is my first Pixel device.  I recently swapped to a different smartphone using the SIM out of my Pixel 2.  Prior to swapping devices, I had no issues with my Pixel 2, especially using chat features (RCS) in Google Messages.  \n     At first I was not receiving SMS messages on this other phone.  I reached out to Verizon and they informed I would need to enable CDMA Less feature on my line/phone number.  Once this feature was enabled, I was then able to receive SMS.  However, was never able to use enhanced chat features through Google Messages.  So, I used the Verizon Messages app instead.\n    This \"other\" phone was not a Pixel and I soon decided to switch back to my Pixel 2 after a few weeks.  Verizon recommended that I replace the old SIM with a brand new, mainly due to the CDMA Less feature that was previously added.  So, I picked up a brand new SIM at Verizon.\n    Almost immediately I learned that the Chat features were not working properly on my Pixel 2.  It was stuck on \"Verifying Phone Number\" - \"Setting Up\".  Before you point me to the other forums, I tried all the troubleshooting steps mentioned there.  I cleared cache, storage in Carrier Services and Google Messages as well.   None of these steps resolved the issue.\n    I spent hours in chat with both Google and Verizon.  Verizon explains that the CDMA Less feature is no longer tied to my line and the phone has been provisioned properly and everything looks good on their end, and refers me to Google.  Also, of course, they tell me my Pixel 2 is not on the supported list for RCS.  My wife has a Pixel 2 (same Verizon account) and chat features (RCS) work flawlessly on her device as well. \n    Google support advised me to leave feedback through the app and through the system settings feedback as well.  They also recommended that I contact the carrier.\n    Well, I did determine what I believe is the issue.  I am not receiving the Google Verification message upon enabling the Chat Features in Google Messages.  Just not sure how to resolve. I swapped SIM cards with another device on my Verizon account, this is a Samsung J3.  Incidentally, chat features work flawlessly on this device as well.   I powered both devices off, and put the SIM from the Samsung Phone in my Pixel 2.  Of course, this configured my Pixel with the other phone number of the Samsung.  I enabled the chat features in Google Messages and the phone immediately received the Google Verification message and chat features began working.\n\nAdvice?  Ideas?",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-06-27T17:21:51.952137+00:00",
    "reply": "7 Replies"
}