{
    "url": "https://support.google.com/pixelphone/thread/85121902/terrible-customer-service?hl=en",
    "title": "Terrible customer service.",
    "content": "This is (without exaggeration) the worst customer service experience I have ever had. I have  a connection/charging/notification issue with my Pixel 3a. Honestly, that issue is completely besides the point. My real issue is how Google treats their paying customers. What is the point of buying a nice phone if the manufacturer of the phone refuses to help you?\n\nI went through the \"contact us\" page and received a call from a representative. Initially, this first call went fine and we went through some troubleshooting steps. They needed to call me back to see if the troubleshooting fixed the problem (it didn't). We scheduled a callback for 12 pm the next day. Eventually, I received a callback, 4 hours late! This was a very inconvenient time, hence the reason I scheduled the callback earlier. Regardless of the inconvenience of the call, the representative asked me to factory reset my phone and not to sign in. Basically, setting up a brand new phone. He told me that he would call me back in about 15 minutes; he did not. In fact, he still hasn't called me back in 4 days! Not being signed into a smartphone basically makes the phone unusable, I couldn't access Gmail or even my contacts!\n\nI went back through the \"contact us\" page again and this time I chatted with a representative. I complained about not receiving a call back and they \"escalated\" the issue. They told me supervisor will contact me within 2 days. That was another 4 days with no contact. On top of that, they decided to give me a different ticket number than the one I already had. So now I have 2 ticket numbers open for me (although it's obvious that no one is working on either one).\n\nEventually I talked to another representative on the phone and he basically told me he couldn't do anything for me and to wait for a call back. That was 3 days ago and still no contact.\n\nSo what do I do? Honestly, what am I supposed to do to get my phone fixed? There is no phone number for me to call so I must rely on callbacks. But Google simply does not call anyone back!\n\nWhat am I supposed to do? Can anyone answer that for me?",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2020-11-25T00:45:06.208095+00:00",
    "reply": "3 Replies"
}