{
    "url": "https://support.google.com/pixelphone/thread/63553099/pixel-2-phone-died-shut-off-won-t-charge-or-turn-back-on?hl=en",
    "title": "Pixel 2 phone died/shut off, won't charge or turn back on.",
    "content": "Three days ago we had a storm, lost power, before turning off generator from everything but the fridge and going to bed I fully charged my pixel 2. Woke up to my alarm finally after hitting snooze a few dozen times, connected generator (power wasn't restore until 1pm that day), did my morning things, fed kids, finally sat down with phone and coffee just to find out my phone was off or appeared so. Put it on the charger, came back to it after an hour just to find out it didn't charge. When I plugged it in I don't recall if I saw the battery that shows up on the screen when its off and you plug it in. I tried to turn it on but nothing happens, I tried every single usb-c cord I have in the house then in the car, nothing would work but everything  worked on my husband's pixel 2 phone which was bought at the same time as my pixel 2 phone on a buy one get one free deal. I use my phone for work as well so its important I have a working phone, i took it to my phone carrier store, Verizon. Only to be told this happens a lot and other than getting a new phone i could take it to who they recommend to see if that place can fix it but they don't know if they fix Pixel phones. I ended up leaving there with a brand new Samsung galaxy s20. I've been using this phone for a few days now and there are do many things I don't like and I was really comfortable and becoming very knowledgeable  with my pixel 2. Couldn't get the pixel 4 (figured I would since I was comfortable with the pixel 2, how hard can it be) but was told he couldn't sell me one due to a recall. I really miss my pixel 2, I do currently have it still even tho its not working, is there anything  I can do to make it come back to life? We've only had them for 2 years, well to be exact February 2020 made it 2 years. Im not completely tech savvy, i don't know tech terms for things and how to reboot and doing things like connecting to computers and things. I'm only good at helping people when it comes to doing things on phones and simple yet not simple for everyone type of things. I appreciate any kind of help, I miss that phone so much, Thank you.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-08-08T05:12:14.426177+00:00",
    "reply": "1 Reply"
}