{
    "url": "https://support.google.com/pixelphone/thread/16514444/has-google-told-you-they-have-a-bug-in-their-system-and-delay-replacing-your-phone?hl=en",
    "title": "Has Google told you they have a bug in their system and delay replacing your phone?",
    "content": "My Google pixel 2 has some internal issue for many many months now. I was travelling and had SO MUCH trouble with my phone. \n\nThe phone screen would randomly go fuzzy (see image attached) and i would have to wait till it dies for it to restart and work. When it does start working, it becomes super slow and freezes. I have contacted google while abroad and they made me go through all the steps to reset phone and even tried factory reset. This did not help and so they told me I needed to be back in USA to get my phone replaced.\n\nI have warrantly on my phone so they should replace it as it seems there is some internal issue with the phone itself but I have contacted Google support more than 5 times now and they are just stalling. The first few times, i was told they have an issue to place the replacement order and they will contact me in 24 hrs which they did not.  Once I contacted them again, they put the order in and i even recieved a confirmation email but a few minutes later i got another email that they cancelled my order. \n\nI have since contacted them many times and the only response i get is that it has been escalated to a manager and that they have a bug issue in their system. It has been over a week now... I have asked for a time frame and if  this effects just my order specifically or is a global issue but they have not provided me any info. \n\nThey have not even gotten back to me, theres no fix, and my phone is so buggy that I am missing calls etc. At this point, I feel like Google is just waiting for my warranty to be over so they dont need to replace my phone. This is the worst experience ever....\n\n\nAnyone else facing similar issues?",
    "is_img": 1,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-10-10T23:13:36.589349+00:00",
    "reply": "7 Replies"
}