{
    "url": "https://support.google.com/pixelphone/thread/1618939/not-routing-audio-to-bluetooth-headset-after-latest-android-9-security-update?hl=en",
    "title": "Not routing audio to bluetooth headset after latest Android 9 security update",
    "content": "Since the February Android 9 security update, my Pixel 2 XL no longer routes call audio properly to the connected Bluetooth headset (a Radsone EarStudio ES100).  The EarStudio app clearly shows the call in progress, and the Phone app shows the call as being routed via Bluetooth to the EarStudio, but no call audio is heard on the headset and no audio is sent from the headset's microphone.  The issue also affects other apps that can use a Bluetooth headset for calls, such as Skype or Slack.  Calling works fine if I do not attempt to use a Bluetooth headset but instead use the built-in speaker and microphone in the phone.\n\nA2DP audio (e.g. streaming Spotify tracks to the EarStudio) works fine from the Pixel 2XL, I can hear music on the headset.\nThe Bluetooth section of the Settings app shows 'Phone calls' as being enabled for the EarStudio.\nThe EarStudio works fine for calls using the HFP Bluetooth profile on other devices, I have paired it with an iPhone and also a laptop and it works correctly with those devices.\nThe EarStudio worked fine for calls on the January Android 9 security update, and all previous versions of Android I have had on the Pixel 2 XL.  The issue only started after updating to the February security update - I noticed it the first call I attempted to make after updating.\nI have done a full factory reset of the phone and re-paired the EarStudio with the Pixel 2 XL, but the issue remains.\n\nAny ideas?  It looks like a straightforward bug in the February security update that got missed in testing - though I'm baffled as to how it crept into the build, none of the fixes look audio or Bluetooth-related.  It's going to be very annoying if I have to wait a month or longer for a fix, and I'm not prepared to compromise on security by downgrading, especially given the severity and ease of exploitation of some of the issues fixed in the February security update.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-02-13T12:56:30.796162+00:00",
    "reply": "0 Replies"
}