{
    "url": "https://support.google.com/pixelphone/thread/101430911/help-with-duel-sims-and-5g-connection-using-mobile-network-setup-on-my-new-pixel-4a-5g-phone?hl=en",
    "title": "HELP WITH DUEL SIMS AND 5G CONNECTION (USING MOBILE NETWORK) SETUP ON MY NEW PIXEL 4a 5G PHONE",
    "content": "I really need some URGENT help with the setting up of both Nano & ESIM. Today I found that I have no internet - (mobile network- Optus). I submitted a report, there were no faults or interruptions, I should have it. I have way-enough data. Maybe the phone now, no longer uses my old SIM from old phone, with Optus? So I need to get it sorted ASAP. Also need to recharge phone tonight on a 5G Postpaid plan. Here goes, I hope you can help me;\n\nI've inserted and setup my old SIM card (Nano), mainly so I could get all my contacts & info on the new phone. I used the Google site for that. I believe now those contacts - phone numbers, are all in my Google Account (I've checked). Now though it wants me to setup my E-SIM, why?  What will that do?  \nI have left it for a while (been busy) and now I've had reminders saying \"finish the E-SIM setup in five days or as soon as you complete the setup, you will no longer be able to use your old SIM\".\n \nProblems: When I go out and place my mobile network on, I can not connect to 5G, it just flicks straight to 4G. Yes, I have coverage. Yes, 5G is selected. Reading about it I apparently I have to start turning off one of the SIMS in order to connect 5G. Which one?  It said to select the one that DOESN'T USE DATA??   What do they mean, exactly, by data?  I need someone to explain that to me. \nI'm supposed to choose preferences;  \nA) Select SIM - calls, texts - in this DSDS settings, which I temporarily switch off the SIM that DOESN'T use data (in network & internet - mobile network, settings) \n-  Which one do I switch off?   The NANO?\nB) Select the SIM that will use data  The E-SIM?\nC) Select a Default? How do I know?  When will it go back to the default?\n-  Can I just remove the NANO SIM card? (since my contacts & phone numbers are in my Google    account) and just finish setting up the E-SIM, and use the E-SIM alone?  \n  Solve a lot of problems, I won't have to keep turning off SIMS!\nD) What exactly happens when I finish the E-SIM setup,  Is it going to upload information on it?\n\nWhen out & about, using my mobile network, I will need to do the following; \n1) Make and receive calls and texts\n2) Use Google Maps, Internet Searching.\n3) Use Apps, like ANZ banking, SafeWA, MyOptus- for recharges, Google Play Store (occasionally, if I HAVE to install a App when I'm out), Camera & Google Photos (when viewing)\n4) To connect to 5G (just with E-SIM), when I'm out on mobile network and I need more speed, while also being able to do the above. \n\nAt home I will need to do (I have WIFI with Telstra);\n1) Watch YouTube\n2) Connect to 5G at home when using WIFI. Can I do this? Or is it, WIFI or 5G, not both.\n3) Install most Apps.\n4) Download occasional files.\n\nCan I do all of the above using only the E-SIM?\n\n* I have a Laptop (on WIFI) at home where I use Gmail, Facebook, Netflix. All documents, downloads are done here and not on the phone.\nhere, not on my phone.\n\nThanks to anyone that can help me with this stuff.",
    "is_img": 0,
    "category": "Other, Google Pixel 4a (5G)",
    "post_time": "2021-03-09T14:15:03.594724+00:00",
    "reply": "1 Reply"
}