{
    "url": "https://support.google.com/pixelphone/thread/17070609/android-10-update-destroyed-everything?hl=en",
    "title": "Android 10 Update Destroyed EVERYTHING",
    "content": "Android 10 update forced itself upon my poor little Pixel two days ago. \nWord from the wise, don't download it... \n\nFirst the battery drainage kicked in. Dropped about 20-30% within an hour of no use.\nTried to research some help on here, found lots of other users having similar issues.\n\nEventually just about everything on the phone started to slow down and lock up. I couldn't update apps, could delete things, couldn't make back ups, couldn't open anything longer than 30 seconds before it would close itself. \n\nDesperately tried plugging my phone into my PC, hoping to use it to pull my files off the device as I could see something was bound to happen. The damn thing wouldn't even connect to my PC. It'd start connecting but then the Pixel would close the process, didn't matter if it was on File Transfer, MIDI, PTP... None of them would work. \n\nPhone started to get worse and worse, even while trickle charging via my PC the battery was STILL draining. Phone eventually died/shut off. Tried turning it on and it would just black screen. \n\nUltimately was forced to Factory Reset, the damn update corrupted my back up. Of course because its a Pixel most of my photos and contacts and such were safe, but my UI set up was corrupted, all my text/message logs where gone, device folders/photos were toast, I didn't even have a chance to attempt to back up my stuff.\n\nThankfully I've had this Pixel for a little over 2 years now and have an upgrade with my phone provider, can tell you one thing though, wont be getting a Pixel 4 this evening when I go in to get a new phone.\n\nCouple lessons from this, 1) Back up all your stuff 100% at least every couple of weeks. 2) Don't update to Android 10 3) If your pixel starts giving you device messages forcing you to update pray to whatever deity you believe in that your shit wont get as fucked as mine did. \n\nR I P Little Pixel. \nHope none of you have an experience like this. \nDONT UPDATE TO ANDROID 10 YET!!",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-10-17T22:36:59.90244+00:00",
    "reply": "23 Replies"
}