{
    "url": "https://support.google.com/pixelphone/thread/65176814/refurbished-pixel-3-not-switching-google-wifi-points-smoothly?hl=en",
    "title": "Refurbished Pixel 3 not switching Google Wifi points smoothly",
    "content": "Refurbished Pixel 3, running Android 11 beta 3.\nJust got it about a week ago, not from Google.\nNoticed that when I move from room to room, it switches from Google Wifi puck to Google Wifi puck, but not smoothly at all.  A lot of times it'll hold onto a signal from a puck far away as I walk across the house, then switch to LTE only, and then about 10 seconds later pick up the newer, closer Google Wifi puck.\nThis is my first Pixel 3 but we have other Pixels in the house (3a, 2, OG) and they all hold onto the Wifi smoothly from room to room across the house.\n\nI already assigned a static IP.  Didn't seem to help.\n\nI tried it in safe mode.  Also didn't seem to help.\n\nI don't have any weird apps on it -- the exact same ones I had with my previous OG Pixel, which didn't do this.\n\nMy guess is that I have a wonky wifi unit (i.e., hardware problem).  In the grand scheme of things this is a minor annoyance and the world won't end.\n\nAnd as the other phones don't do it and my Google Wifi setup hasn't changed in 2 years, I don't think it's the Wifi.  I \"turned off and on again\" all the google wifi pucks just in case it was acting funny after an update or something.  No difference.\n\nCould this be a known 11 beta 3 bug?  (did it in 2.5 also).  I didn't really use this in Android 10 -- as soon as I got the phone I upgraded to 11 beta 2.5.\n\nI don't want to factory reset the phone.  Not worth it.  Especially since I just got it (have had it for about 2-3 weeks) and the apps are exactly the same as on my OG pixel.\n\nAny thoughts/ideas welcomed.  Not expected anyone to solve this.  Just wondering.\n\nthanks.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2020-08-16T16:47:29.632237+00:00",
    "reply": "1 Recommended Answer"
}