{
    "url": "https://support.google.com/pixelphone/thread/8273221/does-google-sell-a-pixel-that-is-unlocked-outside-of-an-account?hl=en",
    "title": "Does Google Sell a Pixel that is Unlocked outside of an account?",
    "content": "I stumbled across an issue today, where our Internet service was interrupted,  when my new Pixel came to the house!  Without Internet service, I can't set up my Google Pixel Replacement, so this is feedback related to the product, for a broad portion of people in the USA, who have no WIFI & Internet service is to expensive!  I have consistently been using mobile computers for media content creation, using hot spots, home wifi, without a data plan, which they can be really expensive!  Can Google make a stand alone Pixel, where we don't need to be signed in to an account, yet we can still used the mobile computer! I've used Samsung before, & I would be able to turn on a Samsung Galaxy immediately, & use it without signing in to an account!  I started panicing a bit, thinking 5 G meant taking away our cable & all we would have is WIFI service, & then I would not be able to use my Google Pixel at all!!   If I had no Google Account, previous to receiving my Google Pixel, I can't use it anyway for pictures, video, journaling & note taking!  Can Google make a Google Single Pixel,  which means the computer can be used, without an account & you don't need to be signed in to someone else's account to use the Google Single Pixel!? You just turn it on & use it, then sign in to your Google Account if you have one!   \n\nIdeally, I still wish we had free internet so everyone can use the Internet due to the folks on fixed incomes as they age!   On a fixed income, how do retired seniors, & US Military Veterans get their pay, & social security benefits, without  Internet Service in rural parts of the country & the price of inflated internet service, with monetary growth in mind for wall street profits, yet retired folks, millennials, veterans pay are on a fixed income & won't be able to keep up with inflated Internet Service!  \n\nAnother concern I have is, without Internet service, I would not be able to detach the Google Pixel 3a I am returning to Google, from my Google Account!  Currently I won't add any banking for this reason due to the security risks of a 3rd party accessing my financial account by law enforcement taking mobile computers!   I keep revisiting in my mind, when I was arrested,  & the local law enforcement had full access to my Google Account including Google Adsense & my Banking & all my passwords to other accounts! While I was in jail, I had no way to shut off my mobile computer from my Google Account! My husband said that should teach what not to write, & it serves me right!  He said he don't care about the First Amendment when what I say brings the police around!  He approves of violating the first amendment using censorship, because he is using it as a control mechanism to gas light, to yell & scream in a man baby fit of rage!   He threw me under the bus, & has threatened divorce, several times since I was arrested, after I used my youtube revenue to help pay for the house, when times were really good! When the police got a search warrant & my husband would not stand up for me, & defend my first amendment, & he told the police to keep me, the police then had my banking information, & youtube pay information!  HE even broke a new computer 2 weeks later, because I had to buy a new computer, not having a computer, over a video I made about discrimination in advertising!  The last time he threatened to break my computer equipment was about 4-6 weeks ago, when he was raging! Maybe its the medications or his medical issues, I don't know but he is over medicated & I have no help for him!  I have no place to share feedback, where I feel safe, away from, \"SPOUSE RETALIATION\", over how I feel!   For 14+ months, they have had my computer equipment,  confiscated for an on going investigation!  Funny how that works, when I was being carefree, thought I has a real relationship, but I see things a lot different now!  Why would I help pay for a house, if I knew 16 years ago, all he thought of our relationship is me as a throwaway renter, serving some sick twisted agenda of his, which he kept hidden!  How can someone you thought cared about you, disassociate so swiftly, due to his own discomfort, using it as control in a relationship?  \n\nThank you to those who have shown me something different, & empowered my life education to my 2nd marriage because it was not at all what I thought!  If I would have know this, I would have put the $366,000+ I earned on youtube in to the bank, instead of buying the house in a fema flood zone & paying off vehicles! Hindsight is 20/20!  That way I could have quietly left, which is what he has told me to do on several occasions!  I am just at a point of indifference towards marriage & indentured servitude thru marriage, which violates the 13th amendment, & is slavery!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2019-06-18T18:37:31.890553+00:00",
    "reply": "4 Replies"
}