{
    "url": "https://support.google.com/pixelphone/thread/13110455/pixel-sync-or-backup-via-verizon-cloud-not-fully-supported?hl=en",
    "title": "Pixel Sync or Backup via Verizon Cloud? 'Not fully supported'?",
    "content": "I have a Pixel (128 gb) My wife just got a Pixel 2 (128 gb) and will be abandoning the iPhobe world.\n\nI added Verizon Cloud 500 gb service & had to talk to them twice due to strange functionality & non-functionality. 1st person was knowledgeable but couldn't find answers. 2nd person was worse than no help. Today I am feeling sorry for her vs. frustrated last night.\n\nBasically, I learned they do not support Pixel very well for automated media backup.\n\nThat's no surprise. Most automated backup/sync doesn't work how I expect/want, so finding a way to do it manually is my goal.\n\nTheir drag/drop or select from device are impractical (Pixel plugged into W7 laptop to access Pixel folders for Verizon Cloud doesn't respond to drag/drop. Selecting from menu only supports one file at a time & forgets what directory you were using every time).\n\nSo I tried to use Verizon Cloud Sync folder on the laptop. I was able to copy content to the VC Sync folder but their user interface is not very responsive or meaningful. It's very quick to tell you all Sync, Backup & Restore processes are completed. It says that by default. One time I saw it say it had completed file uploads, then how many files were awaiting processing. That number did not change overnight. I can understand it taking time, but either it wasn't working at all, or won't change status until the entire process is completed. (Really, not the default 'completed' display).\n\nHas anyone determined if there is a way to use Verizon Cloud manually, automatically, effectively, or at all?\n\nI am leaning strongly toward calling it, at worst, unusable or at best, having a woefully inadequate UI.\n\nThank you\n\nMurray",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-08-29T14:43:13.653543+00:00",
    "reply": "2 Recommended Answers"
}