{
    "url": "https://support.google.com/pixelphone/thread/13238320/yet-another-pixel-1st-gen-motherboard-replacement-case-no-response-from-google-on-escalation?hl=en",
    "title": "Yet another Pixel 1st gen \"motherboard replacement\" case - No response from google on escalation",
    "content": "I am facing an issue with my Pixel 1, bought in 2016 where the audio fails on making and receiving calls after the latest software update (July 2019). The phone has also become very unstable due to repeated reboots to try and get calls to work and battery life has gone down. I have gone through all the standard self-care steps ( Safe mode/ factory reset/ updates etc)\n\nI have called google support and sent to B2X service factory Mumbai, India. The service center informed me that the motherboard would need to be replaced as a result of a paid diagnostic. This problem occurs very frequently, with almost all the pixels when i asked a local service center.\n\nIn my own research on the google forum it seems several people are facing this issue, with a significant number from India who seem to have no recourse but to pay for a replacement. The consensus seems to be this is a hardware issue not a software problem and that it is related to problems in manufacturing most likely (https://www.greenbot.com/article/3179145/android/google-responds-to-pixel-microphone-issues-with-official-replacement-program.html)\n\nTo demonstrate how this is in fact a widespread problem here are some links from the forum.\n\nhttps://productforums.google.com/forum/#!topic/phone-by-google/PTfsNj_B_L8;context-place=forum/phone-by-google\nhttps://productforums.google.com/forum/#!topic/phone-by-google/Tt4He4QUnWM;context-place=forum/phone-by-google\nhttps://productforums.google.com/forum/#!topic/phone-by-google/f7edN1THgiA;context-place=forum/phone-by-google\nhttps://productforums.google.com/forum/#!msg/phone-by-google/RGIpDaLLD_A/Ep29A42HBAAJ\n\nAgain, please note the number of users from India who are facing sub-par service, while users in the US have been able to get phones replaced at no cost through ubreakifix.\n\nSo Google has to work with B2X Care support India and get free replacement of motherboard for this audio glitch due to software update. Please let me know how to proceed.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel",
    "post_time": "2019-08-31T06:14:09.181549+00:00",
    "reply": "20 Replies"
}