{
    "url": "https://support.google.com/pixelphone/thread/102603337/pixel-3a-diverts-to-voicemail-seems-invisibly-stuck-on-do-not-disturb?hl=en",
    "title": "Pixel 3a diverts to voicemail. Seems invisibly stuck on Do not Disturb.",
    "content": "I would really appreciate some help:\n\nam a foster carer and must not miss calls.\nI have worked for a few weeks to sort this out.\n\nI have changed SIM (on the old phone).  Google then kindly switched the phone.\nProblem repeated itself.\n\nDo not Disturb is not (officially) on.\n\nI have tested the phone by phoning from a selection of other phones. None of the numbers are set to Divert to Voicemail. First call from each number goes to voicemail (If they leave message I get a notification). If they do not leave a message I have no idea they have called.\n\nI have gone into phone app, clicked 3 dots, gone to calls and calling accounts and ensure \"receiving incoming calls\" is on.\n\nI wonder if an error was backing up to the replacement phone  (thus potentially introducing the error back to this new/refurbished phone?).\n\nI only have three Blocked numbers on the phone. none are the ones I was calling from (to test it).\n\nMy call forwarding options are showing as follows:\nalways forward: off\nfwd to voicemail when.....busy, unanswered, unreachable. \n\nThis morning I did a reset of network & app settings . There was no visible benefit to doing this. \n\nMy wife uses the same network as me (albeit on an apple phoen0 and has no reception issues).\n\nThe original Pixel3a worked perfectly for about 9 months before suddenly \"getting invisibly stuck on Do not Disturb\"). This replacement only arrived a couple of days ago but has same problem. \n\nOne suggestion I have read on another forum (another user had similar problem) is that maybe a third party app is causing the problem. But where would I start tracking this down?\n\nMy next action was going to be to launch in Safe mode to see if that allows phone to ring. (is this a logical test?)\n\nFantatstic phone until it stopped ringing!!!!!!!!!!!!!!!!!!!!!! \n\nThank you for reading this.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3a",
    "post_time": "2021-03-17T12:06:00.649676+00:00",
    "reply": "1 Recommended Answer"
}