{
    "url": "https://support.google.com/pixelphone/thread/90300025/how-long-should-a-pixel-or-any-cell-phone-last?hl=en",
    "title": "How long should a Pixel (or any cell phone) last?",
    "content": "I've had my Pixel 3a XL for barely over 14 months and the motherboard suddenly went bad. Google support ignored my suspicion that the flashing static-filled screen was a hardware issue, and said they were \"very confident\" that a system update would solve the problem. That failed. Then they suggested a factory reset, which also failed. Incidentally, the subsequent restore from backup didn't bring my Google Authenticator codes, so now I've got a dead bricked phone, and I'm scrambling to regain access to all my 2-Factor Authenticated accounts - stock trading, bank account, professional software, and more.\n\n\"Support\" continues to brick wall me and cower and hide behind their pathetic 12-month warranty. I'll send a message, a day goes by, and while I think there's hope they'll right the wrong of selling me a sub-standard device, they repeatedly just come back and say \"No, you're outside of warranty\". \n\nThey've claimed to have 'escalated' the issue, but apparently even whoever's higher up whatever imaginary ladder exists is still more concerned about the 12 month line than about \"provid[ing] the best experience with our products\". Is there a room of techs somewhere taking this long to talk and discuss whether 14 is greater than 12? Obviously it's out of warranty. The point of contacting customer service is to obtain some ...service. A motherboard failing 60 days after the end of a warranty should be a no-brainer for overlooking the severely truncated official support window. \n\nIsn't the industry standard phone contract 2 years?\n\nShouldn't a device match or exceed the minimum expected service agreement?\n\nI've been told that I can pay hundreds to replace the motherboard myself, or buy a new phone. Is there any other way around this? Why should I put more money into the shortest-lived phone I've had in my life? Why should I upgrade to another Pixel, if a product in the same line failed so spectacularly? \n\nAre there any other support routes I can look into?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a XL",
    "post_time": "2020-12-24T19:02:08.40408+00:00",
    "reply": "2 Replies"
}