{
    "url": "https://support.google.com/pixelphone/thread/52448226/can-pixel-3a-play-music-stored-on-usb-c-flash-drive?hl=en",
    "title": "Can Pixel (3a) play music stored on USB C flash drive?",
    "content": "I'm thinking about getting a Pixel 3a to use with Google Fi.  Fi to save money.  I don't stream music or videos now on another phone with other providers and generally use the phone for the apps and to check email rather than as a phone to make calls. \n\nI also play music, in the car and other times. I know Pixels have no SD card slot. I know I can put the files in internal storage, but that is for other things like data and apps too. I know I can stream from the cloud, but if I'm not on wifi as would sometimes be the case I'm using data and the meter is running.  I know I can store it anywhere and move files back and forth as I feel like listening to one thing or another, but that takes time.  I can play random files, select certain artists, songs, albums or some premade playlists etc with a music app. \n\nI haven't gotten a straight answer on if you can play music with an app on a USB flash drive.\n\nI know there are some flash drives that are quite compact.  I could probably leave them plugged in all the time and they would only protrude a little.  That would almost be like a SD card slot. \n\nHowever, if I do that, I don't have the USB C port, like would be nice to plug it in to a charger when in the car playing music. I'm thinking something like a compact USB C drive with a pass through port.  Maybe something made specifically to fit flush on a Pixel would be nice.\n\nI see no such thing in the Google store.\n\nI'm also trying to learn  how well this forum works.\n\ni did see one post where someone asked if you can store music on a USB C drive, someone else answered yes, they tried it.  The discussion was closed.  No further comments.\n\nWell of course you can store files on a flash drive.  I'm sure you can transfer them to.  The question isn't clear, nor is the answer.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2020-06-09T23:48:04.509619+00:00",
    "reply": "2 Replies"
}