{
    "url": "https://support.google.com/pixelphone/thread/20776423/trying-to-get-a-pixel-3-replacement-from-google-as-promised?hl=en",
    "title": "TRYING TO GET A PIXEL 3 REPLACEMENT FROM GOOGLE AS PROMISED",
    "content": "Hi Team, \n\nI am listing down the timeline of events ever since I purchased the phone in 2019.\n\n\n02/01/19 - Purchased pixel phone from Amazon.\n03/01/19 - Showed  first signs of microphone related issues, raised it with google support\n03/11/19 - First pickup Request raised ( took almost 2 weeks to have the phone picked up  from my address)\n04/13/19 - Received the phone from  B2x as repaired and in your words \"factory tested\"\n04/14/19 - Raised second ticket regarding the same microphone issue\n04/20/19 - Phone  picked up from my address\n04/27/19 - Received the phone from  B2x as repaired and in your words \"factory tested\" \n10/5/19 -   Raised the third ticket regarding the fast battery drainage & sensor issue.\n10/7/19 -   Phone was collected by google technician for repair\n10/16/19 - Received the phone from  B2x as repaired and in your words \"factory tested\"\n10/17/19- The so-called \"factory tested\" pixel3 camera is not working anymore as it crashes while opening  & informed the B2x team. Couldn't raise a request then as I was travelling\n11/4/19 -  Ticket was raised to pick up the phone for the camera issue reported.\n11/5/19 -  Dropped the phone at FedEx since you couldn't arrange a pickup at my address\n11/13/19 - Informed by google that my pixel 3 phone will be replaced by another \" factory tested\" phone instead of a new pixel 3.\n\n\nSo based on the above sequence, note that...\n\n1. From the time I purchased the phone, it was more with the repair team than your customer.\n2. I am a business entrepreneur and the reason for buying a high-end smartphone was to not being devoid of a phone to carry on with my business needs especially during travel, unfortunately, I am left with NO phone now. \n3. Have been very patient during the troubleshooting phase and with no high-end smartphone in the interim,  just to hear now hat you will be sending another \"FACTORY TESTED\" which I have lost all faith in.\n\nThis is no way being a fortune 100 company, Google treats its customers.\n\nTILL DATE I HAVE NOT RECEIVED A PIXEL 3 AS PROMISED & DONT KNOW WHEN WILL I GET IT? EVEN AFTER SEVERAL ESCALATIONS. MY SERVICE TICKET NO: GL0088854 IS STILL OPEN WITH GOOGLE. I AM WITH NO PHONE. PLEASE ADVICE ME WHAT CAN BE DONE?",
    "is_img": 0,
    "category": "Other",
    "post_time": "2019-11-22T04:26:10.722658+00:00",
    "reply": "1 Reply"
}