{
    "url": "https://support.google.com/pixelphone/thread/20078837/google-pixel-3-android-10-proxy-autoconfiguration?hl=en",
    "title": "Google Pixel 3 Android 10 Proxy Autoconfiguration",
    "content": "Howdy Pixel fam,\n\nI'm a proud owner of the Google Pixel 3 phone and I'm having connectivity issues when using Proxy in Auto-Configuration mode.\n\nHistorically, I have always been having issues with connectivity when using PAC scripts, even on my older Nexus 5X, both on Android 7 and 8, but they were fixed by simply excluding the ProxyHandler and PacProcessor applications from power optimization.\n\nThe Android 9 on my Pixel 3 worked well and had no issues using PAC script, even without power optimization workaround described above. But, ever since I upgraded to Android 10, I started having connectivity issues in some core Google apps and certain third-party apps. For example, Google One does not start saying that I'm offline, GMail only shows old messages and does not display pictures in already downloaded messages, Google account settings say I'm offline and information might be outdated. Chrome, YouTube and some third-party apps in contrast work well.\n\nI have tried applying the workaround for Android 7 and 8 and it did not help. I reached out to support and have done a lot of debugging steps on the phone itself with no luck. I then went onto an exhaustive journey of debugging the network configuration and I believe that there is a bug with Android 10 system with proxy auto-configuration code.\n\nI took an isolated testing lab machine and installed four applications on it - Apache 2, Nginx, Squid and Privoxy. Nginx and Apache 2 were used to serve PAC files and I have created vhosts that use the machine DNS hostname and the IP address as well, and tried using both modes for both servers on the phone. Privoxy and Squid were used as two proxy servers. I had five different PAC files: one pointing to Privoxy using a DNS, second pointing to Privoxy using an IP, third pointing to Squid using a DNS name, fourth pointing to Squid using an IP and the last one just using the \"DIRECT\" connection.\n\nNone of the above configurations worked with my Pixel 3. All of these configurations worked with other devices, including iPhone XS Max, 3rd gen. iPad 12.9\" Pro, Windows PC, Linux PC, macOS Mojave, Samsung Galaxy S7 Edge on Android 8 and Google Nexus 5X on Android 8.\n\nI then went further, and tried using the \"Manual\" proxy configuration on the Pixel 3 with Squid and Privoxy servers and both settings worked. This leads me to think that there is indeed a problem with Android proxy handling in auto-configuration mode.\n\nDid anyone else faced similar issues? Have you been able to resolve them, and if yes, how?\n\nCheers,\nGarry",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2019-11-16T08:05:49.654372+00:00",
    "reply": "0 Replies"
}