{
    "url": "https://support.google.com/pixelphone/thread/16253985/volume-control-issues?hl=en",
    "title": "Volume Control Issues",
    "content": "I'm having sound control issues with the Pixel 3XL, running Andriod 10. Build:QP1A.190711.020.C3.  \nAnytime I have any sound device, regardless of rather it is the Pixel Buds that came with the Pixel, third-party headphones or Bluetooth speakers. The volume controls and Google Assistant constantly go activate or pop up. \n\nThe Volume constantly self adjusts itself lowering itself to 0% for both media and call volume, the Google assistant constantly pops up without being prompted in any way I can tell. I've deactivated voice, squeeze and headset function from the Assistant Options. Even went as far as just turning Google assistant off on the Pixel. Though that hasn't stopped it from popping up and telling me constantly that Google Assistant can help me. \n\nI tried a volume controller app, that allowed me to lock the volumes in place. However, it still pops the volume menu screen open and attempts to adjust the volume. Although the app prevents the volume from adjusting it does cause any audio I am listening to, to be interrupted. \n\nI've tried removing all third-party apps from my phone,  the problem still persisted. I tried operating in safe mode, and while that prevented the problem. It didn't answer the question of what the issue is, only that it's likely some app causing the problem. \n\nI performed a Factory Reset, and even without any third-party apps downloaded at all. The problem still persisted. I don't know what else to do, Android is updated to the latest patch possible. The only apps on my phone are the ones that come stock with Pixel. And no matter what headset be it wireless or wired. It all leads to the same issue.\n\nAnyone have any ideas on how to help ?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3 XL",
    "post_time": "2019-10-07T20:48:17.383587+00:00",
    "reply": "1 Reply"
}