{
    "url": "https://support.google.com/pixelphone/thread/11472931/can-you-replace-my-google-pixel-3a-xl-free-as-it-malfunctioned-when-it-fell-leaving-two-scratches?hl=en",
    "title": "Can you replace my Google Pixel 3a XL free, as it malfunctioned when it fell, leaving two scratches",
    "content": "I purchased a Google Pixel 3a XL in late May this year. I have been very pleased with my new phone as it offers great functionalities, ease of use and excellent camera. I have been recommending it to many of my friends. My son who got a Google Pixel handphone following my recommendation, has similarly been very satisfied with his new phone. \n\nUnfortunately while checking Google Map to locate a restaurant where I have a lunch appointment today, I tripped (missing a small step) and my phone fell from my hand, leaving two slight stratches on the screen. To my dismay, I couldn't get the phone to turn on. This is a pity as my previous Samsung and Xiaomi phones had withstand worse falls, without malfunctioning. Grateful if you can advise what I can do. If the phone can't be repaired, I will appeal for Google to replace my phone, free of charge on basis of goodwill. Please respond quickly as it's difficult to manage without my handphone. \n\nSeparately I would like to feedback that I had to retype above feedback multiple times, as I had attempted to submit my feedback by keying in the field that pops up when I you click on the Help Center microsite. This is quite frustrating and time-wasting, as I had to rekey above feedback about 4 to 5 times, as each time the text were deleted when I inadvertently clicked on the X sign beside the field  - before I finally figured out the right way to submit my feedback after about 2 hours! Hope you can do something about this, to avoid frustrating customers who need to reach Google Store and restore confidence in customers who like me, love using Google products, especially your Google Home products.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a XL",
    "post_time": "2019-08-07T10:35:45.481048+00:00",
    "reply": "3 Replies"
}