{
    "url": "https://support.google.com/pixelphone/thread/8315210/my-google-pixel-shipping-return-label-have-disappeared-from-my-email?hl=en",
    "title": "My Google Pixel Shipping Return Label have disappeared from my Email!",
    "content": "I received my replacement pixel yesterday which was fast delivery!  I called Google support & the woman sent me a return label to affix to my package in the email!  We had been experiencing intermittent Internet outages while this was going on so I was not able to print the PDF out right away!  Now my email from the Google tech support is gone, as tho the email disappeared or I could have been hacked too!  If you remember AOL back in the day, you could UNSEND messages in email!  I know Google had some sort of brief unsending at one time!  I don't want to be charged for not returning it on time!    \n\nTwo pixels would be great,  with my living room HOME FI project, to string across the living room!  Sorta like the game of telephone, where you put a string, a knot in two styrefoam cups, pull the string tight, &  you can hear the other person!  HA HA HA! \n\nWith all the hacking,  why does Google require us to save pay pal & credit cards in the Gpay which is very unsafe?  If a mobile computer gets lost, stolen or a person gets arrested, & police illegally confiscate a persons mobile computer, then they police have the persons credit card information & pay pal information, account passwords, which are monetary payment methods that can cause financial harm to that person!  The reason I had my credit card account information there was to Pay Google Adwords when I was advertising my youtube channel!  Yes, having the payments saved is convenient!  But I was arrested by the police, & when the police illegally confiscate computer equipment, that can cause harm to a citizen, private and public, that is crossing the line & violates the constitution!  Passwords are intellectual property! Banking & monetary payment are intellectual property!  Our mobile computers become a credit card!  So thru the police, all my history is exposed to the police, including pictures & video!   I am still a fan of the new media & new technology, because more people have a voice to speak out!  Doesn't using the police to obstruct private citizens based on content being made for our online jobs violate the first amendment, since traditional corporate media has done the same thing in their content creation?  I lost my YouTube job, then I lost my computer equipment, because corporate media is threatened by new digital media! Doesn't that attack & hurt a new business model that embraces everyone vs the old way or a one way conversation, telling us what to think!  Where now we have a two way conversation with a lot of disagreements!",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3",
    "post_time": "2019-06-19T12:23:42.496245+00:00",
    "reply": "1 Recommended Answer"
}