{
    "url": "https://support.google.com/pixelphone/thread/23481368/why-did-google-remove-audio-jack-from-pixel-4-xl-phones-many-people-prefer-wired-headphones?hl=en",
    "title": "why did google remove audio jack from pixel 4 xl phones. Many people prefer wired headphones",
    "content": "I had to buy a Belkin USB c charge adapter that contains a audio jack to fix the problem. I should not have had to do that. just because Apple took away the audio jack to force everybody into wireless headphones which frankly no one even knows what that will do to your brain over time I find really obnoxious.\nI thought Google was a leader not a follower.\nthey follow Apple's coattails like they were better than they were. plainly it sucks\nwe also make it impossible to get their phones from Verizon stores I'm purposely not stocking them. so I have to order it and wait days to get it at a time when my pixel phone is dying because the battery died went in like two and a half years of buying it.\nneedless to say I'm very annoyed with many of the things that Google does let me give you a list of the things I don't like\nthere is no decent diagnostic that will allow you to do monitor the CPU usage\nthere is no way currently that I'm aware of to fine-tune my notifications. even playing the ringtones in preview mode is made extremely difficult I think there been a lot of mistakes made by Google with their phone software I hope they fix them honestly I don't know what's wrong with them it took something that basically worked well in the first place and messed it up overtime and didn't give a damn I don't even know why I'm buying another one probably because of the decent camera and the fact that I have a track record with Android but I may bring it back if I see that this new phone is worse than the old one although I can't imagine going with an apple just because I just I find the whole thing in the morning I just thought you'd like to know that if you really did a survey you probably find that most people would prefer to have the audio jack as an option\nlet's not forget that audio jacks do not take up power the way Bluetooth does it sucks the life out of the phone so why are you forcing us to use a crappy battery draining device rather than wired headphones I mean do you even think about what you're doing a Google anymore or you just follow Apple these days. way to go to differentiate yourselves in the marketplace to let me tell you let's make it just like Apple that way there's no reason to go with Google at all great idea enjoy",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2019-12-21T19:27:12.748481+00:00",
    "reply": "1 Reply"
}