{
    "url": "https://support.google.com/pixelphone/thread/74341375/how-can-i-recover-data-from-boot-loop-pixel-xl-and-nexus-6p-and-then-wipe-them-clean?hl=en",
    "title": "How can I recover data from boot loop - Pixel XL and Nexus 6P - and then wipe them clean?",
    "content": "Long time Android user, first time poster -\n\nYes, I'm aware that I'm using older models. I typically buy them refurbished and have never really had many problems, up until recently.\n\nWhen my trusty Nexus 6P started having battery life problems, I got the next iteration, the Pixel XL.\n\nEverything was fine until last week when the Pixel started boot-looping. Figured it was hardware related as I dropped it, but it worked fine for a couple of days after the drop.\n\nI ordered myself a refurbished Pixel 2 XL and then popped my SIM card into the Nexus 6P so I could answer texts in the meantime - the Nexus 6P works, but just has to stay plugged in all the time.\n\nThe Nexus 6P has been sitting on my desk, plugged in. It worked just peachy for 2 days, then that started boot looping too - which tells me this might be app / software related and not hardware related.\n\nThe conspiracy theorist in me says that Google can somehow actively brick older phones so that I'll buy a new one...coincidentally the Android 11 update and Pixel 5 are coming out...guess that's a gripe for a different post, but thought I'd throw that out there.\n\nWhat I'd like to know is the following:\n\n#1 - Is there a way to recover any data from either of these phones? I believe the vast majority of my data gets cloud backup, but I think some of the unsaved pics in messages might be gone forever.\n\n#2 - Once my Pixel 2 XL arrives, I'm going to dispose of both of these. Aside from physically destroying them, how can I wipe them clean of my data?\n\n#3 - Can I avoid this happening in the future? Do I have to listen to my iPhone shaming friends and go to the Dark side?\n\nThank you,\n\nMark",
    "is_img": 0,
    "category": "Homescreen and Launcher, Google Pixel",
    "post_time": "2020-10-01T14:44:29.24817+00:00",
    "reply": "1 Recommended Answer"
}