{
    "url": "https://support.google.com/pixelphone/thread/28310738/pixel-3-not-3a-esim-no-add-carrier-option-provided?hl=en",
    "title": "Pixel 3 (not 3a) eSIM - No \"Add Carrier\" option provided",
    "content": "I am trying to understand why Google indicates \"Pixel 3 does support e-SIM functionality in select markets with select carriers\"  and what that means. I have no issue with certain carriers not providing eSIM functionality for their OWN networks (certainly their prerogative). However if I have a Pixel 3 and I am willing to remove the physical SIM from my primary/original carrier, why does the unlocked Pixel 3 phone not allow me to add an eSIM from a DIFFERENT carrier?\n\nSome details for context:\nphone was purchased in Canada from Telus.\nit is running Android version 10\n\nI have done a fair bit of troubleshooting and at this point have likely exhausted the options and the 'Add Carrier' option (or '+') does not become available to me for any of the following:\nHave removed the physical SIM\nHave reset the the 'Wi-Fi, mobile & Bluetooth\" environment\nHave invoked Developer mode\nHave restarted the phone through various combinations of the above.\nAll with no success.\n\nAt this point I getting close to filing a complaint with the Canadian regulatory body for permitting Telus to limit the functionality of a device even when it is not connected to their network. This goes counter to the regulations here in Canada. However, Telus is stating to me that Google provided the phone with restricted functionality. So... is Google DELIBERATELY limiting users of UNLOCKED Pixel 3 phones with access to eSIM functionality?\n\nWho can shed light on this?\n\nThank you.\n\nPS  I have already contacted Pixel support from Google on this matter and they indicated that they did not have information on this but that this forum is the sole manner to escalate this to appropriate experts in Google...",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2020-02-10T20:25:44.634967+00:00",
    "reply": "3 Replies"
}