{
    "url": "https://support.google.com/pixelphone/thread/17207747/finally-had-a-chance-to-try-a-pixel-phone?hl=en",
    "title": "Finally had a chance to try a Pixel Phone!",
    "content": "GUYS!!!!\nGUYS!!!!\nHave I got a wonderful story for you!\nSo I do IT for the company I work for. Now I will probably get trolled on this, but I chose iOS for our company because it is easier to manage and they have longer/fewer supported devices in general. This was a decision I took with my head not my heart, cause I prefer Android at it's core. But having had the pleasure of facing a Vice President \"wrath\" in the past, (I am not really scared of fancy titles, but it was a huge waist of my time) cause his iphone was unable to have a feature that an android had... You tend to learn lessons in life and try to avoid them if possible.\n\nIn any case we recently were allowed to have 2 free phones but it could not be apple phones. To my great \"sadness\" (I actually got drunk over the happiness I was feeling) I ordered two pixel 3a, figured I would use one and the other I gave to a user that I know will never ask for an iOS app.\n\nThe devices came in the 8th, I quickly opened a box and start transferring my stuff. Having no case I ordered them the next morning and kept using my iPhone. Case is nothing fancy, went on Amazon and I ordered amazon choice. It was suppose to come in Monday but BOOM for some unknown reason case is delayed. Do you peeps have any idea how long the wait was? Quitting sugar gave me less shakes than that. \n\nFinally, i get it on the 17th, just before I put it in the case, I lick the back of the Pixel phone to see if the rumors about them tasting like hot skittles is true... Do not do that shit, the skittle tasting part is a lie! It actually taste much better!\n\nAll jokes aside, I start using the phone and order myself a Android/ios Smart Watch to match (yet to arrive). I swim in android 10 gorgeous OS and much better assistant than siri. However! Yesterday night... I arrived pretty late from work, but I needed to do my workout. I grab the pup, go to the running track and start running with the dog in the dark. In the middle of a very short 200 meter run (was suppose to be 1.5k) the pup jumped in front of me and the phone dropped on the ground. I picked it up and kept going. The doggo was being way to annoying so I decided to call it a night. I get home and some of you probably guessed it, phone as a huge crack on the top. \n\nStill works A1 though... I will probably get it fixed instead of going back to iOS. Moral of the story is, a case is not enough spend the extra on a very good drop protection case.",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2019-10-19T17:21:49.82247+00:00",
    "reply": ""
}