{
    "url": "https://support.google.com/pixelphone/thread/43493374/pixel-4-xl-not-saving-gps-location-in-photo-file-metadata-exif-tags?hl=en",
    "title": "Pixel 4 XL not saving GPS location in photo file metadata (EXIF tags)",
    "content": "I sometimes (but not always) want my camera's photo files to record the GPS location where I took the photo.\n\nUnfortunately, I am never seemingly able to get this to work.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nDetails:\n\nMy camera app has the setting for \"Save location\" enabled.  (I think that this is the default setting; I never changed it; I have confirmed that my camera is set to enable this.)\n\nI generally do not use the Google Photos app, but I can confirm that its setting for \"Remove geo location\" is disabled.\n\nIf I then turn on my phone's GPS location (I generally have it off), take a photo, email the photo file (is in default JPEG format) to myself, and then view the file's metadata on my PC, I see nothing there about the GPS location.\n\nConcerning how I view the photo file's metadata, I have tried 3 different approaches:\n\n1)  my PC is a Win 10 box, and you can do this from File Explorer: right click on the file --> Properties --> Details\n\n2) open the file in XnView MP, view its properties\n\n3) open the file in Exif Data Viewer\n\nWith all 3 approaches, I do see plenty of other EXIF metadata in the photo files, so it is not the case that none is written.\n\nIts just that I never see anything that looks like GPS location data.\n\nBy the way, does anyone know the exact EXIF tag name used for the GPS location data?  Maybe I am overlooking it.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nMisc:\n\nI am aware of this discussion on this website, where Alex Sokolov seems to report a similar issue, with no apparent solution.\n\nAbout a year ago, a beta version Android at one point mysteriously dropped EXIF support.\n\nI always have my phone's \"Google Location History\" and \"Google Location Sharing\" turned off for privacy reasons.",
    "is_img": 0,
    "category": "Camera, Google Pixel 4 XL",
    "post_time": "2020-04-30T14:38:59.586599+00:00",
    "reply": "1 Recommended Answer"
}