{
    "url": "https://support.google.com/pixelphone/thread/67629764/pixel-3-xl-camera-color-balance-defect-still-not-corrected-nearly-a-year-later?hl=en",
    "title": "Pixel 3/XL Camera Color Balance Defect still not corrected nearly a year later",
    "content": "There are continuing complaints about the removal of color balance correction on Pixel phones. As of this date, nearly a year later, Google has demonstrated that they do not have the technical expertise to correct the \"automatic\" software  color balance issues (they appear to have gotten worse with the most recent OS updates) and \"for whatever reasons\" will not add back color balance adjustments, a foundation, expected requirement for taking quality images in any camera and a reason why so many advanced amateur and professional photographers selected Pixel. Reluctance to interact with the user base is disconcerting.\n\nGoogle cannot claim it's camera's produce high quality JPG images if it's software is unable to manage color balance correctly. Resorting to the use of RAW images is no excuse.\n\nAs Pixel owners, if camera image quality was a deciding purchasing factor, and Google will not fix the problem, we have to make a decision to continue with defective cameras (this is a defect), or move to another manufacturers device. While we're getting fairly sharp, technically corrected images, the color balance issue makes them look like cheap smartphone camera's from years past, and today almost any other manufacturers camera's provide a more pleasing image. Don't you feel embarrassed when in the past people complimented you on the image quality and now ask you what happened to these images, why so poor? You can only say, well it's Google.\n\nWe no longer have a product that justifies its asking price. It's time to move on for those who need the best quality images in their life applications.",
    "is_img": 0,
    "category": "Camera, Google Pixel 3 XL",
    "post_time": "2020-08-28T15:50:42.196546+00:00",
    "reply": "1 Reply"
}