{
    "url": "https://support.google.com/pixelphone/thread/589190/introducing-google%E2%80%99s-product-experts-program?hl=en",
    "title": "Introducing Google’s Product Experts Program!",
    "content": "Hi Everyone,\n\nGoogle’s Top Contributors and Rising Stars are some of our most active and helpful forum members. With over 1000 members globally, this community of experts helps thousands of people every year by sharing their knowledge and helping others get the most out of Google products.\n\nToday, we’re excited to announce that we’re rebranding and relaunching the Top Contributor program as Google’s Product Experts program! Same community of experts, shiny new brand.\n\nOver the following days, we’ll be updating our badges so you can recognize who our most passionate and dedicated Product Experts are:\n\nSilver Product Expert: New members who are developing their product knowledge\nGold Product Expert: Trusted members who are knowledgeable and active contributors\nPlatinum Product Expert: Seasoned members who contribute beyond providing help through mentoring, creating content, and more\nProduct Expert Alumni: Past members who are no longer active, but were previously recognized for their helpfulness\nRecommended Answers: Badge awarded to forum members whose posts have been marked as Recommended Answers\nGoogle Employees: Guides and Community Managers who work at Google\nCommunity Specialists: Google partners who lend their expertise to help maintain our communities\nAnd remember: Product Experts don’t work for Google. They’re regular users who are simply passionate about Google products and enjoy helping others. So, the next time you get a response from a user with a ,, , or , be sure to say thanks -- it might just brighten their day!\nThanks everyone!\n\nCheers,\n\nErin - Pixel Community Manager\n\nInterested in becoming a Product Expert? We’d love to have you! Sign up on the Product Experts website and start contributing to join our growing community of Product Experts.",
    "is_img": 1,
    "category": "Other",
    "post_time": "2018-11-19T22:52:05.682768+00:00",
    "reply": "0 Replies"
}