{
    "url": "https://support.google.com/pixelphone/thread/22128037/screen-situation-on-google-pixel-4-xl?hl=en",
    "title": "Screen Situation on Google Pixel 4 XL",
    "content": "Okay, I'm needing some help here.\n\nI just recently upgraded to the new Google Pixel 4 XL and I'm loving it, but, I'm paranoid about damaging it and had ordered the Zagglass Invisishield with the phone, alongside a case. I installed the screen protector as soon as I got it, but, it's already been damaged!!! I was watching a video from my friend's Razor Phone 2 that he had pulled up on his phone. It slipped out of my hands and onto my phone which was a measly 3-4 inches below and it damaged the screen protector... I have two concerns.\n\n1) I was told that these screen protectors come with warranties on them. How the heck do I take advantage of that if I purchased through Google?\n\n2) I'm not even sure if I want to get the same protector again if it's that miserably bad at protecting against the lightest form of impact ever known to mankind... I've already removed it because I can't stand having breaks or crap getting in the way of my display... While I hunt for another good, tempered glass protector that is shatter resistant, I'm now concerned about the rumors of bad oleophobic coatings on the P4 devices?\n\nI've read articles on Android Central, Android Police, and 9to5 Google where many reviewers have confirmed that the oleophobic coating is crap and has totally worn off on parts of the screen within 3 to 5 weeks of standard usage. I'm always wiping my screen because I'm OCD as heck and can't stand smudges and smidges on my screen. I'm really worried about encountering this issue before I can find a truly good \"entire screen coverage\", shatter-proof tempered glass screen protector.\n\nSo, all in all, I'm asking if anybody at Google can confirm if this oleophobic coating thing is a confirmed or official issue or not? Secondly, what can be done about my screen protector? Thirdly, if it can't be replaced now, can I at least get a refund for dropping $50 on a worthless screen protector?",
    "is_img": 0,
    "category": "Other",
    "post_time": "2019-12-06T18:10:29.060586+00:00",
    "reply": "3 Replies"
}