{
    "url": "https://support.google.com/pixelphone/thread/44439061/pixel-1-fails-to-boot-stay-on-what-s-wrong-with-it?hl=en",
    "title": "Pixel 1 fails to boot/stay on. What's wrong with it?",
    "content": "The device suddenly turned off and will not turn on reliably. \n\nSometimes it gets stuck in a boot loop where it displays the word \"Google\" or the spinning G animation and then goes blank and retries anywhere from 0-6 times without getting past it. Usually, on the last attempt before the cycle ends, there is a bar of pixel noise across the screen.\n\nVery occasionally, the device makes it to the lock screen. I've only gotten to this point about 5 times after countless attempts to power on and charge. At this point it usually freezes when I try to unlock it with the pin or if the physical buttons are pressed.\n\nOnce, the device didn't freeze when unlocked with the pin. I was able to activate data transfer mode and attempt to copy the files to my pc, but the device froze and shut off before anything beyond the folder structure was copied. \n\nDuring the few attempts that succeeded on getting me to the lock screen I was able to boot in safe mode (resulting in a freeze) and boot to recovery mode. In recovery mode, there didn't seem to be any options that would help me. I am trying to recover the data, I don't care about making the phone usable. I already have a replacement.\n\nThe phone did not freeze during recovery mode, but the restart after recovery mode resulted in a freeze. \n\nThe phone appears to charge normally when it gets to the lock screen. I was able to get it to 30%, but it doesn't charge when it is off. This is normal behavior, it didn't charge when off for the 2 and a half years I've owned it.\n\nThe day before the crash it gave me a warning that the device storage was full, so I suspect this might have something to do with the malfunction. I have always had a screen protector on the phone and a case. There is no damage other than a few scuff marks on the exposed areas.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2020-05-04T21:15:37.17368+00:00",
    "reply": "2 Replies"
}