{
    "url": "https://support.google.com/pixelphone/thread/106475122/issues-got-worse?hl=en",
    "title": "Issues got worse",
    "content": "Hey folks,\n\nI have the Pixel 4a now for many months since October and with the latest security update, the phone is a hot mess.\n\nReoccurring issues I had before the latest update:\nWifi connection issues\nInconsistent battery usage / drain\nPrivate DNS connection issues\nNo outgoing calls (wifi calls)\nAdaptive brightness not working\nIssue 1, 3 and 4 got fixed with previous updates but the latest security update absolutely made it worse than it was before.\n\nTo 1.: The Pixel 4a shows that I'm connected to my wifi network and during the runtime of the device, it just stops working. For example I can open apps that need a network connection and they just refuse to load at all. As soon as I close the app and open it again, those issues are gone. Also rebooting the phone or using mobile data fixes this issue temporarily. This issue occurs randomly over time. \"Adaptive Connectivity\" is enabled but even if I disable it, it doesn't change anything.\n\nTo 2.: Normally I got pretty good battery life out of the device. About 2 days runtime with 4-5 hours SoT. I'm a lite user so I rarely play games / use intense apps (like editing etc.). Enabled are \"Bluetooth\", \"Location services\" and \"Auto brightness\". Those things are always enabled and never faced severe issues like now. Currently my device dropped form about 90% to 60% in 6 hours of runtime with 1 hour 30 mins of SoT. After that it dropped from 60% to 36% in about 5 hours while the SoT was used 18 mins in those 5 hours. So my device lost 54% in 11 hours runtime with 1 hours 48 mins SoT. It is a far fetch from the previous battery endurance. My sister has the Pixel 4a too and she also experienced an higher usage with nearly the same tasks she did before. Also this issue makes it hard to go away for a couple of hours because the battery is not reliable anymore.\n\nTo 4.: Since the latest update, 3 out of 5 outgoing calls don't go through and there is no sound. So the phone just stops the call. I tried different SIMs from different providers and all of them faced this issue. It might be connected to the Wifi issues my device has.\n\nI face those issues constantly and most of them go away after updates but the latest security update absolutely made everything worse.\n\nThe Pixel 4a is an amazing phone but it just has too many critical issues so that I'm currently looking for a new device, which will be the Samsung Galaxy A52 if it does perform well.\nIt's a shame that such a good phone is not enjoyable anymore because updates ruin it. I know that updates can cause issues and that is fine but those issue reoccur over and over again.\n\nAt this point I choose Samsung even though I don't like the company itself but they are the only once that have proper update support (A52 gets monthly updates for 3 years) with good specs for a affordable price.\n\nIf you have any solutions for those issues, that would be a great help and if not, I see myself forced to switch to a different brand.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-04-16T22:15:39.049475+00:00",
    "reply": "4 Replies"
}