{
    "url": "https://support.google.com/pixelphone/thread/74185452/pixel-2-screen-not-completely-black-fix-problems-alike?hl=en",
    "title": "Pixel 2 Screen not completely black - fix? [& problems alike]",
    "content": "I repaired my Pixel 2 phone 3 months ago _\nAlso, the OS is Android 11 (the released - (didn't use the Beta)\nRecently my Pixel 2 turned off because of battery drain - \nonce starting to charge - it kept showing the charging symbol with some small glitches on the top of the screen top left side of the screen had some pixels on the screen with random colors,\nafter that disconnected the device from the charger - and saw that it kept on showing the charging icon, each time I checked,\nTrying to turn it on, it simply returned to the state of showing the charging icon.\n\nBasically couldn't do anything and the phone kept on showing it's charging or not doing anything at all.\n(it was trying to charge for around a minute and didn't turn on - it usually turns on near-instantly after being completely discharged and plugged.\n\nI decided to switch to a charger that is capable of providing up to 3Amp and plugged the phone to it.\nThe phone did turn on this time, but it seems like it is NO LONGER AMOLED - \nit acts a default LCD screen with the black pixels turned on- \nThe phone acts almost as normal except, there are no black pixels-\nbrightness control makes the screen somewhat grey and not only darker.\nWhen it tries to show an image with a lot of black pixels. (like when the screen is off / or the charging icon at the current state) - it updates that you can see how it updates it vertically from the top to the bottom and from the left to the right, near-instantly - you can see half of the screen updated than the other half in an almost unnoticeable delay.\n\nWhat I already did: (I mention this obvious stuff because you always like to mention it in replies and I really don't want that kind of reply )\nRestarted the phone\nDisabled Developer Mode\nRestarted the phone again\nMade sure everything is up to date (Android version and other stuff you can access via settings)\nFULL FACTORY RESET (which I knew wouldn't do much but I did it just so you HOPEFULLY won't reply as a fix suggestion in the replies)\nDischarging the phone completely and trying to charge it again (btw now works with the old charger)\n\nSomething I noticed, holding the power button when the phone is discharged:\nwhile updating the charging icon on the screen, sometimes it is possible to see the screen working along with the true black colour with white pixels turned on near it at the same time.\nKinda hard because most of the time black pixels are turned on but it is possible.\n\n\nThe bug or hardware issue still exists.\nAlso, once there was supposed to be a red light indicator when the battery is dead - why it shows the icon instead?\n\nPlease, please, please, before replying back, read the things I already tried before suggesting them again. (e.g. try factory reset) \n(as far as I know, I mostly received suggestions that seem to be CTRL C V instead of actual ones so I hope this time I'll get a better one)\n\nThanks for your time.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-09-30T20:33:49.714945+00:00",
    "reply": "0 Replies"
}