{
    "url": "https://support.google.com/pixelphone/thread/5174868/ear-speaker?hl=en",
    "title": "ear speaker",
    "content": "Hi Google team,\n\nI am using google pixel xl. Couple of days back my battery was not supporting well so I had to go for battery replacement. \nGL0063411- Battery replacement ticket raised by google support team. The phone went to B2X support center in Mumbai.\n\nWhen I received my phone I found that the front panel placement was not done properly. So I again called the support team, they escalated this issue.\nCase ID [6-4252000025495]- Front panel pasting was not done properly.\n\nThe Google support team and B2X team apologized for their mistake and again took my phone back to the service cneter in Mumbai for proper pasting of the front panel.\nGL0065429- B2X ticket for proper pasting of Front panel.\n\nYesterday my phone got delivered and now the ear piece speaker is not functioning properly.\nI called the Google support team and they told that they have escalated this issue to their supervisor and will look into it and supervisor will call me back regarding the issue.\n\nThis is really annoying, first the front panel was not pasted properly and at that time as well this was escalated and I was promised that the phone will be returned back in good condition. Now the earpiece speaker is not functioning properly and again google support team is saying that it will escalate this issue and look into it.\n\nThis is not the standard of Google, to provide so cheap and dissatisfying support. I have completely lost faith in the Google support team because even after escalation of the issue they repeat the same mistake. The support analyst told me that her supervisor will call me back regarding this issue but still there is no call from google support team.\n\nIt is impacting my business and work, Is there any one who can please help me out with this.\n\nRegards,\nAkshay.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-04-30T10:08:39.2708+00:00",
    "reply": "1 Reply"
}