{
    "url": "https://support.google.com/pixelphone/thread/3889011/pixel-1-stuck-in-boot-loop-boot-loader-wont-get-past-google-logo-wont-boot-into-safe-mode?hl=en",
    "title": "Pixel 1 Stuck in Boot Loop @ Boot Loader: Wont get past Google Logo, Wont Boot Into Safe Mode",
    "content": "Hi, I need some help and fast.\nMy Pixel phone which I have had right around a few months after launch has never before had any issues. But then all of a sudden today, while I was sending a text message, the phone froze on me. I thought it was weird but I wasn't that worried so I just held down the power button until it shut off. So I turned it back on, and it loaded the Google logo on a white background, and then nothing. It sat like that and still sits like that forever.\n\n  This is awful. I need my phone, i have no replacements options nor the money for any right now, i have a lot of data that i haven't backed up and I am supposed to be leaving in a few days and I have no way of communicating with the people ill be with.\n\nI called the Google Support team on a family members phone already. A very kind and understanding woman walked me through just about everything I had already tried with no luck.\nUnplugged:\nHolding the power button until it turned off then turning it back on\nVOL DOWN + POWER to load Fast Boot, trying to \"shutdown\" then turn it back on\nVOL DOWN + POWER to load Fast Boot, trying to boot into recovery mode (Boots immediately back to google logo)\nFast Boot: Resetting the boot loader\nPlugged in: (The phone will take a charge and displays the battery charging symbol)\nAfter leaving the phone off and plugged in for about 10 minutes I tried all of the above. Nothing. No luck.\n\nAt this point I have no idea what to do. I saw an earlier post someone made about a google pixel boot looping and and the \"Expert\" Named WashingtonWill recommend \"Applying a Rescue OTA to Pixel\" with a guide and links to the Android Debug Tool included. Im not familiar with this and it didnt seem like the same type of boot loop issue, and with the idea that my the Data on my device might still be recoverable, I do not want to brick the device further.\n\nPLEASE if anyone can offer any assistance or recommendations asap. This is the worst time for this to happen. I have access to a PC if that helps with any suggestions.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-04-10T00:58:52.387874+00:00",
    "reply": "1 Reply"
}