{
    "url": "https://support.google.com/pixelphone/thread/14738163/pixel-2xl-buggy-since-android-10-update-camera-photos-google-play-apps?hl=en",
    "title": "Pixel 2XL buggy since Android 10 update. Camera, Photos, Google Play apps",
    "content": "I've been having problems with my phone (Google Pixel 2XL) since I updated to Android 10 this morning.. It took a long time to install, but that wasn't the problem.\n\nMy problem is that the Camera app doesn't save my photos anymore. The \"last taken\" photo is a grey picture and every time I tried to snap a photo, I'll get a \"Processing HDR+\" notification and then nothing; the photo wasn't saved. When I tried to take a screenshot, it fails to save as well. \n\nWhen I open up my Photos app this morning, it initially showed my old photos and when I tried to delete anything, it turned white but wouldn't delete. So I did \"Free up space\" and deleted all the photos in my phone, so it's now empty. After clearing cache and storage for the Photos app, I was prompted to choose my settings and log into my Google account again, then it proceeds to \"Getting your photos...\" before crashing 2 minutes later.\n\nAfter searching Google's support forums, XDA and reddit, I tried clearing cache and storage (Camera, Photos, and Play Store app), force stopping the app, rebooting the phone in safe mode and rebooting normally again (probably did this more than 10 times), tried updating my apps in safe mode and normal mode but my Play Store kept crashing before any updates could be downloaded or installed. I then saw a few people fix their problems by allowing all permissions for the apps, so I did the same but to no avail. \n\nThe only thing I've yet to try was a full factory reset, but I'm hoping I wouldn't need to do that as I've read that other users tried resetting and their issues are still not fixed. I'm thinking that's gonna have to be my last resort, as I did not do a full backup of my phone before the Android 10 update.\n\nI can use my phone for regular apps like Whatsapp, Facebook, Instagram and still make phone calls, but I can't use the camera or check my photos.. Surprisingly, I am able to take photos from the Whatsapp app and send those photos as messages, but I can't attach anything from my gallery. I do use my phone for games as well, most will work albeit a little laggy, but some will freeze completely and would not register any touches or taps; just freeze for a solid minute before crashing. \n\nTaking photos is what I bought the Pixel phone for and I can't use that right now which is a real shame as the camera on this phone is really good. Is there a way for me to downgrade back to Pie to get the functions back? The ideal situation would be to fix my problem while keeping Android 10 but I'm desperate.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-09-19T02:11:49.522346+00:00",
    "reply": "66 Replies"
}