{
    "url": "https://support.google.com/pixelphone/thread/70291169/warranty-replacement-not-compatible-with-carrier-network?hl=en",
    "title": "warranty replacement not compatible with carrier network",
    "content": "I sent in my Pixel 2 for a warranty repair due to bulging battery on 8/31.  I received the replacement on 9/08.  The replacement phone is not compatible with Xfinity's network.  I contacted Xfinity to try to resolve.  Xfinity stated there is nothing they can do as the phone is not compatible with their network.  I contacted Google and I worked through all of the troubleshooting steps to no avail (lots of back and forth between google and xfinity support).  Google then directed me to resolve the issue with Verizon.  Google said the phone was a Verizon variant and Verizon should be able to fix the issue.  I don't even have a Verizon account.  I was several hours into trying to resolve, so I tried Verizon.  I explained that I don't have an account, but they tried to help me anyway.  Within minutes I was speaking with a level 2 representative (on the phone) as we tried to work through the issue.  I was impressed by the level of effort considering I do not even have an account with them.  After looking up the IMEI number and serial number, it was determined that they have no record of that phone in their database.  Verizon confirmed the phone was not locked by them or any other carrier.  They too stated that the phone is not compatible with their network.  Back to Google...  The google rep finally offered to send a new phone, but I would have to wait an additional 5-10 business days to receive the replacement phone and no way to guarantee the second replacement would be compatible.  At this point I asked to escalate the issue.  The rep agreed and that ended the chat.  About 6 hours later I received a quick email from the supervisor.  I promptly responded and haven't heard back since.  That was yesterday.  I am now on day 11 without phone service and seemingly no closer to a resolution.  I can't get a response from the supervisor and no idea how long I am supposed to wait around.  I tried to contact by phone, but when they call back came through I was disconnected before speaking to a human.  The policy of sending in the phone before they will send the replacement is ridiculous.  I am now two days into this and have spent more hours than I care to admit.  Not sure where to go from here other than giving up and purchasing a new phone from somewhere else...",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2020-09-10T15:09:06.608433+00:00",
    "reply": "0 Replies"
}