{
    "url": "https://support.google.com/pixelphone/thread/20404998/pixel-3-spontaneously-went-into-boot-loop-for-roughly-15-minutes?hl=en",
    "title": "Pixel 3 spontaneously went into boot loop for roughly 15 minutes",
    "content": "On Friday, Nov 15, I was sitting in my living room with my Pixel 3 next to me on a table. I saw the screen activate out of the corner of my eye and when I looked over, it was rebooting. It got through the G logo on the white screen to the full Google logo, then rebooted again. Then again, and again, and again.\n\nI picked it up and tried power + volume down to get into Fastboot, but it rebooted before I could navigate with the volume buttons and choose an option. I got it into Fastboot a few more times with the same results.\n\nI was resigned to leaving it off the charger until it drained itself and then trying to plug it in and boot it cold, and suddenly it successfully booted after 15 minutes or so, but with Airplane Mode turned on. I turned off Airplane Mode but it wouldn't connect to cell, just wifi. I rebooted into Safe Mode with the same results--Airplane Mode initially, then wouldn't connect to cell. I rebooted it once again into normal mode and it came up out of Airplane Mode and connected immediately to both cell and wifi, and now it's acting normally again.\n\nI installed Android 10 and the most recent security update pretty much as soon as I got the notification for each of them, so it's been a while. I did notice my battery draining very rapidly on a couple of days earlier in the week, but that also seemed to clear up on its own.\n\nI really don't know to do next as far as troubleshooting, but this clearly isn't normal behavior. I don't know what precipitated the situation on Friday and so I don't have any idea if/when it'll happen again, or if it'll come back to normal again if it does. What can I do to get some idea of what happened?",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-11-18T23:39:14.76306+00:00",
    "reply": "3 Replies"
}