{
    "url": "https://support.google.com/pixelphone/thread/9107254/sms-text-messages-send-to-others-from-my-pixel-3-in-germany-disappear-in-receiver-s-phone?hl=en",
    "title": "SMS (text messages), send to others from my pixel 3 in Germany, disappear in receiver's phone.",
    "content": "I just bought a new Google Pixel 3 last week from Mediamarkt in Germany and I have a problem that, all the SMS (text messages), which I send to others, disappear in receiver's phone.\nThe texts in English and German are no problem at all but the texts in other languages (I tried Chinese, Japanese, Korean, Russian, Hebrew, Arabic, Persian) disappear completely. It means that, I write and send them, and can see them in my phone, but the receivers see nothing (empty space) in their phones.\n\nI have already tried many methods but still can not solve it.\n1. I updated the system (Android 9, Security patch level: July 5, 2019)\n2. I updated the newest google messages app (today, July 2, 2019) and all my other apps.\n3. I tried another message app (facebook messenger) to send the SMS Chinese texts and the problem is the same.\n4. I changed my system language from English to Chinese and the problem is the same.\n5. I reboot and and the problem is the same.\n6. I tried other apps, which are not SMS, such as gmail, whatsapp, line, wechat and etc., Chinese texts are totally no problem with these messages through internet.\n7. The sim card and the telecommunication provider are the same as my previous old smartphone and there is no problem with the old phone. I also try different the different provider, the problem is the same.\n\nIs this the malfunction, which I need to exchange a new device or repair? I try to contact google customer service but there is no reply after waiting for one week.\n\n2019.07.20\nThank you for your reply! I went to test the demo google pixel 3 in the big consumer electronic market \"Mediamarkt\" in Germany, at which ordered the phone in the online shop. The same problem happened in the demo pixel 3.\nBesides, I already contact google customer service two weeks ago with all the detailed explanation of the problem. But I have not yet received any further information. They only told me at that time, \"I have never heard this problem before. I will contact the related department.\"",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-07-02T10:13:03.866596+00:00",
    "reply": "1 Reply"
}