{
    "url": "https://support.google.com/pixelphone/thread/1663322/usb-c-adapter-for-audio-is-not-working?hl=en",
    "title": "Usb-c adapter for audio is not working",
    "content": "(PLEASE READ THE FULL POST WITH UPDATES)\nI have been using my pixel 2 xl for almost 9 months. Today I tried to play music via usb c to audio jack dongle (which is original and supplied in the pixel 2 xl box) but music started playing from the speakers. Yesterday it was working just fine. My headphone is working on every other device I own. I thought that my usb c to audio jack dongle is broken but I tried it on the usb c port in the laptop and it is working just fine. When I connect the dongle to my phone, there is a notification of charging connected device via usb. On tapping for more options I tried to change the usb control to 'this device' but it says that it cannot switch. All options under 'use usb for' are grayed out. I tried to switch on usb debugging in developers option and turned off  tethering hardware acceleration option (these were some potential fixes I saw on the net) but nothing worked. I updated my phone to the latest version of android p (security patch level feb 5 2019) and have restarted my phone multiple times but nothing is working. I also tried to connect my phone to my laptop via usb c but my device is not being recognized by the laptop. My phone is charging just fine. I am sure this is some software issue and I am getting very irritated because nothing is working. Please help asap.\n\n\nUpdate: I posted this a long while ago. I contacted google helpline and they said that they would try to repair my phone since it was under warranty. Unfortunately I had to go out of station urgently and couldn't set up pick up. When I came back from the trip, I plugged in my adapter and headphones and it worked miraculously. I originally posted it in feb and today is 6th july. I had no problems with the dongle until today that is why I abandoned this post. Now I am very very sure that there is no hardware issue. The best advice I can give is to give your phone 1 week and it will fix itself. I still don't understand what happened, I never changed any settings. If this does not scream bugs then I don't know what will. This post got so much attention, I just hope that google reads this and tries to get a software update as soon as possible to fix this. \n\nUpdate2: Finally after enough frustration, I decided to give my phone for repair. I live in india and google offers repair services in collaboration with a third party company called b2x. The field technician told me that the problem would be due to some rusting in the usb port and it fixed itself by chance (I still don't believe it though). He took my phone for repair and he fixed it. My phone was under warranty so luckily I didn't have to pay anything. Now it is working well and the customer service was great. So maybe if your phone is under warranty then I would recommend to contact google and get it repaired as soon as possible.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-02-15T17:33:13.303968+00:00",
    "reply": "2 Recommended Answers"
}