{
    "url": "https://support.google.com/pixelphone/thread/52848853/pixel-3-camera-focus-hunting-issue?hl=en",
    "title": "Pixel 3 camera focus hunting issue",
    "content": " I have a Pixel 3 phone that started exhibiting the dreaded camera focus hunting problem on the rear camera a few months ago but I didn't realize it was such a persistent problem until recently and of course, lo and behold, the warranty period was up at the end of April so I'm about a month out of warranty.\n\nTo make matters worse, I used the online support chat and got some 1st level support person walk me through all the usual steps, install/reinstall Camera app, clear app cache, reboot in Safe Mode, and finally doing a factory reset.  Having done some research before asking for support, I knew these steps were very unlikely to help and it is a hardware fault on the phone but to appease this support drone who was clearly just running through the help desk scripts, I dutifully went through all the steps again.  \n\nWhen we got to the factory reset step, I was hesitant because a) I knew this was almost assuredly a hardware issue that a factory reset would do NOTHING to correct and b) even though I had my phone backed up, I figured it would still cause issues afterwards.  Well wouldn't you know it, factory reset did NOTHING.  The support drone directed me to getting out-of-warranty service on it from ufixit.  I assume this will end up costing me a good chunk of change and they'll probably just give me a refurb phone that I'm guessing may be prone to the same camera focus issue somewhere down the line.  \n\nAnd of course, after restoring the phone, I discovered all my 2FA apps didn't restore settings (by design) so I'm trying to deal with getting those all set back up, which is a total mess... google authenticator, microsoft authenticator, mobile duo, last pass authenticator, etc.  In many cases this requires getting tech support from website that I had 2FA turned on for to get working again.\n\nAll-in-all, it was a very disappointing experience with both the online chat support and with google's lack of acknowledgement for this hardware issue.  It reminds me of the sour taste in my mouth when I ran into google's lack of support for the dreaded Nexus 6p battery drain issue, which is why I had to upgrade to the Pixel 3.  \n\nIf anyone has had any luck getting their \"out of warranty\" Pixel 3 camera focus issue resolved, please share.",
    "is_img": 0,
    "category": "Camera, Google Pixel 3",
    "post_time": "2020-06-11T16:29:58.512766+00:00",
    "reply": "0 Replies"
}