{
    "url": "https://support.google.com/pixelphone/thread/17201923/pixel-3-power-button-toggling-when-not-pressed?hl=en",
    "title": "Pixel 3 Power Button Toggling when Not Pressed?",
    "content": "Last night, I was at a concert, and beforehand I had been taking pictures. However, after the concert my phone started buzzing non-stop, and it was due to the fact that the camera was being continuously launched (usually by double pressing the power button), as well as the power menu continually coming up. I took off my case, to ensure that there wasn't anything holding down the power button, but it still continued. I decided to restart my phone in the hopes that it would stop toggling the power button, and regain functionality. However after the restart, my phone continued to keep toggling the power button, and when I tried to use my phone normally, Android 10 completely crashed, and displayed the message telling me that \"My Android System was corrupt and that my user data was also corrupt\" and it gave me the option to \"Try Again\" as well as \"Factory Reset\". I chose \"Try Again\" because I hadn't had the chance to back up my photos and I really wanted to have them. However, after the first 15 attempts, I decided to factory reset my phone (Something to note, to choose whether or not to \"Try Again\" or \"Factory Reset\", you have to use the power button to select your option, and my power button WAS STILL TOGGLING EVEN WHEN THE ANDROID SYSTEM WASN'T LOADED). Eventually I gave up on recovering my photos and Factory Reset my phone. However, as soon as my phone loaded back up into setup mode, the power button started toggling AGAIN. I cannot physically set up my Pixel 3 phone again, due to the fact that the power button will NOT STOP TOGGLING. Keep in mind that the PHYSICAL button itself presses in fine, and doesn't have anything touching it. For some reason Android thinks that I am pressing it nonstop??\n\nLuckily, I have an old iPhone that I was able to move the sim card over to, but I spent a lot of money on my Google Pixel 3, and I would really like to know why the power button will not stop toggling after a factory reset, AND at the base level of android. \n\nTLDR; My Google Pixel 3 (less than a year old) will not stop toggling the power button when there is nothing touching it, somehow corrupted entire OS, continued toggling at base recovery level, and continued after factory reset. Phone is UNUSABLE. The power button itself works fine, I can still press it in like how it was when I first bought it.\n\nHas anyone else had this problem or have any suggestions on how to fix it?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3",
    "post_time": "2019-10-19T15:54:20.916319+00:00",
    "reply": "1 Recommended Answer"
}