{
    "url": "https://support.google.com/pixelphone/thread/2009709/hi-i-purchased-my-google-pixel-when-it-was-released-however-now-it-s-useless-as-it-freezes-whenever-i-receive-or-make-a-call-phone-operates-fine-till-i-receive-a-call-and-then-the-phone-freezes-it-keeps-showing-the-person-calling-animation-and-it-doesn-t-go-forward-nor-i-can-cancel-the-call-thr-phone-completely-freezes-as-soon-as-someone-calls-speakers-and-mic-dont-work-shutting-down-the-phone-is-the-only-option-i-don-t-know-what-s-wrong-with-the-phone-can-t-understand-whether-its-the-software-or-hardware-i-ve-already-tried-the-following-things-1-resetting-and-reboot-2-installation-of-new-software-3-upgrading-to-latest-os-and-then-downgrading-to-previous-one-4-going-on-beta-android-p-all-these-things-didn-t-really-help-if-anyone-knows-how-to-solve-this-problem-please-let-me-know?hl=en",
    "title": "Hi .I purchased my google pixel when it was released. However, now it's useless as it freezes whenever i receive or make a call. Phone operates fine till I receive a call and then the phone freezes. It keeps showing the person calling animation and it doesn't go forward nor i can cancel the call. Thr phone completely freezes as soon as someone calls. Speakers and mic dont work. Shutting down the phone is the only option. I don't know what's wrong with the phone. Can't understand whether its the software or hardware. I've already tried the following things: 1. Resetting and reboot 2. Installation of new software 3. Upgrading to latest os and then downgrading to previous one 4. Going on beta android P All these things didn't really help. If anyone knows how to solve this problem please let me know.",
    "content": "Hi everyone! I purchased my google pixel when it was released. However, now it's useless as it freezes whenever i receive or make a call. Phone operates fine till I receive a call and then the phone freezes. It keeps showing the person calling animation and it doesn't go forward nor i can cancel the call. Thr phone completely freezes as soon as someone calls. Speakers and mic dont work. Shutting down the phone is the only option. I don't know what's wrong with the phone. Can't understand whether its the software or hardware.\nI've already tried the following things:\n1. Resetting and reboot\n2. Installation of new software\n3. Upgrading to latest os and then downgrading to previous one\n4. Going on beta android P\nAll these things didn't really help. If anyone knows how to solve this problem please let me know.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 2",
    "post_time": "2019-03-03T14:42:23.466473+00:00",
    "reply": "1 Reply"
}