{
    "url": "https://support.google.com/pixelphone/thread/13292343/pixel-2-xl-bottom-corner-touch-issue-is-there-any-way-to-fix-this?hl=en",
    "title": "Pixel 2 XL bottom corner touch issue, is there any way to fix this?",
    "content": "I just bought a Pixel 2 XL and was trying it out when I was having trouble getting the \"tap to rotate screen\" button in the bottom right corner to work (the feature that was new with Pie). I also noticed that in a mobile game I play, a small button in that corner was difficult to press.\n\nAfter some experimentation, I learned that it works 100% of the time if I do a very quick tap, but if my finger contacts the screen for more than a split second then it registers no tap at all.\n\nI used a touchscreen tester app and found that this issue applies to the right edge of the screen as well. 95% of the screen is perfect, both quick taps and slow taps and long \"press and hold\" touches all register just fine. But on the bottom corners and part of the right edge, it's fast taps only.\n\nI looked for info about this issue and found other people mentioning it but no solution seems to have been found. Apparently there was another issue where if you changed the default text size taps wouldn't register at all, and that issue has since been fix by Google, but that's a different problem from what I'm describing here.\n\nThere are also Youtube videos demonstrating the issue. You can see that even the slightest hint of extended contact with the finger results in a tap not registering at all. Fortunately the vast majority of the screen doesn't have this issue, but this is not what I expected when I bought a Google Pixel phone. I can probably learn to just use quick taps when necessary, but it would be nice if all taps registered the same.\n\nDoes anyone have more info about this, or a way to fix it?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-09-01T00:01:12.557177+00:00",
    "reply": "1 Reply"
}