{
    "url": "https://support.google.com/pixelphone/thread/80189829/pixel-5-wireless-charging-bug?hl=en",
    "title": "Pixel 5 wireless charging bug",
    "content": "I know there have been a number of reports of issues with Pixel wireless charging or maybe issues with Android 11, in general. But, I haven't seen a report of my specific symptoms so I thought I'd add them.\n\nA lot of the time wireless charging seems to work well on the multiple Qi chargers I have around the house. All support Qi EPP at up to 15W with a 25W QC adapter, or \"12-13W\" with the QC 2.0 adapter curiously supplied with the charger.\n\nOccasionally though, for seemingly no good reason charging will rapidly grind to a halt, for example saying that the phone is at x% (50, 60, 80, 90 - it doesn't seem specific to a particular battery level), with an estimated many, many hours to completion eg. 13 hours. Even rebooting the phone or moving it to another charger does not seem to fix it. The back of the phone in this situation is kinda warm, so maybe it has thermally throttled. But, there is no good reason why this would have happened - the phone is not being heavily used at the time, it is not in a hot location, really nothing is different to the other times when charging works perfectly.\n\nUsing a tool to look at the battery the charging power has dropped to 0.2-0.5W, which explains the long charging time! The battery temperature is shown at about 38C. I'm unaware of what temperature thermal throttling should occur.\n\nSo, it seems, at times the Pixel 5 (and other Android 11 phones?) seems to just about shut down wireless charging, even in circumstances of use and location, when this should not be necessary. It may possibly be caused by overheating. I guess this could be caused by one or more processors being stuck in a high power state.\n\nHopefully, this may help in identifying the issue.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 5",
    "post_time": "2020-10-31T14:49:55.183111+00:00",
    "reply": "0 Replies"
}