{
    "url": "https://support.google.com/pixelphone/thread/9499755/google-pixel-phones-fall-short?hl=en",
    "title": "Google Pixel phones fall short",
    "content": "     My wife and I have had our Pixel 2XL phones for a year.  They have had minor inconveniences through out the entire year.    I am just now writing to you here because I am getting NOWHERE with Google help desk.    Here is my problems for both phones.  There have been several times they wouldn't connect to any WiFi router and then I noticed that some of the apps were running very slow.  It seems that after a factory update (at least every other one it seems) I need to reset our phones totally and use the backup to reinstall everything back on the phones.    The phones will automatically restart with NO action asking for it.   Now my biggest issue with my phone is that it is now taking over 10 hours to charge from 57% battery.   I have a screen shot of it telling me that it is going to take 15 hours to charge from 10%.   I have already tried cleaning out the charging port, and going through the Google automated line.  Lets just say that after going through all the steps to try and fix the problem, it left my phone in safe mode.  I had to yet again reset my phone.   I called and finally spoke to a human being that could not speak English very well, but he manged to tell me that I needed to give Google my phone and they would see why it was acting the way it is.  Oh, did I mention that that process was going to take 7 to 10 days?    We use our phones for work purposes and cannot be without them that long.   Again, I have contacted Google about my phone and not my wife's phone directly because of the issues we are having.  I figured if I could get the fix on my phone, than I could use the same fix on hers.   By this time, we just want to get away from these Pixel phones. In short, THESE THE WORST PHONES I HAVE EVER OWNED. I have been on a cell phone of one kind or another for over 20 years. \n       We were talked into them and have not liked them the entire time we have had them.   The customer service for Google is good, but they are more worried about making sure their product is seen in a good light instead of helping the actual customer out.     I am posting this exact message on every message board I can find.  All I am asking is to get out of these phones.   I will spread this negative message everyday until I get the results I am looking for.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2019-07-08T17:50:26.577896+00:00",
    "reply": "1 Reply"
}