{
    "url": "https://support.google.com/pixelphone/thread/58225794/pixel-3-connected-no-internet?hl=en",
    "title": "Pixel 3 'Connected, No Internet'",
    "content": "Hey all, \nOkay, I've read many of the posts and responses here on the Board and have read through and tried the possible solutions provided through Google and Verizon. \nProblem (?): When I go to Settings > Network & Internet > Wi-Fi [on] > abc123 Network / No Internet > open selected Wi-Fi Network > Connected, No Internet > Wi-Fi Icon in Notification bar is Not Populated [blank with an 'x']. I have tried setting it up while in Safe Mode. I have Restarted the phone. I have Updated the System [Android v.10], I have 'Forget the Network' and re-connected; under abc123 Network it reports Good to Excellent Signal Strength; Frequency 5 GHz; Airplane Mode toggled; > Network Usage > Detect Automatically [toggled]; Hotspot & tethering [Off]; Data Saver [Off]; have '4 to 5' Bars in Signal Strength displayed in Notification bar.\nI am able to Browse as it must be through Cellular Data.\nThe issue became apparent as my 'myQ' garage door app would not connect. After seeing that the myQ app had not been able to connect for the past 12 days, it started me to wonder if I had been without Internet for the past 12 days. \nNow, the tougher part (at least for me), I have great Internet in the home; I have restarted both the modem and the router. I have no issues using a laptop. The speed on my laptop (Wireless Connection) is 73 Mbps Download / 6 Mbps Upload.\nI'm not sure what else there is to try.\nAll the trouble-shooting pages / posts / responses I have read state that if I read 'Connected,No Internet' then there most likely is an issue with my Internet. The Internet doesn't seem to have any issues. I'm just curious as to why I am not able to get a Wi-Fi connection with the Pixel 3 when there appears to be plenty and that it is good?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2020-07-10T19:00:55.662006+00:00",
    "reply": "0 Replies"
}