{
    "url": "https://support.google.com/pixelphone/thread/21295436/two-faulty-pixels-terrible-customer-service?hl=en",
    "title": "Two faulty Pixels - terrible customer service",
    "content": "I originally purchased a Pixel 3a from Google Store on 28 May 2019.\n\nAround begining of October started experiencing issues with phone restarting itself several times when outside. It appears to be an issue with cold.\n\nContacted Google customer support on 28 October 2019 (case ID 9-6221000028169) and was advised to try phone in safe mode and factory reset. Tried both these things and neither solved the issue. I contacted Google support on 12 November to advise that these actions had been unsuccessful and I was excercising my warranty option.\n\nGoogle support then provided the emails of instructions etc. I ordered my replacement phone on 13 November via the email sent to me.\n\nA replacement phone was received on 18 November. This was a refurbished phone, rather than a new one. I went to set up the replacement phone on 19 November and realised the replacement phone was also defective - areas of the screen are unresponsive.\n\nI called Google support immediately on realising the issue on 19 November. I was told I had to return the original phone, and keep the replacement phone even though it was more defective that the original phone. I was told my issue would then be solved once the phone was returned.\n\nI returned the original phone via the pre paid label provided on 19 November.\n\nNo further update from Google.\n\nRequested a call back from Google support 25 November, stayed on hold for 22 mins but no response. I am trying to contact Google support to rectify the issue but I can't see how to contact anyone. I can't request a call back through the setting on my phone as the button to request is on the area of screen that doesn't work! I am in the UK and am trying to contact during business hours. Really disappointed with Google.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a",
    "post_time": "2019-11-27T11:54:21.983499+00:00",
    "reply": "0 Replies"
}