{
    "url": "https://support.google.com/pixelphone/thread/51068777/google-pixel-2-stuck-in-bootloop-i-do-not-want-to-factory-reset?hl=en",
    "title": "Google Pixel 2 stuck in Bootloop - I do not want to factory reset",
    "content": "My Google Pixel 2 (running May version already) was working fine until last week.  I don't recall if my memory ran out, but I don't think so.  After using it for a while, I drove home, and when I got home, the phone was off.  Thinking that the battery was just dead, I plugged it into a charger , turned it on, and didn't think too much about it.  When I next looked at my phone, it was stuck on the G logo with a loading bar under there.\n\nI tried turning the phone off, charging it more, etc.\nI contacted google support and they told me that the only way is to factory reset (i want to keep my data, though).  I began looking online and came across sideloading OTA, which seemed to be the only way to save my data. I am not that tech savvy and wasn't sure how to do it, so for a second time I contacted google support, they told me that for sideloading, I should go to a UBreakIFix, an authorized Google repair place. I made an appointment and when I got there, I asked them to help do a sideload of the OTA or more information about it, and the technician didn't even seem to know what that is.  Then after a long diagnosis, they also told me that i have to factory reset and wanted to charge me $80 to do so...\n\nI decided to come home and try to sideload myself.  \nTechno Bill had some very detailed explanations on how to do it, and some of the google support threads also gave other suggestions as well.  I appreciate all of them and went through everything.\n\n  While trying to sideload, I came across a few issues:\n- First, I tried to sideload from my laptop (windows 10), which only has USB C ports.  Apparently, this sideload doesn't work when you use USBC to USBC cables, so it kept getting stuck at verifying update package.\n- Then, when I realized that, I switched to a desktop running windows 7.  And my USB C to USB A cable.  But my computer wasn't able to read my Pixel 2. Thinking that it was that my computer was too old, I went to my parents house.  (I later found out that it was my USB C- USB A cable that didn't work)\n- Then at my parents house running Windows 8, my sideload worked, but at 94%, it always said completed with Status 0.  Then it would prompt me to reboot, which it did, but the bootloop still continued.   On the videos online, it never showed a completed with status 0, so I'm not sure what I did wrong\n- Then I tried going to a friend's house, windows 10, and tried the same, and every time, it would complete with status 0 at 94%.  \n\nThen I kept searching and tried different OTAs like P version or previous versions, etc. and they would usually say \"installation aborted\" because the version is a downgrade.  Also tried powering off and on 7 times, \n\nI thought that maybe I needed to use a new version of Google OTA, which just released this week (June version), but for some reason, it still tells me that it's a downgrade, when my phone's current version is the May version.  \n\nDoes anyone have any idea what I should do at this point?\nI would really like to keep my data.  \n\nThanks in advance.",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2020-06-03T19:57:50.680596+00:00",
    "reply": "1 Reply"
}