{
    "url": "https://support.google.com/pixelphone/thread/103913606/phone-screen-has-horizontal-lines-and-they-are-not-screen-burn-in-issue?hl=en",
    "title": "Phone screen has horizontal lines and they are not screen burn-in issue",
    "content": "Today, my phone screen started to exhibit horizontal lines. They started to appear today and I thought I mechanically damaged my phone. These lines are very thin, like as thin as hair strand but they are colored gray. I went to a service center and they said its not a hardware issue since I can still use every part of the screen.\n\nBut when I adjusted the screen brightness from low to high, the gray horizontal lines disappeared as long as brightness level is high. But when I get it back to low brightness (which I prefer for my eye's sensitivity), the gray lives appear. \n\n(You can visualize this as having windows blinds with a bright sun outside. Looking at the window with the window blinds fully deployed, there are dark horizontal spots and bright horizontal spots. This symbolizes low screen brightness. But when you roll the windows blinds up to expose the sun, the dark spots disappear and the high brightness takes over everything. This symbolizes high screen brightness.)\n\nThis is how I know its not screen burn-in since the dark spots moves.\n\nI wish I could take a screen video but it doesn't appear (i tried).\n\nDoes anybody experience this?? I hope this is just a software problem and the bug can be fixed.\n\nI haven't reset it to factory settings, but that's the ungodly last resort.\n\n*EDIT*\nI have added this GIF to the post. I'm sorry for the moving diagonal lines as it comes from my other phone. As you can see in the video, there are horizontal dark spots and bright spots which appear and disappear if you change the brightness level. It is hard to spot in the GIF but it is pretty noticeable with the naked eye.",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 4",
    "post_time": "2021-03-26T04:36:59.058612+00:00",
    "reply": "3 Replies"
}