{
    "url": "https://support.google.com/pixelphone/thread/23562434/over-current-status-detected-when-pixel-2-xlconnected-to-jvc-kw-v830bt-head-unit-phone-problem-or?hl=en",
    "title": "Over Current Status Detected when Pixel 2 XLconnected to JVC KW-V830BT head unit. Phone problem or?",
    "content": "Hi all,\n\nI have a Pixel 2 XL which I connect by cable to my JVC KW-V830BT car audio head unit.  Sometimes, I'll get an error that reads \"USB Device Over Current Status Detected\" displayed on the head unit and the connection to my phone cuts off.  10-15 secs later the connection restores on its own.  Then within a minute, the error occurs again.  This can happen over and over again during a 30 minute drive or won't happen at all over days of use even on long drives.\n\nI've tried:\nUsing 3x different 1m USB cables, currently using an expensive cable from a Verizon store.  Note: The original phone cable that came with the device was a charging cable that plugs into the wall and is only USB on one side. Can't be used for this purpose.\n\nRebooting phone and audio head unit. \n\nTurning power on/off to the vehicle.\n\nReplacing the phone.\n\nResetting the new phone to factory settings.\n\nUpdating the head unit to most recent firmware.\n\nWhat I've found is there isn't an apparent correlation, the error just starts happening and eventually stops.  Comes and goes \"at will\".\n\nJVC says I should try using a different phone for a while because \"[I'm] using an old phone.\" ...sigh, it was new when the head unit was being sold 2 years ago.  Plus, I don't have a spare phone lying around that is as new or newer as the one I'm currently using.  So that's out.  I can also mail the head unit in for testing but if they can't reproduce the error then they won't do a warranty replacement, since I don't know what causes the error I doubt they will encounter it.\n\nCan someone tell me what this error means?  Is it a phone problem or an issue with the head unit?\n\nThanks\nG",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-12-22T19:55:45.85118+00:00",
    "reply": "2 Replies"
}