{
    "url": "https://support.google.com/pixelphone/thread/38275121/restoring-a-backup-which-is-not-visible-on-restore-from-the-cloud?hl=en",
    "title": "Restoring a backup which is not visible on \"Restore from the cloud\"",
    "content": "Hello everyone,\n\nAfter trying to solve my issue with Google Support (unsuccessfully) I'm coming here to see if you can help me.\nI was an extremely happy owner of Pixel 3. After using it for 11 months I started having problems with the charging. The phone wasn't charging and after many plug in and out it may start charging. Instead of going straight for a warranty repair I decided to restore the factory setting of the device (just to be sure that there isn't any faulty application). I created a backup of everything. After the sync, I checked the Google Drive and saw that the backup was there with the correct date and time.\nI did the factory reset and followed the Steps from the Help Centre (https://support.google.com/pixelphone/answer/7179901?hl=en) but on step 5 I'm not seeing my backup. As it was a test to see if the charging will work I decide to continue with clean Android installation (because the backup wasn't visible). After signing  to my account and opening the Google Drive my backup was visible (but can't restore it from Google Drive).\nI contacted Google Chat support for the first time and did few Factory resets with them (I was sharing my screen). Unfortunately the support was extremely bad and they weren't able to help me with the backup issue. As the charging wasn't working after a 90mins on the chat I decide to request a repair for my Phone. It came out that the charging issue is because of a hardware problem and they sent me a new Pixel 3. \nIn the meantime I bought a Pixel 4 and was really hoping to restore my backup from the Pixel 3 (to get my call history, messages and settings), however on step 5 my backup wasn't showing at all. After another chat with their support and many factory resets of the brand new Pixel 4 they weren't able to help me (again).\nIn few days time I decide to call them (6th March 2020). Unfortunately after another 2 hours they came to the assumptions that a senior consultant is needed for my case. For such a consultant they need to arrange a new appointment and someone will get in touch with me. After chasing them on 24th March 2020 I got an email from \"Subject Matter Expert\" with request to explain him what steps I have been taken to try to restore the backup. To be honest this email made me so mad and angry as I already have spent around 4-5h with 3 different consultants doing a factory resets of the device and trying to restore the backup. Every one of them was saying that he/she is putting notes in my case so the person who will pick the ticket later will know the status. However everyone of them required from me to start from scratch as they need to verify it's still happening to be able to redirect me to an \"Expert/Senior\". I replied very politely to the \"Subject Matter Expert\" with everything I have tried and probably as you are expecting no one came back to me. \n\nExcept the offical document from Help centre I tried those steps, but without luck\nFactory reset replacement phone\nSkip all setup, restore, login settings during setup\nConnect to Wifi network\nAllow any system apps to update, but don't login with any Google Account (Play Store will not allow login, but some default apps will update anyway)\nOpen Apps list in settings and choose to display System apps\nClear Storage for:\nGoogle App\nGoogle Play Services\nGoogle Services Framework\nPixel Launcher\nPixel Setup\nRestart Phone\nChoose option from notification shade to complete setting up Pixel\nLogin and restore from cloud back\nHome Screen restored\n\nWanted to check if someone have experienced similar issue with their Pixel backup and were you able to restore it?\n\n\nHere are some thoughts about their support if anyone have another few minutes to spend:\nThe support is just ridiculous. Reading through the script.\nThey don't put any value to the customer/user. To be honest I doubt I will get another Pixel or any Google Device as after buying the device I can't get any help from them. Not mentioning that because of their faulty software I lost important messages and phone history. My Pixel 3 backup expiry in 3 days",
    "is_img": 0,
    "category": "Other, Google Pixel 4",
    "post_time": "2020-04-06T11:38:29.133072+00:00",
    "reply": "0 Replies"
}