{
    "url": "https://support.google.com/pixelphone/thread/7099047/frp-on-used-phones-thrown-in-garbage-by-owner-makes-the-phone-unsustainable-and-enviromentally-evil?hl=en",
    "title": "FRP on used phones thrown in garbage by owner makes the phone unsustainable and enviromentally evil",
    "content": "I am trying to get past the FRP on a Pixel 2 that was thrown in the garbage by the owner in its original box and set right ontop of the garbage pile , box open with everything original and only missing the power block.\n I managed to finally get it factory reset only to come up against your FRP.\n  There are countless cellphones, laptops, tablets, etc. thrown away every day by people who refuse to pass them on to someone who can use it.\n The FRP is great to protect people who have had their phone stolen but those that get thrown in the garbage are turned into a threat to the environment and there are cell phones galor that come out of garbage cans and dumsters daily here in Vancouver BC .\nThe FRP prevents them from being sustainable and turns them into trash. I refuse to polute the planet because I care. \nPeople who discard perfectly good phones into the garbage dont care or they would recycle them instead.\nI am a ~warrior of the rainbow~ from the Cherokee Nation and would like Google to provide a solution to your FRP on these phones.\nRefusing to do so negates your own sustainability policy.\nGoogle is not to blame for the phone being thrown in the garbage but you are responsable for refusing to work with anyone other than the original owner who is breaking the law by throwing it in the garbage instead of recycling it or passing it on to the less fortunate. One month i found 17 working cellphones that i gave away.\nI currently have 4 phones with FRP locks on them. A Google Pixel 2, Samsung S7 Edge, Blackberry (network locked and the network wont unlock it because I am not the original owner), A dual sim phone from France that is simcard slot locked. Same problem, i am not the original owner.\nThe original owners threw them in the garbage.\n We (warriors of the rainbow inservice to the environment) dumster divers need your help to resolve this issue. \nYour the only one who can. The orignal owners wont budge.\nIt is called selfishness and lack of compassion for those that cant even afford to buy a used phone.\n\nPeace on Earth Google and my brothers and sisters that are throwing reusable items in the garbage and get furious when we do the recycling for them.\n\nYours truly,\nWalton James Firth et al´",
    "is_img": 0,
    "category": "Other, Google Pixel 2",
    "post_time": "2019-05-30T21:00:27.675993+00:00",
    "reply": "1 Reply"
}