{
    "url": "https://support.google.com/pixelphone/thread/21257224/pixel-2-death-battery-malfunction-can-not-turn-on?hl=en",
    "title": "Pixel 2 Death - Battery Malfunction? (Can not turn on)",
    "content": "The thing is, it is not my first phone having some sort of weird stuff of that kind.\nMy previous Nexus 5X from Google went on an endless boot loop too... but from a different cause probably...\n\nAnyway, I was using my Pixel 2 normally, It was charged to around 40-48% I went away for a sec, came back and out of nowhere my phone just died. The battery probably completely drained.\nMust mention, my battery was operating perfectly all of the time before, so while it was strange, I thought I'll just come home and charge it regularly...\nI considered this as a pretty weird anomaly since usually when the battery goes to 0% there is usually some red light that toggles to show that the battery is dead when PWR Button is pressed.\nNothing like that this time.\n\nOnce I plugged in my Pixel 2, it started charging and turned again for the last time to show it had 47% that switched to 0 % that immediately turned off the phone. Since then the phone was showing that it is charging the battery, turning on and to maybe show `Google` (from Android 10 dark theme) or something that looks like a loading bar and immediately fading out and showing that the battery was dead.\n\nDetails (details that came to my attention that might be helpful to resolve or better understand the problem)\nNothing turns on to show that the battery is dead (the Red LED in the bottom doesn't turn on, neither the one on the right top corner of the phone) When unplugged at least.\nCharging Pixel 2 using USB - Type C that connects to PC made the red led in the top right corner of the phone flash. Nothing became functional though.\nWhen plugged, the screen shows it is charging and tries to automatically boot up the system.\nOnce it tries displaying Google or some loading bar instead, everything on the screen immediately fades away slowly. (image seems to be stuck and brightness fading down shortly)\nThen the top right LED flashes once completing that cycle and starting right from the beginning where it showed that the phone is charging.\nWhen attempting to turn on sometimes it shows something that reminds me of a very thin loading bar or sometimes it shows \"Google\" before fading out.\nI was almost sure it had charge before suddenly showing 0%\nI tried letting it charge for some long time already without any new result\nI have/had Android 10 on my Pixel 2 ( I updated from Android 10 Beta to Android 10) - I don't think it is related to the problem but I am trying to mention every little detail\nThe decorative glass in the top back of the phone cover is slightly cracked - it was in the same condition for a long time and kept working.\nThe phone was wet several hours before the incident - but Pixel 2 has some waterproofing.\nit wasn't submerged but just had some little splashes on it for a short time. - once again it is not the first time it was wet with the cracked back cover glass.\nI loved my Pixel 2 very much and it was perfect all of the time, keeping it in the almost best condition possible - software-wise and planned on repairing the back cover glass on the screen myself since it seems like nobody is repairing Pixel phones in the place I live in\n\nWhat I suspect:\nSince it doesn't have any response at all when unplugged: might be some unique malfunction with the battery?\nLower probability but I'd still mention that it had Android 10 - after all my previous Google phone Nexus 5X died from a software update...\nGoing from 48 or 47 % to 0% seems to be like a symptom of the phone having water in the wrong places maybe. In that case, replacing the battery is still a good idea right?\nI am completely lost\nMy Pixel 2 is yet in some sort of coma. It could just wake up randomly, say hello and then going back into that phone coma breaking my heart once again.\n\nI am planning on buying a new battery and trying to replace it. I don't have any special tools for heating up the adhesive layer so I'd probably use just a hairdryer for that.\nOther tools are usually coming in battery replacements kits with the battery.\nHopefully, that surgical procedure will fix it up...\nThere is still risk that it won't and I'll just waste more time and money while trying to revive the dead.\nI don't know if it is a good idea yet so please let me know.\n\nSo now I finally came here to write a thread and ask for help. (When I ran out of any other options)\nIf any of you came across something like this and were able to fix that please help.\nI will try on checking up as much as possible on this thread.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-11-27T00:18:12.187553+00:00",
    "reply": "6 Replies"
}