{
    "url": "https://support.google.com/pixelphone/thread/33359808/original-usb-c-to-usb-c-chargers-not-working-but-usb-a-to-usb-c-works?hl=en",
    "title": "Original USB-C to USB-C chargers not working, but USB-A to USB-C works?",
    "content": "This is going to be long.\nThree nights ago I plugged in my Pixel 2 while it was on with the 3-foot USB-C/USB-C charger from Google.  The morning after, I woke to find the phone, its buttons, and the screen completely unreponsive (including power+down button). I cleaned all my cables and ports thoroughly, and still nothing.   I looked for on this support forum and Reddit for answers and left my phone to charge between the 3-foot charger and the phone's original charger for around 30 minutes, with the red LED light flashing the entire time.\n\nAfter 30 minutes, I pressed power+down button and was finally able the bootloader menu to appear and selected start. After this, the phone restarts or turns off immediately upon plugging in the 3' charger. Then, I plugged in the original phone charger but this only charges the phone for 30 seconds to 1 minute before the charging stops completely.  I tried both USB-C to USB-C chargers with several electrical outlets with the same results. The only way the phone keeps charging is with an old Google USB-C to USB-A connected to my PC. \n\nI called Google support and was told to re-try everything I've already tried before, the last part resulted in the phone restarting during the call because I plugged the 3' charger.  I was never contacted again from Google support despite assurances that I would be within an hour and despite having given the tech a second phone number to call.\n\nI tried a factory reset yesterday and nothing's changed.  I tried using the phone's original USB-C/USB-C cable with an old LG Nexus 5X wall charger and was able to keep a charge so far, like with the USB-C/USB-A port on my PC.  I keep an old Anker USB-C/USB-C cable (Nexus 5X approved) with a portable battery on my car to charge the phone with sometimes, and this also works to keep a charge.  \nIt seems like this is only an issue with the new Google cables/chargers or my USB port is going bad.  \n\nAny help would be great. Thank you.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2020-03-13T06:23:33.728328+00:00",
    "reply": "1 Reply"
}