{
    "url": "https://support.google.com/pixelphone/thread/87395744/bringing-the-best-of-google-to-more-pixels?hl=en",
    "title": "Bringing the best of Google to more Pixels",
    "content": "One of the best parts of the Pixel is regular feature drops that make the phone better and better (and better). With the December update even more Pixel users will get to experience our most recent launches, along with a few new surprises. The features will begin rolling out to Pixel devices starting on December 7th, continuing in stages over the next two weeks*[1].  Update to the latest Android version and update your Android apps to receive the latest features. Once updated, look out for a notification from the Tips app to learn more about all of the ways your Pixel just got better. \n\nLet Google Assistant wait on hold for you.\nHold for Me is now available as an early preview on your Pixel 3 or later. If you’re put on hold, Google Assistant waits on the line and lets you know when someone’s ready to talk to you*[2]. So you can spend more time doing what’s important to you, and less time listening to hold music.\n\nSave your Pixel’s battery when it counts.\nExtreme Battery Saver is now available on Pixel 3 and later. When the feature is turned on, your Pixel automatically limits active apps to run the essentials so your battery lasts as long as possible. It’s great when you need to keep your Pixel going before you can charge again. \n\nBe there, without being there.\nNow you can get closer to the people you love with group screen sharing in Duo video calls*[3]. Everyone on the call can watch the same video, cheer on live sports together, and plan activities – even when you’re far apart. \n\nGreat audio, in any environment.\nYour Pixel can automatically adjust the speaker’s sound equalizer settings based on your environment, so your music sounds great no matter where you are*[4][5].\n\nSwitch between 5G and 4G automatically.\nYour Pixel can help save battery life by switching between 5G and 4G based on the app you’re using. It’ll choose 4G for things like browsing the web or sending texts, and switch to 5G when you’re watching movies or downloading large files*[5][9].\n\nHelp preserve long term battery health\nAdaptive Charging helps preserve battery health over time by dynamically controlling how quickly a Pixel device charges. Just plug in your phone in the evening, set an alarm, and the Adaptive Charging will work its magic.\n\nBe on the right side of the street.\nYour Pixel’s GPS is now more accurate when you’re on foot*[5][6]. Your rideshare service can find you more easily, and there’s no more guessing which side of the street you need to be on when you’re walking to your destination.\n\nTranslate screens on your Pixel. \nYour Pixel can now detect if you’re viewing a website or app in a different language and translate it using Google Lens*[7]. Just take a screenshot or swipe into App Overview and tap the Lens chip to see the translation. \n\nMake a playlist from your Now Playing history.\nNow you can make a playlist from the songs you heard while driving or watching TV. Just check your Now Playing history, then export your selected songs into a new YouTube Music playlist. \n\nHome screen, sweet home screen.\nMake your home screen even more personalized with new icons, colors, app shapes, and grid views. You can also customize your wallpapers. \n\nYou can now customize your home screen with new wallpapers from Disney’s The Mandalorian*[8], as well as famous artworks from museums. Save them as your wallpaper, and learn more about the art and artists. \n\n\nSummary of Availability per Device (Table)\n----------------------------------------------------------------\nDisclaimers\n*[1] Your Pixel phone will receive feature drops during the applicable Android update and support periods for the phone. See g.co/pixel/updates for details.\n*[2] US only. English only. Toll-free numbers only. May not detect every hold scenario.\n*[3] Requires Wi-Fi or 5G internet connection. Not available on all apps and content. Data rates may apply. 5G service, speed and performance depend on many factors including, but not limited to, carrier network capabilities, device configuration and capabilities, network traffic, location, signal strength, and signal obstruction.\n*[4] Not available for all apps or content.  \n*[5] Available only on Pixel 5 and Pixel 4a (5G).\n*[6] Not available in all countries or locations. Requires internet connection and phone running Android 8.0 or later. Available while walking only.\n*[7] For available Google Lens languages go to g.co/help/lens. Some Lens features require an internet connection.\n*[8] STAR WARS © & ™ Lucasfilm Ltd. All rights reserved. Used under authorization.\n*[9] Not available on all carriers or for all apps or features.",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-12-07T18:15:04.47772+00:00",
    "reply": "0 Replies"
}