{
    "url": "https://support.google.com/pixelphone/thread/1318933/and-i-do-plan-to-sue-for-monetary-compensation-because-this-is-a-basic-right-of-owning-a-google-phon?hl=en",
    "title": "and I do plan to sue for monetary compensation because this is a basic right of owning a Google phon",
    "content": "I can send and receive text messages with both Wi-Fi and cellular data turned off (native \"messages\" app for Google Android Pie latest update). I cannot send or receive text messages when Wi-Fi is on and airplane mode is also on simultaneously. This could not be a more inconvenient setup for me. When I don't want to receive text messages or phone calls I have always turned off cellular data and Wi-Fi, but now I can receive these messages when I have nothing turned on. In addition I often leave airplane mode on and just use Wi-Fi so everything else is not using battery, but now I can't receive text messages or send them when airplane mode is on as well as Wi-Fi, this happened all of a sudden after the last Pie update or thereabouts. Every other app including my other texting apps work with airplane mode and Wi-Fi turned on. The only app that is having an issue is Google's native Messages app. \n\nThis humongous bug has cost me tremendously financially because I've missed important business-related phone calls and I do plan to sue for monetary damages. I want compensation. Being able to receive text messages with Wi-Fi on is a basic right of buying an expensive phone and paying for service and this is a Google related issue as well as Verizon, you are both culpable.\n\nThis BUG also means that the network is connecting to my phone and using MY battery when I don't want it to EVEN WHEN I have turned the cellular data and WiFi off❕ I have definitely noticed that my battery has been draining significantly faster since I have been able to receive and send text messages with my cellular data and WiFi turned off❕",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-01-28T00:10:24.03697+00:00",
    "reply": "2 Replies"
}