{
    "url": "https://support.google.com/pixelphone/thread/53324563/in-canada-we-have-manual-call-screening-on-the-pixel-3-xl-but-not-automatic-why?hl=en",
    "title": "In Canada we have manual call screening on the Pixel 3 XL, but not automatic. Why?",
    "content": "How does a Canadian subscriber to carrier Telus Mobility activate ...\n\nAUTOMATIC CALL SCREENING, and \nEmergency 911 automated automobile crash detection and automated dialing to 911 with conveyance of GPS spatial coordinates.\n\nGoogle is doing some very remarkable things and not with the intention of making money.\n\nSo I have no objection to Google and their surveillance device on me as long as these features are available to me.  I'm very fond of their Pixel lineup of phones even though it would be great if they had a stylus.  If they did Samsung could go peel potatoes with its Notes.\n\nI have to really bow in respect for what Google is doing now and I now have a very favorable opinion of them.  I thought their location tracking was an invasion of privacy and you know what? ... it worked to my advantage when some creep doctor denied that I was at his office on a certain day at a certain time and I shoved the phone in his face.\n\nBut what's killing me is that these new safety services are not available to me and my question is why and if there is a hack, a hack that Google will not object to.\n\nOther questions\n\nWho changed Voice 2 of the Google Assistant?\nWe have manual call screening in Canada and suddenly Voice 2 changes to one that is less pleasant.  Put the original back per favor.\n\nWhy is Wi-Fi necessary to activate Google Call Screen after a power off situation resulting from Battery to 0?\n\nThis cannot be a regulatory issue with automatic not available in this frozen Arctic tundra because we had a very similar feature called Who's Calling on wireline TWENTY YEARS AGO.\n\nIt was developed by Nortel on their Digital Multiplex System 100.\n\nIt intercepted all calls from unknown and private callers and asked them to state their names.\n\nDMS would proxy the call to the end subscriber and offer him disposition options.\n\nIt later changed.  If you were calling private you had to press a key on a Digitone telephone to release the number ... the number is always transmitted regardless of whether the call is private or not ... there is simply a privacy indicator that is turned on or off.\n\nOn the unknown you would have to actually key in your number using a touch-tone set and then DMS would relay that number to the subscriber telephone with a greater than sign  on the name line to indicate that the call might be spoofed.\n\nSo then we called that person back at that number to verify that that was accurately entered as the true number.\n\nThere are databases out there that know which telephone numbers are wireless and which ones are wireline even after they've been ported and it would be nice if we got a call and we knew.  I don't want to send a text message to a wireline device if you know what I mean.\n\nAnd one last suggestion ... why not include an integrated barcode scanner in the Google keyboard ... that would be so nice.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3 XL",
    "post_time": "2020-06-14T03:10:42.208013+00:00",
    "reply": "5 Replies"
}