{
    "url": "https://support.google.com/pixelphone/thread/86280022/i-sent-my-pixel-3a-to-googles-official-repair-service-and-now-it-seems-to-be-lost-what-should-i-do?hl=en",
    "title": "I sent my Pixel 3A to Googles official repair service and now it seems to be lost? What should I do?",
    "content": "My Name is Martin Ku and I have a Google Pixel 3A (smartphone) which I bought from Google's Webstore (Germany). My screen got broken and I went through Google's official repair service to have it repaired. I got a package sent to me from Google in which I then sent my smartphone to Poland, according to instructions. The repair procedure should take a maximum of between 11-14 days. \n\nNow after 1 month is still haven't got my phone back. The phone got repaired and should have been sent back to me according to Google. I haven't gotten any notification there is also no tracking number from UPS/DHL, and now the smartphone seems to be lost or sent back to the repair service. \n\nI have tried to contact Google several times and they don't answer my messages and every time I get to contact someone over the phone I need to explain the whole situation and I just get the note that they are trying to \"investigate\" what has happened with the phone and delivery and I just have to patient and wait. Google claims that something got wrong with the delivery on its way my home, but my address and everything was correctly written and I have never had trouble before getting anything delivered to my door. (also germany)\n\nGoogle refuses to give me any compensation, a temporary phone which I can use and they claim that I also have to pay for the reparation (150Euro) since the phone is \"correctly\" repaired. One month without a smartphone is a long time, when it should have taken maximum 11-14 days, and I have to spend lots of time trying to contact them without getting any clear answers of when I can get my phone back. I even tried to talk to the responsible for the repair service team without any success as they refuse to give away any further contacts. \n\nThe guy on the customer service tried to make it look like I was the one who wrote wrong address since it said: \"Waldemarstrasse\" instead of \"Waldemarstraße\" (??) . And then he was also asking me why I had a \"C/O\" address and that could be the reason why it never arrived. My question is that why didn't I even get a notification from UPS/DHL that the package was on it's way? There was simply no tracking number because something went wrong with the whole delivery.\n\nI could have gotten my phone repaired in berlin where  I live in one day, but I chose to go through googles repair service as I wanted to have my phone correctly repaired. I'm extremly disappointed of how Google has been treating their customers.\n\nMy question is: What should I do? Should I just wait for my phone since the customer service say he hopes that it's not gonna take \"another\" month to have it fixed. One month without a functioning phone is irritating and I haven't done anything incorrectly. :/\n\nI hope to get some advice from you guys!\n\n/Martin",
    "is_img": 0,
    "category": "Other, Google Pixel 3a",
    "post_time": "2020-12-01T13:36:36.951395+00:00",
    "reply": "0 Replies"
}