{
    "url": "https://support.google.com/pixelphone/thread/2186222/pixel-xl-won-t-turn-on-vibrates-the-second-phone-in-two-weeks-to-have-this-issue?hl=en",
    "title": "Pixel XL won't turn on, vibrates. The second phone in two weeks to have this issue.",
    "content": "About two weeks ago, my Google Pixel XL died during a routine file transfer, and would not turn back on. I had purchased the phone used from a \"Google Certified Refurbished\" reseller (Adopt-A-Phone, specifically). The phone would not turn on and would not let me boot into recovery mode by holding down the power and volume buttons. I went through the entire help screen to no success. As this was past the 60 day warranty Adopt-A-Phone gives, I was very upset. \n\nI needed a phone and couldn't really wait for a repair, so I overnight shipped a new (used) Google Pixel XL. It updated all of my apps, and everything was working great. I plugged it in to my Windows 10 computer last night and began to transfer my MP3 library over (I live in a dead zone, so when I'm outside I like to listen to my music uninterrupted). It was taking a while, so I left it, came back a few hours later to find the phone stone dead and would not turn back on. \n\n(For those of you keeping track, that's two dead phones in two weeks.)\n\nI followed the steps in the troubleshooting FAQ several times now. The phone will vibrate if I hold down the power button and volume buttons for 30 seconds, but that's all that either phone will do now. I contacted Google support but I was basically just read the FAQ again, line for line. I used their \"call feature,\" and was greeted with a \"Congratulations! A Google technician has responded to your call\" sort of message before being put on a dead, static-y line for over three minutes before it hung up on me.\n\nBoth phones are past Google's warranty period, so now I am probably going to have to ship these out to get fixed (well, one of them --- the other one I'm just going to return to the reseller).\n\nI have to say... I'm not impressed with the Pixel XL. The only reason I had to risk such large file transfers to begin with is because there's some insane stigma against putting Micro SD card slots in phones, and even failing that it is missing almost all of the features that made my previous phone (an HTC One Max) great (namely a built-in IR blaster, two front-facing stereo speakers, and a Micro SD card slot). Sure, it's faster, can run a better version of Android, and has a much better camera, but my broken, shattered HTC Once Max still works, and I've had that for almost four years running now.\n\nIf anyone has any suggestions on how to fix these phones, please let me know. As for Google: You guys suck.",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2019-03-09T13:35:00.343042+00:00",
    "reply": "3 Replies"
}