{
    "url": "https://support.google.com/pixelphone/thread/94202836/horrendous-customer-service?hl=en",
    "title": "Horrendous customer service",
    "content": "Just wanted to share my story with you guys. I bought a Pixel 4a off of Amazon back in October. The phone worked for one day until I installed an update overnight, and woke up to the phone being bricked. I contacted google customer support and it took about 2 weeks to get me my replacement. I was okay with it I'm just glad I got the replacement. However after sending in my whole original box with original charger, and the manual they just sent me the replacement phone. It was okay I had other charger. However they sent it to me and the edges of the screen were unresponsive. I just lived with it until it got so bad that it was affecting day to day usage. The customer service team said they normally don't process refunds unless you buy the phone through them. But I explained how I couldn't get a refund through Amazon because they had my original box with all the original accessories. So they made an exception for me, and I was super grateful for that but it was taking forever and they kept contacting me through email and even if I responded to there email (asking for IMEI, proof of purchase, and If I authorize this transaction, all of which came inseperate emails over a weeks course of time). The phone got to the point where the touchscreen was totally unresponsive so I had to buy a new phone and decided to get a nice one since they agreed on a refund. It's been 2 weeks at this point. And I've been calling them for updates 1-2 times a week. The day after my new phone came in they said the refund was finally approved and to wait a couple days for a follow up email. At this point it's been a week since I got this email so I decided to call back and this \"specialist\" said that they can't process a refund.. At this point I'm like wtf and explained the previous conversations I've had and he pretty much told me that if I want a refund I need to wait through their process and couldn't give me a date or anything on when I would get the shipping label and pretty much said it could be over a month. So now at this point I'm stuck getting, another replacent phone and not getting a refund on their phone that I spent almost 400 dollars on and have been wasting 3 weeks trying to get a refund processed. And after I asked to be put in touch with their customer service survey she just hung up on me",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a",
    "post_time": "2021-01-19T18:24:34.333184+00:00",
    "reply": "0 Replies"
}