{
    "url": "https://support.google.com/pixelphone/thread/32828289/bluetooth-keeps-stopping-message?hl=en",
    "title": "\"Bluetooth keeps stopping\" message",
    "content": "I recently purchased a Pixel 3 XL and after a few months of good usage I began having a \"Bluetooth keeps stopping\" message. Thinking it was just something introduced by some app I had downloaded, or file that I had put on my phone I factory reset my phone. Then I factory flashed my phone to the most recent factory image. Then I flashed my phone to the very first factory image that was available for the the Pixel 3 XL, the September 2018 image. The error continues to come back. I can't believe this is a hardware problem, it can be temporarily solved by restarting the phone, and it is completely random, sometimes happening constantly every 5 seconds, and sometimes not happening for days at a time. I don't believe it's a loose connection in the phone, it wouldn't be fixed by restarts and it wouldn't be so frustratingly random. I've been reading forum post after forum post of people with this problem. I've only searched specifically for people with Pixel 3's but it seems to be happening with other Pixels and maybe even with with phones from other manufacturers as well.\n\nThis issue is causing people's otherwise perfectly functional phones to be useless. When the bluetooth keeps stopping it also takes the wifi and mobile network down with it. I've missed important text messages and phone calls.\n\nGoogle won't warranty my phone because it's past the warranty period, even though I called them previously seeking help about this error before my warranty had expired.\n\nSomeone please look into this and figure it out. It seems to me that it the error was introduced after an Android update, personally I think the Android 10 update caused it, as that seems to coincide with when it started happening to me and when many other people are saying it started happening. Some reports of the error do contradict this though, saying it happened before that. All of these links are about the error from a cursory 5 minute google search. I imagine searching for much longer you could find so many more.\n\nhttps://forum.xda-developers.com/pixel-3-xl/help/constant-bluetooth-stopping-t4035007\nhttps://support.google.com/pixelphone/thread/21889103?hl=en\nhttps://support.google.com/pixelphone/thread/1886970?hl=en\nhttps://support.google.com/pixelphone/thread/2013979?hl=en\nhttps://www.reddit.com/r/GooglePixel/comments/dbkn5r/bluetooth_keeps_stopping/\nhttps://www.reddit.com/r/GooglePixel/comments/dh0fsm/wifi_bluetooth_keeps_stopping_on_pixel_3_xl/\nhttps://www.reddit.com/r/GooglePixel/comments/bifu3h/google_pixel_3_xl_bluetooth_crash_disabled_wifi/\nhttps://www.reddit.com/r/GooglePixel/comments/dj1cck/why_does_google_refuse_to_fix_bluetooth_keeps/\nhttps://forum.xda-developers.com/pixel-3-xl/help/bluetooth-stopping-t4003431\nhttps://forum.xda-developers.com/pixel/help/bluetooth-stopping-factory-reset-t3926052\nhttps://forum.xda-developers.com/pixel-3-xl/help/factory-reset-losing-internal-storage-t3937651\n\nSomeone at Google needs to step up and make sure this gets fixed. This is ridiculous. It's either a Pixel problem, or an Android problem (which Google basically controls as well), either way people's $1000 flagship phones are paperweights once this problem starts happening to them.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2020-03-09T02:29:38.614937+00:00",
    "reply": "1 Recommended Answer"
}