{
    "url": "https://support.google.com/pixelphone/thread/98634795/pixel-4xl-sudden-vibrations-and-ghost-touch-input?hl=en",
    "title": "Pixel 4XL - Sudden vibrations and ghost touch input",
    "content": "Roughly 2-3 weeks back my Pixel 4XL suddenly started vibrating at random moments several times in a row, almost like multiple message notifications (but no new messages do arrive) or like its having a seizure.\n\nThe phone either calms down after a while or stops (sometimes only intermediatly) when locking the screen. A reboot of the screen also stops the behavior.\nAdditionally to the vibrations it is like a \"ghost user\" is touching on the screen, i.e. some input is registered at the same time an individual vibration is happening. This mostly results in the behavior of the slide down gesture that is done to refresh pages/apps.\n\nI also cannot correlate neither the start of the phenomena nor its repetitions to anything in particular. I did neither drop my phone nor did I install a new app or changed any phone settings or installed an android update. Although the latter might have happened in the background without me noticing. The same goes for app updates.\n\nWhat I've done so far:\ndeinstalled a multitude of apps\ncleared the cache of other apps\ndisabled Haptic Feedback, Motion Sense and Active Edge in the phone settings\n\nWhat I would like to avoid:\nReset the phone to factory presets because it's always a hassle to bring it up to a working state again\nSending the phone in for repair because i don't think that it's an hardware issue that is causing that behavior\n\nSo did anybody observe something similar recently? Or does have a clue on how to get rid of it?\n(Or even just can point me to the place where I can look into something like an Android Event Log?)\n\nThanks in advance for your help!\n\nPS: And yes, I'm aware that it might be a virus or something. But I'm pretty sure that I'm well set up with my ESET Internet Securiy for Android.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2021-02-18T08:57:18.106316+00:00",
    "reply": "2 Replies"
}