{
    "url": "https://support.google.com/pixelphone/thread/32114021/issues-with-getting-a-functional-replacement-pixel-under-warranty?hl=en",
    "title": "Issues with getting a functional replacement Pixel under warranty",
    "content": "Initially the situation began with my Pixel 3XL suddenly shutting itself off at any battery percent, whether in use or not, and whether plugged in or not. This device was determined by Google support to be eligible for replacement under the Google warranty. This was all good, labels were emailed to me essentially overnight and I sent off the device around the 6th of January and eagerly awaited the replacement (my phone was purchased through Verizon instead of the Google store,  so I must send my device in before a replacement is sent, which is understandable). Finally the replacement arrived and alas, it was a refurbished model. I use the word refurbished lightly. WiFi and Bluetooth didn't work, the \"Bluetooth keeps crashing\" message would fill the screen shortly after booting up, and cellular wouldn't activate, which I later found out was because the device was reported to Verizon as stolen, which actually shut down my line. At this point the replacement was essentially unusable, so attempting any fix I could think of, I swapped the sim back to my older device and reactivated my line I contacted support once more on Jan 17th  and was informed yet again my device was eligible for replacement. This time, however, the case was shortly \"passed to the specialist\" where I waited and received a few cookie cutter \"Thanks for your patience\" emails, each one from a different support team member...\n\nOn February 3rd I was informed the case was passed to a \"risk review team\" and that was the last I heard from support. At this point I had stopped receiving the \"update\" emails and any inquiry for an update I sent was met with silence. As I approach two months of waiting this out, I have to ask if anyone else has experienced similar events? Is there anything I can do about this, aside from waiting further and hoping one day I can get a replacement. Hopefully an at least a properly refurbished, if not new device? I love the Pixel, but if this is standard Google customer service I may have to jump ship to something more reliable, or at least better supported. If I didn't happen to have an older 1st Gen Pixel laying around I would be truly screwed. I truly appreciate anyone who took the time to read this and hopefully can offer their advice on this situation. Thank you!",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2020-03-03T01:55:26.788229+00:00",
    "reply": "0 Replies"
}