{
    "url": "https://support.google.com/pixelphone/thread/87004909/what-is-the-excuse-for-tricking-your-trusting-customers-out-of-an-sd-card-storage-for-the-pixel-4xl?hl=en",
    "title": "What is the excuse for tricking your trusting customers out of an SD card storage for the Pixel 4XL?",
    "content": "Imagine this..\n\nImagine if Tesla came out with a brand new Tesla Electric car, promoted about it with huge promotions and lowers the price because some global pandemic comes out or something, but doesn't bother to tell anyone that they've taken out the stereo system. No CD player that's old-school. No auxiliary chord or radio - \"omg\". Yeah, no, instead of conventionally enjoyed and modernly accepted features which much of everyone had organized their life around - they've decided to instead have built in cloud streaming through their hypothetical test list cloud streaming service where you can upload your music in order to listen to it with the 60 gb storage space - plenty of room for all of the music that you'll ever need, ever, ever, ever. \n\nHey if it's not enough you can always just take off other things that you've stored there in order to make room. Naturally you will have to upload everything to the cloud service that is hypothetical by Tesla - tediously.\n\nNah, that's completely ridiculous. Elon Musk would never do such a thing because that would be a d*ck move. Obviously.\n\nWhoever led the project on the pixel 4 and 4XL - I'd like you to go and get the person who had argued \"Hey, maybe removing the SD card capability completely from our product without properly telling people is kinda a d*ck move and maybe we shouldn't do that.\" - and now everyone who was on the project who didn't agree with them and were in fact causal to the excuses being allowed towards the design taking out that capability - all of you go give that first person who spoke up and wasn't listen to and take all of the money you were paid during and after the design and roll-out of the Google pixel 4XL - And give all that money to that person.\n\nBecause everyone else failed horribly. This device is stupid. And no your hidden statement of the fact was not at all close to acceptable and I'm sure it's in some way illegal.",
    "is_img": 0,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-12-05T15:53:32.273407+00:00",
    "reply": "1 Recommended Answer"
}