{
    "url": "https://support.google.com/pixelphone/thread/50569414/new-pixel-features-to-help-you?hl=en",
    "title": "New Pixel features to help you",
    "content": "In June, we’re dropping new features for Pixel, including updates that focus on providing more support to stay safe, extend your battery life,  and help you disconnect more easily at night. The features will begin rolling out to Pixel devices starting on June 1st and will roll out in stages over the next two weeks.  Update to the latest Android version and update your Android apps to receive the latest features. Once updated, look out for a notification from the Tips app to learn more about all of the ways your Pixel just got better. \n\n\nYour Pixel can help keep you safe\nPixel helps you stay safer with the following new features available through the Personal Safety app.\n\nEmergency sharing with real-time location\nWhen you initiate an emergency share from the Personal Safety app, all of your emergency contacts will now be updated with your real-time location.\n\nSafety check\nWith safety check, you can set up a time for your phone to confirm if you’re safe, for example after a run or hike alone. If you don’t respond, emergency sharing automatically starts.\n\nCrisis alerts\nGet notified about natural disasters and public emergencies affecting your area.\n\nPersonal Safety features for more Pixel phones\nThe Personal Safety app with the features above is now available on all Pixel devices with Pixel 3 now also supporting car crash detection*[1][2].\n\nYou can access these new features by tapping the “Safety” icon in your apps drawer. If you are on a Pixel 3a or earlier devices, you will first need to add the app in Settings.\n\nThis will roll out to all Pixel phones, globally. Learn how to get help in an emergency using your Pixel phone.\n\n\nBedtime made better\nYour Clock app can now help you maintain a consistent sleep schedule. Fall asleep to calming sounds and limit interruptions while you sleep — and if you stay up on your phone past bedtime, you'll get a snapshot of how much time you’re spending awake and on which apps. Each morning, you can wake up with your favorite track or with a gradually brighter screen with Sunrise Alarm.\n\nTo get started, update and open the Clock app, then tap the Bedtime tab.\n\nThis will rollout to Pixel 2, 3, 3a, and 4, globally. Learn more about Bedtime with your Clock app.\n\n\nImproved Adaptive Battery feature\nAdaptive Battery already learns your favorite apps and reduces power to the ones you rarely use.  Now, Adaptive Adaptive Battery on Pixel 2 and newer devices, can predict when your battery will run out and further reduce background activity to keep your Pixel powered longer. .To enable Adaptive Battery, go to Settings > Battery > Adaptive Battery, and turn on Adaptive Battery.\n\nThis will roll out to Pixel 2, 3, 3a, and 4, globally. Learn more about Adaptive Battery.\n\n\nRecorder is better together with the new Google Assistant and Google Docs\nYou can now start, save, and search recordings in the Recorder app using the new Google Assistant*[3]. Just ask “Hey Google, start recording my voice” to start recording on your phone, or “Hey Google, find my voice recording about lasagna” to find that recipe you’d recorded.\n\nAlso, saved transcripts can now be easily exported to Google Docs*[4]. Within the Recorder app, choose a recording, tap “Transcript” to show the transcript, then tap the three dots menu on the top-right corner, and tap “Save text to Google Docs.” \n\nThe new Google Assistant capabilities will roll out to Pixel 4 in English, and the Google Docs feature will be available to Pixel 2, 3, 3a, and 4, globally. Learn more about using the new Google Assistant with your Recorder app.\n\nSummary of Availability per Device:\n----------------------------------------------------------------\nDisclaimers\n*[1] Car crash detection may not detect all accidents. High-impact activities may trigger calls to emergency services. This feature is dependent upon network connectivity and other factors and may not be reliable for emergency communications or available in all areas. For country and language availability and more information see g.co/pixel/carcrashdetection.\n*[2] The Personal Safety app is also available for Pixel (2016), learn how to add it here.\n*[3] Transcription and search are available in English only. Use of the Recorder app with Google Assistant is not available in all countries and requires a Pixel 4. For more information, see g.co/pixel/recorder.\n*[4] Exporting transcripts to Google Docs requires a Google Account",
    "is_img": 1,
    "category": "Other, Google Pixel 4 XL",
    "post_time": "2020-06-01T17:07:12.882044+00:00",
    "reply": "0 Replies"
}