{
    "url": "https://support.google.com/pixelphone/thread/104466881/need-help-with-multiple-new-pixel-5-issues?hl=en",
    "title": "Need help with multiple new Pixel 5 issues",
    "content": "I just upgraded from the Pixel 2 to Pixel 5. Have MANY issues that I've well over 20 hours over the past week with carrier (verizon) and Google Pixel and Google One support with no resolution. I don't have multiple Google accounts - just one - been asked this several times. Here's the hot list of issues:\n1. Lost All Contacts: Screen on P2 went black 10 days ago - given that P2 is no longer supported decided to upgrade. Upon registering the new P5 and signing into Google account, only 13 of ~100+ contacts transferred. After many hours with support (Verizon) was told only way to get contacts would be off old phone but need screen to work. Got old P2 phone screen fixed (a very disturbing experience with Ubreakifix - will save that story for another day) and verified the contacts were still on that phone - phew! Three days later when I'm ready to spend a few more hours with Support again to get the contacts off the P2, suddenly they too are GONE! P2 Conta\ncts app now mirroring P5. Yes, I allowed the P2 to connect to home wifi. \n\n2. The P5 Contacts app will not recognize my Google account: open App, shows Zero contacts; select Account icon- says login to your google account; attempt to do so and App says \"this account already exists on this device'. Have removed and re-added account - still won't connect to download the 13 contacts still showing up under contacts.google.com. \nUsed a third party tool last night to try and recover data from P2, interesting the call history does show the contact name - again, phew! Regained about 3 years of call  history, this at least gives me names to match numbers, will just have to manually enter into new phone provided the Contacts feature will sync to Google.\n\n3. Lost 8 out of 20 Google Auth entries: Can still see all 20 on P2, but only 8 showing in Google account which came over with App backup/restore.\n\n4. Cannot find any information on what the Google Services/ 'On-Device Sharing' feature does: Where does Google hide their verbose description of exactly what their Apps and Services do? Googled -but not finding anything specific other than - 'allows multiple people to use same apps'. Trying to make security minded decisions, but the lack of info makes this extremely difficult. \n\nPlease let me know if you can help. Thank you!",
    "is_img": 0,
    "category": "Other, Google Pixel 5",
    "post_time": "2021-03-30T22:01:25.823993+00:00",
    "reply": "0 Replies"
}