{
    "url": "https://support.google.com/pixelphone/thread/20477794/google-pixel-2-non-xl-shuts-down-if-the-battery-is-under-70-under-80-if-i-enter-camera-app?hl=en",
    "title": "Google Pixel 2 (Non XL) Shuts down if the battery is under 70% / under 80% if I enter Camera App.",
    "content": "Hello. I've brought a Google Pixel 2 on the 27.07.2018 in Germany, so by the laws of the European Union the phone is still under the warranty.\nSince then I've moved to Slovenia - there is no official repair service or official Google Store.\nI have a receipt from the seller, but the problem now is that they simply don't exist anymore. I've tried to contact them over the mail, visit their site - it's offline since few weeks, no one picks up the phone..\n\nI've even tried the Facebook, and the story is the same, the page was removed. I am a long time Google user, I've owned Nexus 5 - Hammerhead, Nexus 5X Bullhead, Nexus 6 - Shamu, Nexus 6P Angler, and Pixel 1, Pixel 1 XL, Pixel 2 XL and lastly Pixel 2 - the one I have a problem with. I am hopping that the battery is faulty, it started to happen a few days ago, once the phone dropped under the 60% it would start to shutdown randomly, now it just shuts down once it's under 70% and if I open the camera once is under 80%. I've done a factory reset, updated the phone, updated the apps, my phone drops like 30% in less then 20mins without me using it.\n\nThe phone is in pristine condition, always in a Spigen case and with a screen protector, never damaged or in service. I'm still a student so paying 612€ for a phone a little more than a year ago and now needing to buy a new phone is a no go for me. I mean I've worked night job to be able to afford this phone. Now I am walking around with the powerbank so I am able to call someone if I'm in need or something happens to me. I'm a big Google fan, always was, worked my a** off to be able to afford the products as I love stock Android and the things that it offers.\n\nI am also in no position currently to afford a new phone. What can be done? I can sent the receipt, and pictures of the phone, or anything else you may need. I do have all of the original things, as well as the box. I'm getting desperate as everywhere I turn to help, there is no answer whatsoever.\n\nhttps://drive.google.com/open?id=10MNDbvBZngxx7G4z4-hQFki-JqgGsKMt… here is the video of the problem.\n\nI've as well installed accubattery to check my battery health (I don't know how accurate it is) It says that the battery is on 28% of the original capacity.\n\nI literally don't know what to do anymore.\n\nEdit I've just checked and it says 27% now.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-11-19T15:17:42.054789+00:00",
    "reply": "0 Replies"
}