{
    "url": "https://support.google.com/pixelphone/thread/92726975/inherent-problems-with-pixel-2-camera-phone-crashing?hl=en",
    "title": "Inherent problems with Pixel 2: camera, phone crashing",
    "content": "Numerous problems of similar nature, would appreciate if anyone has found solution to any, Google Email support has been of no help. \n\n1. Pixel 2 randomly switches off phone when:\n        a)  you open any app that uses camera (including Google's camera app) \n        b) sometimes when a call is coming - and then it doesn't show that missed call\n        c) even while it is charging!! And it shows the 0% discharged sign while it is charging and has a significant amount of battery left. \n        d) randomly at other times when using the phone, this is extremely annoying because the battery drains significantly when this happens (more on battery draining/battery life on number 4). This is also dangerous because if I'm travelling I need to have a reliable phone that won't randomly switch off while I'm trying to call or use the phone. In detail this happens even when on the home screen but also with apps namely like Ola. *disclaimer: not an ola app problem, since this happens with a lot of apps and even while an app isn't even being used.* \n\n2. Problems with Camera: \n         a) Camera randomly stops working, the video doesn't record - gaps in video, \n         b) photo disappears after being taken, \n         c) or the photo doesn't get taken, phone hangs on camera app and must be restarted. \n         d) Additionally, the time lapse feature randomly works and doesn't work: sometimes it is able to stay on for 30 minutes, but other times it switches off by itself after 10 seconds.                       Timelapse randomly automatically switches off. \n\n3. According to cnet (for lack of information regarding battery life given on google's official website), the battery life of the Pixel 2 is supposed to be 13 hours, however it is barely averaging 6-7 hours in a day, and that's with battery saver on. \n\n4. The phone has also randomly switched off and refused to turn on two times, wherein I had to force reset it by going to the BIOS screen; this happened completely randomly and has taken place twice already. \n\n5. When calling, or even if not, there are some weird sounds at a (high?) frequency that are emitted from the speakers, this isn't a huge problem but I don't understand why this is happening. \n\n6. While Pixel 2 is charging (using Google's original adaptor and usb a to c connector with usb a to c cable) the charging reduces!! If the battery is 11% before charging, after \"charging\" it becomes 10%; however when the same cable is plugged into a laptop, it charges albeit slowly - I'm guessing the connector shouldn't be used for charging?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2021-01-09T14:21:14.018417+00:00",
    "reply": "1 Reply"
}