{
    "url": "https://support.google.com/pixelphone/thread/17323898/phone-acted-funny-rebooted-now-works-but-not?hl=en",
    "title": "Phone acted funny, rebooted. Now works, but not...",
    "content": "Hi. Let me explain the title.\nI picked up my phone from a wireless charger* and took it out off the case* and then put it back into the case. The phone started acting like someone was spamming the power button. I thought I've miss align the case so I took it off but it did not help. Phone started rebooting and kept flashing the screen like someone was still spamming the PB. I've examined the PB and it wasn't pressed in.\n\nThe phone rebooted and now is in this weird and awkward state.\nThe wallpaper was change from my photo to a random live blur.\nThe home button on press doesn't bring up apps, if I'm in a app it does not bring me back to the home screen. It only plays the sound and vibrates the phone.\nThere is no 'recent apps' button.\nSwiping from the bottom doesn't work.\nSwiping from the top works only for the first level.\nHolding for ex. the WiFi button does not bring up the settings.\nPhone kept my 2 screens saved with the app icons and folders.\nI can get access to my files thru the apps so the memory is there.\nThe squeeze does do nothing.\nThere is no screenshot opt. under the PB.\nConnecting the phone via usb with a laptop. Laptop detects the phone. Phone makes a sound but nothing else so can'choose what kind of connection I wanna have.\n\nI've tried restarting and hard rebooting. It changes nothing.\nI'm thinking about factory reset, except like I mentioned, can't get in the settings.\n\n*1. I's not a original charger but it has been working for months with no issue.\n*2. I's a cheap silicone case that fit's the phone like a glove and never caused any issues. Been using it since couple days after the phone release.\n\nUPDATE 1.\nI've discovered that I can get drag up the 'google search widget' (or whatever you call that) and get to apps and settings this. I've backed up my phone and factory reset it.\nBefore that I had a one occasion of phantom PB presses when I looked funny at my phone.\nAfter the reset everything seams fine but I didn't do any deep testing.\nNow I have to find a good and free WiFi to get the backup onto the phone.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-10-21T08:15:55.879746+00:00",
    "reply": "4 Replies"
}