{
    "url": "https://support.google.com/pixelphone/thread/22560911/contacts-is-incorrectly-adding-a-number-to-a-contact-thereby-causing-problems?hl=en",
    "title": "Contacts is incorrectly adding a number to a contact, thereby causing problems",
    "content": "I have two contacts; let's call them Erica and Tom (not their real names).\n\nTom once sent me an email with Erica's number. Now, on the desktop, Contacts keeps suggesting that Erica's number is in fact Tom's even when I tell it to \"Dismiss\" the suggestion.\n\nFortunately, on the desktop, it's not a problem. My Contacts page continues to work correctly.\n\nBut.\n\nOn the Pixel 2, suddenly, it's a problem!\n\nOn Android (not on the desktop)…\nThe Contacts app on the Pixel keeps adding Erica's number to Tom's contact details, and Tom's number to Erica's details. If I view the details, there are the numbers. If I edit the details in order to remove the numbers, they aren't there, so I can't remove them!\nI can find both Erica and Tom by scrolling down the alphabetical list in the Contacts app.\nWhen I select Tom's details in the Contacts app, it shows him as having Erica's name (both forename and surname). When I edit his details, his name is actually correct.\nWhen I select Erica's details in the Contacts app, her name is displayed correctly.\nWhen I use the search bar to look for Tom, I don't find him at all.\nBut, when I use the search bar to look for Erica, I find both of Erica's and Tom's details merged together under Erica's name.\nIt goes further. In other apps, such as Google Messages or Signal, they show Tom as actually being Erica. You can imagine my confusion, and thankfully I realised this before sending the wrong person a message.\nI have tried force-stopping Contacts, clearing its storage completely, and reloading.\nI have tried Settings > Accounts > Google > Account sync > menu > Sync now.\nI have tried restarting the phone.\n\nNone of that helps.\n\nEdit: This only started to happen quite recently.\n\nWhat can I do to fix this bizarre, unhelpful and persistent problem, please?",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 2",
    "post_time": "2019-12-11T16:28:32.447421+00:00",
    "reply": "1 Recommended Answer"
}