{
    "url": "https://support.google.com/pixelphone/thread/26300734/how-to-manage-notification-sounds-on-an-app-by-app-basis-e-x-block-all-sounds-except-spotify?hl=en",
    "title": "How to manage notification sounds on an App by App basis? (e.x. block all sounds except Spotify)",
    "content": "General problem: \nI want to block all notification sounds from ALL APPS EXCEPT for the \"business-related\" ones. Do not Disturb does not allow me to do this. I have to choose between all  sounds or no sounds.  \nWhat I'd like is a white-list.  Is there an app to do this (or an Android way to do it)?\n\nIt used to work on Android 8.1 and earlier: \nAndroid 8.1 and earlier had a feature that went along with \"Do not Disturb\" called \"priority only allows\" and it is described in the \"Do not disturb\" help pages.  This allowed you to allow apps through the do not disturb sound barrier. However I am on a newer version of Android and I can no longer use this feature. \nThis was a whitelisting feature I would like on the latest version of Android. \n\nit's been a few years and I am fed up with having to choose between being distracted all day and missing important messages and phone calls. \n\nSpecific problems: \n1. Do not disturb blocks my Google Play music songs.. I can choose to \"allow media sounds\" but I have to choose between allowing ALL sounds and NO sounds at all. \nI would like my music to play but I would not like web-pages with popup videos I am viewing to blare out at max volume in a quiet office. \nDo not Disturb in its modern form blocks either \"all messaging app notifications\" or \"no messaging app notifications.\" \nWhat if I want to receive notifications for the (text) \"messages\" app but not facebook messenger and whatsapp?\n(Messages is for business, whatsapp is for family and friends). \nI am aware that you can manage sounds for notifications in the App settings, but I have 141 apps on my phone (and am deleting a bunch now so that I don't have to manage their sounds). I cannot go through each one and disable notification sounds one by one and modify them, especially because each app has a different notification options menu. \nCan the default for all new apps be changed to \"no notification sounds!!??\" - How? \n Is there any way to manage a whitelist instead of a blacklist?",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 3",
    "post_time": "2020-01-21T16:20:43.256151+00:00",
    "reply": "2 Replies"
}