{
    "url": "https://support.google.com/pixelphone/thread/14182818/whatsapp-creates-duplicates-in-phone-app?hl=en",
    "title": "WhatsApp creates duplicates in Phone app",
    "content": "Pixel 2 XL with stock Android.\n\nWhatsApp causes in Phone app a duplication problem for contacts with a mobile number stored with spaces.\nPlease note that the problem is:\n\n- only in the Phone app and NOT in Contacts app\n- only for mobile phone numbers\n- only for numbers stored with spaces between groups of digits\n- only if WhatsApp is installed and contacts sync is enabled\n\nPlease also note that Contacts app is automatically adding spaces between groups of digits when creating a new entry.\n\nSo, if in Contacts app I create a new entry named JOHN DOE with a mobile number as follows\n\n+39 xxx yyy zzz (with spaces)\n\nand I give time for WhatsApp sync to kick in, it will show up once when running a search in Contacts app, like follows\n\nJohn Doe\nMobile +39 xxx yyy zzz (with spaces)\n\nbut twice when running a search in Phone app, like follows\n\nJohn Doe\nMobile +39 xxx yyy zzz (with spaces)\n\nJohn Doe\nMobile +39xxxyyyzzz (without spaces)\n\nThe first search result (with spaces) is from Contacts app, the second search result (without spaces) is from WhatsApp: it's as though Contacts app can do properly the merge but Phone app cannot.\n\nIf I edit the John Doe contact entry so that the mobile number has no spaces, so from\n\n+39 xxx yyy zzz (with spaces)\n\nto\n\n+39xxxyyyzzz (without spaces)\n\nthe duplicated search result in Phone app disappear.\n\nThe following recording\nhttps://drive.google.com/file/d/1psydzk44ifNe2gXwAJ0ofAYrbMbYO2hI/view?usp=drivesdk\n\nshows how a contact stored as\n\n+39 xxx yyy zzz (with spaces)\n\ncreates two search results from Phone app (one with spaces and one without spaces) while in Contacts app I still get only one search result.\n\nThe following recording\nhttps://drive.google.com/file/d/1HtuAlE3DzhqL6dv81UXRTGk2UO7mDqHv/view?usp=drivesdk\n\nshows that when editing the mobile number by removing spaces, the second search result in Phone app disappears.\n\nIt seems a combination of WhatsApp + Android stock because\n\n- on my other Samsung and Huawei and Xiaomi phones, the duplication problem does not happen\n- uninstalling WhatsApp, the duplication problem disappear",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 2",
    "post_time": "2019-09-12T08:42:43.886891+00:00",
    "reply": "1 Recommended Answer"
}