{
    "url": "https://support.google.com/pixelphone/thread/10559312/pixel-2xl-emitting-full-volume-constant-white-noise-from-mic-at-random?hl=en",
    "title": "Pixel 2xl emitting full volume, constant white noise from mic at random?",
    "content": "As the title states, I woke up to a full volume, white noise sound (think old tube television \"snow\" static) coming from the microphone (bottom) of my Pixel 2xl at around 3 am. I'm not 100% sure it's the mic, but holding my hand near the base of my phone seemed to intensify the sound, reflecting the awfulness up towards my half-brained, sensitive ears at 3 in the morning. The phone was locked, and didn't indicate that anything or notifications were occurring on the lock screen.  Unlocking the device didn't stop the sound, and the device volume was already at the minimum (do not disturb mode, lowest/min volume). Quick pressing the volume keys, akin to an attempt at silencing an incoming call didn't work either. I finally did manage to get the sound to shut off after fumbling around in my alarm settings. I toggled all of my alarms off, then back on, then off again. The sound ceased once the last alarm was toggled off. At this point, I left all alarms in the OFF position then went back to sleep.  \n\nAt 7 am, the white noise sound returned, and ironically so, since my alarms were off and I have work in the morning.  I repeated the same steps of toggling alarms; on-off, then ending in the off position. \"I'm getting the hang of this right!?...\" The peculiar thing is that the problem worsened, and seemed to return in intervals of about 5 to 10 minutes (behavior was similar to the snooze functionality but without the alarm interface) as I got ready for work. At this point, I powered my phone off then back on, and thus since the noise hasn't recurred.  \n\nI've tried turning on all sounds, having friends call my phone, send texts, etc., and everything seems to be operating normally for now. I have yet to try setting more alarms to reproduce what might be triggering the noise, I'll report back if I find more results. Never the less, it's been unnerving to think that this might happen during a meeting, or when I least expect it.  Kind of like a crank is slowly winding on a jack in the box. \n\nHelp appreciated.\n\n\nPixel 2xl config at the time of the incident:\nDo not disturb mode on\nNo incoming calls\nNotifications muted\nAlarms set for 7:00 and 7:30 am \"on\" toggle position",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2019-07-24T19:34:29.084354+00:00",
    "reply": "1 Recommended Answer"
}