{
    "url": "https://support.google.com/pixelphone/thread/92349344/bluetooth-wifi-and-mobil-hotspot-stops-working?hl=en",
    "title": "Bluetooth, wifi and mobil hotspot stops working.",
    "content": "Randomly my Bluetooth will shutoff. I then have to restart my phone. Sometimes that works. Sometimes it doesn't. I have gone into settings and reset my Bluetooth. Cleared out all of my connected devices. It worked for maybe two days. Then I had to do it again. Everytime I do it, I have to reconnect the cars, harley, job site radio, BT headsets, etc..... Multiple times a week is excessive for a phone I still owe $600. Two days after I got the phone, my back glass broke while inside my otter box. Wasn't happy but the phone still worked. I wasn't worried about it. Over a year later phone I started having these issues, and verizon says it's because of the back glass. I think we all know the back glass has nothing to do with it considering there is multiple forums ranging over a year, talking about the same issues. I'm sure they all have broken rear glasses. In my lifestyle, my phone needs to work 100%. I don't have the option of paying partial values for it, so I'm not willing to accept partial performance on it. Trying to reach tech support via email or phone has been the hardest. Nobody ever picks up the phone. Trying to google, where to contact google, hasnt been easy. I would like answers. I want to know what google is going to do about my phone. This phone is almost worthless. I don't want to do a factory reset because I would lose so much. I do not want to delete everything on my phone to make it work. I have never had to do it before, so I don't want to it now. The Google Pixel 3 XL is a failed phone. Thousands of people are suffering because of it. Google needs to own it. For the price we all paid for this phone, google owes all of us.",
    "is_img": 0,
    "category": "Device Performance",
    "post_time": "2021-01-06T23:48:40.668061+00:00",
    "reply": "0 Replies"
}