{
    "url": "https://support.google.com/pixelphone/thread/110615431/spotify-mobile-streaming-stuttering-in-wifi-and-data?hl=en",
    "title": "Spotify mobile streaming stuttering in WiFi and Data",
    "content": "For the past several months I have noticed an increase in excessive music streaming stuttering no matter if I am connected to WiFi or driving around using data, I noticed it seemed to clear up momentarily if I touched my phone(usually when I am streaming through mobile, my phone isn't being held, it's just set aside). I first assumed it was a Pixel problem and reached out to support(chat) and after me telling them that I had tried reinstalling the app after clearing all the casche and also doing a full factory reset, since I told them it was only happening on Spotify, they told me to contact their customer support. I have been in contact with them and doing extensive I.T. problem solving, they have now deemed it a Pixel problem so I am here again begging for help to fix an unusable app. I mentioned above some things I had troubleshooted, but here's what else I did: logged into a friend's account on mobile to see if it was account based(it wasn't), tested other phones in the household(pixel 4A) for the issue(none), tested our home computers(no issues). With that I deemed it not a Wi-fi issue. I then downloaded a playlist to see if having the files on my phone would help(it didn't), I used a jitter test to experiment with jitter when I held or touched the phone(the number stayed constant) so jittering wasnt an issue. While doing that jitter test I did find something interesting though. I turned my screen timer from 1min to 30min. Whenever I had tried to do a speed test in the past, since it takes me a bit to unlock my phone(and touch it), the issue would always clear up by the time I initiated the test. What I did notice is that I had zero stuttering when my screen stayed on, the minute it timed out, it went right back to stuttering. Definitely not expecting that, so there's something there. I also experimented by turning my phone on airplane mode while I played that downloaded playlist, to see if it was some kind of data leak(still stuttered), I streamed an hour each of Pandora and YT and neither stuttered. This happens when I'm playing it just through my phone speakers or connected to Bluetooth. I tried giving the app all permissions, changing the battery settings(unoptimized and background app refresh). That's about it, this seems to be a phone issue, not an app issue. Is there something else I can do or try to help you guys solve this issue?",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a",
    "post_time": "2021-05-20T23:37:06.983001+00:00",
    "reply": "0 Replies"
}