{
    "url": "https://support.google.com/pixelphone/thread/5566830/very-bad-experience-extremely-disappointed?hl=en",
    "title": "Very Bad Experience, Extremely Disappointed",
    "content": "Hello.\nI am writing this with hope to get some proper service, after spending almost two hours about this frustrating matter today. Unfortunately, I did not find any valid email to send this message to, so I am using this community.\n\nThis morning I ordered a Pixel 3 with Preferred Care through Google Store for my wife, as well as a screen protector and a case cover.\n\nThe very kind lady from \"Enjoy\" came to our house with the Pixel 3 we ordered, and while we were talking, we saw she had a Pixel XL with her (her own), and decided to get an XL instead, as it felt much better than what we've expected (not as big as we thought). She immediately went to bring a brand new Pixel 3 XL as she had one available in her car (together with its accessories), so we made another purchase for that. I also wanted to buy Preferred Care for that Pixel 3 XL, but she said she's not able to sell that, and we should talk to Google Support about it when we're requesting for the refund, as she was unable to cancel the order or return the items by herself at any stage. It was somehow uncomfortable, since I had to spend almost $1k on that, without getting a refund the same day. Anyway we didn't expect any problems to happen; after all, it's Google.\n\nImmediately after she left, I asked for a callback using my wife's account through her new phone, and spent more than 40 minutes (!!!) on the phone with multiple representatives, where the last one I spoke with, told me that she's processing the refund, and I should get the labels by mail. I also requested to transfer the Preferred Care to the Pixel 3 XL (from the Pixel 3 I'm returning), and she said she processed that too.\nAt that point, I was pretty sure that all problems were solved, and even answered on that survey at the end of the call, with the most positive answers, which I totally regret for.\n\nLater on, I got an email with only one print label (I thought it's one label because it's the same order), and another email says \"Welcome to Preferred Care, Your Pixel 3 is covered\".\nI had two questions in mind, (1) do I need to print the same label 3 times? Because putting all items in the same box doesn't make any sense, as the instructions explicitly say not to do so, and (2), why is the Preferred Care still referring to the Pixel 3, if that representative told me that the Preferred Care was transferred to the Pixel 3 XL?\nSo I called again.\nThis time, I spent almost 60 minutes in total on the line (first call was disconnected, and the representative called again). The representative I spoke with (after explaining my issue over and over) understood that I got a print label only for one item (out of 3), and processed the return for the other two remaining items (screen protector and case cover), and assisted me with understanding what's the procedure of returning the item (each item should be in separate box, with its label on it; rather than all items altogether - which is what she said in the first place). Oh, and if it wasn't annoying enough until now, I also need to go and buy a box for each item that I want to return.\nAnother frustrating thing is that when I asked about why I got that email about the Preferred Care for the Pixel 3 instead of Pixel 3 XL (as I've been told that it was transferred), the representative told me that it is not possible to do so, and I was misinformed. Moreover, it's not even possible to buy it separately for the brand new Pixel 3 XL I got from Enjoy (that Google sent to my house)!\nThe very-clever workaround that representative I spoke with has suggested was to buy ANOTHER Pixel 3 XL with Preferred Care, and RETURN the current one, that I have already configured!!! REALLY?? Does that sound even reasonable?!?!?! She was repeating that like a bot, I can't even explain how irritating it was! And of-course, no available supervisor.\n\nSo here is how it goes, again, just for making sure it's all clear:\n1. I order Pixel 3 and Preferred Care from Google Store. Not from Best Buy. Not from Amazon.\n2. Google sends Enjoy to deliver the phone (that was pretty cool, to be honest).\n3. Enjoy representative (that Google sent) sells me a Pixel 3 XL that I wanted over the Pixel 3, but they can't get the Pixel 3 back, and instructs me to talk to Google Support to return it.\n4. Google can't transfer the Preferred Care to the brand new phone I got from Enjoy that they (Google) sent to my house.\n5. Google can't even sell it separately.\n6. I'm stuck with a phone without Preferred Care.\n\nThat's NOT how you do customer support. Service is everything, and you should know that. I am extremely disappointed, that's not what I've expected from Google.\nThis whole experience made me so nervous, and I really feel like I want to return everything back, just because of this poor level of service. As one who's considered as a \"Google fanboy\" for YEARS, I am totally going to take a step back and think twice before buying or recommending people on purchasing Google products again. I even planned to buy another Pixel 3 XL for myself next month, but it obviously won't happen with this kind of service.\n\n\nI will truly appreciate if you will be able to assist here. I really want you to change my mind.\n\nThanks in advance.",
    "is_img": 0,
    "category": "Other, Google Pixel 3",
    "post_time": "2019-05-06T07:54:06.29347+00:00",
    "reply": "1 Recommended Answer"
}