{
    "url": "https://support.google.com/pixelphone/thread/44441939/i-found-google-pixel-3-xl-esim-card-flaw-and-contact-google-support-and-nobody-care?hl=en",
    "title": "I found Google Pixel 3 XL eSIM card flaw and contact google support and nobody care",
    "content": "In conclusion: Pixel 3 xl eSIM card function has a flaw and can't work as physical SIM card.\n\nAbout two months ago, I switched to Sprint. Because pixel 3 xl support eSIM card, I download the eSIM card and active the service. Everything looks good. Until I use WellsFargo app in a ATM, I can't log in this app. I made sure signal is great, other apps including Youtube was working fast excep WellsFargo. First time I was mad with WellsFargo. I though WellsFargo's server was down.\nSoon after, I found App Line also didn't work in cell data connection.\nThen, again, I found if I use wifi, wellsfargo app works great. When I switch data, it never works.\nI call Sprint many times to figure out what problems. Sprint can't find anything.\n\nAfter two months' all kind of try, I know problem should be in the phone itself. Then I noticed I used eSIM card. This is the only different when I switched to Sprint. Then I looked for pixel phone support. Not surprised, like before, they insisted they are everything great. I need to talk to every app company to find the app problems. Google is always disappointed me every time now.\n\nFinally, I asked Sprint to send me a physical SIM card. I just got it and put it on. All problems go away.\n\nI never think Google will become a so terrible company. Google doesn't know how to make hardware and doesn't care any feedback from customer.\n\nMy Pixelbook also has problem they never care to fix . Problem comes from day 1. https://support.google.com/pixelphone/forum/AAAAb4-OgUsqBM373WfXMU/?hl=en&gpf=%23!topic%2Fphone-by-google%2FqBM373WfXMU%3Bcontext-place%3Dforum%2Fphone-by-google",
    "is_img": 1,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3 XL",
    "post_time": "2020-05-04T21:37:29.026598+00:00",
    "reply": "2 Replies"
}