{
    "url": "https://support.google.com/pixelphone/thread/1445832/escalate-pixel-warranty-dispute?hl=en",
    "title": "Escalate Pixel Warranty Dispute",
    "content": "My in-warranty Pixel XL started facing some issues, mainly 3 listed below.\n-device freezes anytime for couple of seconds and reboots automatically\n-battery does not charge till 100%\n-camera automatically defocuses during video\n\nI raised a service request, my device was picked up and few days later it was returned to me as NFF (No Fault Found), with just a software flash.\n\nImmediately after receiving the device, I started facing those issues again. This time I collected evidences (screenshots, photos, videos) of the above issues. I emailed those to india-pixel-escalations@google.com. I received a callback and they registered another service request. I was assured that those photos/videos will be shared with the service engineer for the troubleshooting purpose. A service representative came to pickup my device, I shared the same photos/videos with him too. He too assured me he will make sure it reaches service factory.\n\nI received a call from service factory informing that they are unable to find any faults. I asked them to check the evidences I had shared, and to my surprise, they never received those. So I shared the same, again, directly with service factory. Imagine the level of synchronization among the entire department handling hardware support!! \n\nNow, again after keeping my phone for almost one month, they are saying they are unable to find any faults. They deliberately held my phone till warranty period was over.\n\n-What would I gain from lying? I am without my phone since last one month. \n-How could I possibly generate fake evidences? \n-If they are unable to locate the fault, why can't they replace with another refurbished device? I am not asking for an upgrade, so I have nothing to gain. I am just looking to have a working fault-free device. \n\n\nNow the real question, I am extremely frustrated and I am willing to take it to the Consumer Court. Is there any other higher authority I can reach out at Google before turning this into a legal matter?",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-02-04T03:27:12.111367+00:00",
    "reply": "10 Replies"
}