{
    "url": "https://support.google.com/pixelphone/thread/86163576/new-pixel-5-cannot-pair-with-honda-handfreelink?hl=en",
    "title": "New Pixel 5 cannot pair with Honda HandFreeLink",
    "content": "I just upgraded my Pixel XL 3 to Pixel 5. Yesterday I tried to pair it with my Honda Accord 2018 HandsFreeLink but the connection couldn't get established. Out of 20 times retry 1 is successful. I never had any problem with Pixel 3 XL and I was satisfied with it.\nI tried to clear my car from old connections and also did the same from my phone. Actually I reset all network connections on my phone. I tried to change AVRCP to 1.3 and 1.4 in developers mode but nothing has changed.\nI have LG Velvet and LG G7 both are able to connect to the car. LG Velvet is lagging sometimes and erroring out but eventually can connect. But Pixel 5 cannot.\nsometimes I receive this message on car screen: \"Paring code could not be verified. Pairing has been canceled for this device\". I receive this message while I never received any code on my phone or car screen!\nSometimes I receive this message: \"Connection cannot be established\". Most of the time when I manually connect from the phone nothing just happen. Phones greys out the link and then back to normal.\nBoth car and phone can see each others in their own bluetooth settings but there is problem somewhere in pairing process.\nI tried all the fixes recommended for the problem and also I contacted Google for this problem. I am sure it is a phone problem not the car as all other phones can connect successfully even the brand new LG Velvet with Android 10.\nGoogle sent me the general troubleshooting email which it is not helpful. I need to know if the device is faulty or the Android 11 has some bluetooth problem. I need this to get fixed as I use connection all the time in the car.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 5",
    "post_time": "2020-11-30T19:43:23.418082+00:00",
    "reply": "0 Replies"
}