{
    "url": "https://support.google.com/pixelphone/thread/8225523/set-important-contacts-to-always-ring-your-phone-even-if-device-set-to-vibrate?hl=en",
    "title": "Set Important Contacts to always RING your phone even if device set to vibrate",
    "content": "My girlfriend is literally going to force me to get an iPhone since Pixel 3 doesn't have this feature...\n\nOn iPhone, there is a setting to make it so that when select contacts call you, the phone ALWAYS rings on loud. Even if the device is set to \"vibrate\" \"silent\" \"do not disturb\" or \"low volume.\"\n\nOn Pixel 3, there is only the option to make it so that if your phone is on \"do not disturb\" your Favorite contacts calling will still make the phone ring. Useful for if you're going to sleep maybe, or in a meeting.\n\nHOWEVER, very often I leave my phone on vibrate or low volume. Sometimes though, you miss a call when you don't feel it vibrating, or its laying on a desk where the vibration can't be felt and you're away from table. Or being on a low volume can be too low for you to hear phone if you're somewhere noisy. Even if most of the time (like 80-90% you catch the call, there's 10-20% of time where you miss it because it wasn't ringing on loud when a particular person, ie: girlfriend, called).\n\nThis means that occasionally, I miss calls from my girlfriend, and she gets pissed. I'd imagine a good number of other girlfriends/wives may also face this issue of not having their calls to their men sound a loud alert so guys never miss the call...\n\niPhone has this \"girlfriend/wife mode\" feature, please replicate it on Pixel. Otherwise I can't get Pixel 4 and have to switch to an iPhone...\n\nI already checked app store for an app to do this. There doesn't seem to be anything and I think new Android software blocks these types of app's permissions.",
    "is_img": 0,
    "category": "Contacts, Calls, Voicemail, Google Pixel 3",
    "post_time": "2019-06-18T03:46:09.351999+00:00",
    "reply": "1 Recommended Answer"
}