{
    "url": "https://support.google.com/pixelphone/thread/51257922/pixel-2-xl-android-10-networking-continues-to-malfunction-bluetooth-lte-wifi-all-are-unreliable?hl=en",
    "title": "Pixel 2 XL Android 10 networking continues to malfunction. Bluetooth, LTE, Wifi all are unreliable",
    "content": "Since the Android 10 update, my Pixel 2XL has had continuous problems with ALL its network connections staying reliable, persistent, connected, and actually working.  Symptoms are consistently inconsistent, and its become super annoying.  US based on Verizon.\n\nFirst on basic phone calls, the relationship between 4G/LTE and Wifi calling is pretty broken.  If making a phone call, when there's what appears to be a somewhat weak 4G signal, but a strong Wifi signal, calls will not go through.  The calling process either hangs or times out.  It can take several retries to get connected.  Android's phone subsystem cannot differentiate between bad 4G and good Wifi.  It gets confused.\n\nNext, if indeed a call connects, the handoff from 4G to Wifi causes a 3-10 second blackout, where either side cannot hear each other, causing people to hang up on the far end.  It can take several tries to just get the call connected and both parties speaking.\n\nSimilarly, when trying to use basic broadband data services (ie, downloading a file or podcast as an example), the phone gets confused as well.  If both 4G and Wifi are strong, downloads of say a podcast, may take 10-15 minutes.  If I shut off either 4G OR Wifi, the download happens in seconds.  Again, Android 10 cannot handle 4G/Wifi selection correctly.  It simply gets confused and stalls everything.  \n\nNow, on to Bluetooth, which also misbehaves consistently when either 4G or Wifi state changes.  Bluetooth as an example, will disconnect when the LTE modem throttles between 4G and 3G, or when an cellular signal cuts out completely in a rural area.  The same is true for Bluetooth audio.  Bluetooth audio (like a podcast or music) will simply STOP playing, when the LTE modem is modulating between 4G, 3G or no signal.   When driving in a rural area as an example, and cellular signal is choppy, Bluetooth consistently disconnects, stalls, or simply hangs.\n\nWhile I like the phone in general, it was a much more reliable networked experience under previous Android versions.  I imagine its a set of poorly tested code blocks that control the Snapdragon 835's networking stack, and that handoff routines are clearly broken.   No idea if its drivers or something else, but basically networked reliability is terrible.  \n\nIts clearly an Android code problem.  The Snapdragon 835 uses a combined MAC for all networking layers AFAIK (definitely LTE and Wifi do).",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 2",
    "post_time": "2020-06-04T17:08:56.951883+00:00",
    "reply": "1 Reply"
}