{
    "url": "https://support.google.com/pixelphone/thread/83479186/pathetic-customer-service-from-pixel-help-center-india?hl=en",
    "title": "Pathetic Customer Service from Pixel Help Center India",
    "content": "This is about a Pixel Help Center Case ID [8-5776000030912], I have been very disappointed by the quality of customer service by pixel help center in India. I have raised a complaint about by Google Pixel 3XL device on OCT 22nd, 2020, and paid the inspection charges. My phone pickup doesn’t happen even after payment and multiple calls to Pixel Help Center, sad part is Pixel Help Center asked me to contact FedEx regarding this, FedEx was not ready to share any information with me as I was not the requestor for this pickup. I had to go back to Pixel Help Center get the tracking number from them and then contact FedEx to pick up my package. If you guys cannot coordinate with your pickup and carrier and ask the customers to do it, that’s not good customer service.\nAfter the phone has reached the service center, I received an email with details about what is wrong with the phone and estimated charges for replacing the parts which, It did not contain any information about the warranty on the new parts nor any confirmation on the problem has been fixed on my phone. After calling the Pixel Help Center, I was told that the phone would go through an all-round quality check and all the issues would be taken care of, I was excited that the phone would be repaired but when I received my phone, I was shocked to see that the problem I mentioned was not fixed, instead, they just changed the display and charging port, which was never a problem. Instead looking at what the customer has reported Pixel Help Center has just lamely changed the display and charging port on the phone. I reached out to Pixel help again on November 9th, 2020, and reported that the was not fixed, Pixel Help Center said they would escalate the case and get this resolved ASAP.\nI have reported this on November 9th 2020 and today is November 17th, 2020, there has been no help, I ended up paying money for repairs and still get the faulty phone. I have been calling, chatting with Pixel Help Center every day. These are all the Case IDs for my interactions with Pixel Help Center.\nCase ID [2-0146000031317]\nCase ID [8-5776000030912]\nCase ID [8-2136000031232]\nCase ID [9-4674000031187]\nCase ID:[0-4658000030982]\nI was made false promises that escalation team would get in touch with me. When requested for a call back from manager or supervisor a promise was made but the calls never happen.  Pixel Help Center has poor coordination with its service partner B2X India. Upon continuous calling and chatting, I was told that B2X service center was unable to reproduce the problem and I was asked to send a video of the issue, which I did. If the service center is not able to reproduce the issue why did they change parts on my phone, shouldn’t Pixel Help Center call me to ask more details about the issue, instead of just changing parts on my phone. I feel cheated that Pixel Help Center is interested in collecting money from customers and doesn’t pay attention to customer’s issues. I feel bad for using Google Products and I am very disappointed with the kind of service you guys provide.   I hope writing to you would escalate the issue and get this fixed sooner.\n\nFeedback to Pixel Help Center India.\nKeep only one thread open to interact with customers, multiple threads may be easier for your internal tracking but makes your customer’s life hard.\nAfter you receive a phone for repair and diagnose it, call the customer, explain to him what you see, talk to him about the warranty of new parts, them let them decide what they want to do with their phone.\nFor us customers, the person on phone, or their supervisor or manager or escalation team or your service center B2X is all one entity - Pixel Help Center. If you guys are not able to coordinate among yourself, you are making customer life hard and Google experience painful. Don't ask customers to check with FedEx as you did with me. \n\nI would wait for 48 hours after I send this email and then file a complaint with Consumer Forum India so that no other customer should this. Thank you for your time in reading this. Hope Google cares for its customers.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2020-11-17T15:34:28.733815+00:00",
    "reply": "0 Replies"
}