{
    "url": "https://support.google.com/pixelphone/thread/26023525/my-pixel-2-died-on-fri-jan-10-google-can-t-get-their-tool-to-generate-rma-for-my-replacement?hl=en",
    "title": "My pixel 2 died on Fri Jan 10. Google can't get their tool to generate RMA for my replacement",
    "content": "Last Friday my pixel 2 died. I called google support and they walked me thru the recovery and agreed that it was dead and under warranty and that they would replace it. The rep said that I would receive an email to start the process. an hour later I didn't have the email I called and spent another hour on the phone with their support. To summarize, I have called google every day since last Friday, luckily I still have a land line to call them with. I have spoken with very nice operators who tell me that their tool that generates the RMA to email me a return label is failing when they try to enter my information. They tell me that the case has been escalated and that it is \"assigned\". Somehow after 7 days of an escalated issue with their software tool, they can't fix it nor can they provide an explanation nor can they figure out an alternate way to honor their warranty and get me a replacement phone. Additionally, every night the support person promises to send me an email status (after asking for my mobile number, duh! my phone is dead) and I have yet to receive any information from google. Does anyone know what I can do next? Obviously the path that google provides for getting a phone replaced under warranty is not working, but I can't find any other google contact to solve this problem. I am now in day 8 of no phone with no solution in sight. My previous pixel had died just after the warranty period but since I liked the pixel and my friends had pixel2 I decided to give google another chance. I feel pretty dumb for making that decision. I like my pixel 2 but my experience with google support is awful and I would be a fool to purchase another pixel from a company that doesn't honor the warranty. \nIf anyone knows a different way for me to contact google to reach someone who can think outside of the box and get my replacement in the mail whole the company works on their software tool for generating RMA labels, PLEASE PROVIDE IT. I don't know what else to do and I am not ready to just buy a new phone and not hold google to their warranty.",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel 2",
    "post_time": "2020-01-18T15:44:48.642045+00:00",
    "reply": "1 Recommended Answer"
}