{
    "url": "https://support.google.com/pixelphone/thread/16903228/weird-connection-problems-pixel-3axl?hl=en",
    "title": "Weird connection problems Pixel 3aXL",
    "content": "I am having very difficult to diagnose connection problems with pixel 3aXL running Android 10. Basically, the connection seems to stop working very regularly even if my toolbar icons show me connected at full strength to an LTE network or a known, working WiFi network. Doesn't seem to matter if one of those two connection types is on or off on the phone, nor does it matter how strong the signal is reported by the phone.\n\nIt can happen in many apps but what usually happens is when I try to get some sort of data to the phone, without warning, whatever app it is just spends a long time trying to get the data it needs. In other words, YouTube videos will never start or move forward when this happens.\nWhen I open the MLB app, I can't even get the news page (which is basically a list of headlines). Or, maybe I have that app open and I read a couple of articles then tap to go listen to a game. Suddenly, the list of available audio feeds just doesn't load.\nIf I look at the Google News feed to the left of my main home screen, it's a crap shoot whether or not any article I tap on will actually load. Note: I am clicking on articles from major sites, not the clickbait, algorithm whores. The same can happen if I use the search bar Maybe results come up, maybe they don't and the process bar just stops at maybe  25% loaded.\n\nYou get the idea, but the worst example I can think of was from this weekend when I couldn't find my phone anywhere. I did the Where's My Phone stuff in Google from my laptop and although I got multiple rings before going to voicemail when I called from another phone (indicating it was turned on and ringing somewhere), Google could not connect to the phone to geolocate it for several tries. It also took a few tries to get actually get it to ring it constantly for five minutes. \n\nCurrently, I can't open Messages.Android.com/web on my laptop because it wants me to connect my phone to a network. But it is on a network, both wifi and LTE. I am sitting here at my kitchen table in the middle of Seattle. I have a strong signal.\n\nAny suggestions are welcome. Thanks!",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3a XL",
    "post_time": "2019-10-15T23:42:07.610122+00:00",
    "reply": "0 Replies"
}