{
    "url": "https://support.google.com/pixelphone/thread/101214563/original-google-pixel-xl-screen-and-led-are-not-working?hl=en",
    "title": "Original Google Pixel XL screen and LED are not working",
    "content": "So it all started with my battery not holding a charge for about 6 hours or less. I decided I was going to buy a new phone since the process for replacing the battery seemed way to risky to try on my own at the time. About a year later I decided to pick up the phone again and try to transfer some of the remaining things that I had left on the phone that I forgot to move over. So of course the battery was dead so I plugged it in and the Google symbol came up like normal but then it instantly went away so I tried powering it on again but no luck, not even the Google symbol would come on the screen. I tried looking up all the things you could try to get the phone to turn on but it was a lost cause so I decided that now was a great time to try to replace the battery since I really didn't have anything to lose at this point. I bought the battery replacement kit and honestly the process went fairly well once I first got the pry tool underneath the edge of the screen. I followed the instructions on Ifixit.com and got everything all back together (loosely) and tried turning it on with and without being plugged into the wall and still nothing... Now I don't know if this will help figure out my problem at all but when I hook my phone up to my PC it makes the connection sound on Windows but an error window pops up and says \"The last USB device you connected to this computer malfunctioned, and Windows does not recognize it.\" The charging port is so clean you could eat off of it and the cable is fine as well so not sure why that would be happening. The only thing I haven't tried was actually permanently putting the screen back on with glue and I don't know if there are any connections that it would affect but I feel like having the screen plugged in and in the right spot but not being glued in place that it should still work in my opinion. I just didn't want to glue it all together if it wasn't working. In conclusion, I do want to transfer data over to my PC with my phone but I honestly would really like to use my pixel fully functioning and I really don't want to spend all that money on a new screen and find out the screen wasn't even the problem.\n\n1. If the screen is dead then can I not do anything (transfer data over to my computer or do a factory reset on my phone, ect.) with the phone until I replace the screen?\n2. The Led does turn on even when it's \"charging\" so can the Led be linked to the screen possibly being dead?\n3. If the screen isn't working could that be why that error was popping up on my PC when I plugged my phone into it?\n4. Is there any sure fire way I can tell if it's the screen that's dead or something else?",
    "is_img": 0,
    "category": "Other, Google Pixel",
    "post_time": "2021-03-07T23:03:40.32264+00:00",
    "reply": "0 Replies"
}