{
    "url": "https://support.google.com/pixelphone/thread/25318537/i-found-a-google-pixel-phone-how-do-i-erase-the-hard-drive-and-set-it-to-factory-settings?hl=en",
    "title": "I found a google pixel phone. How do I erase the hard drive and set it to factory settings?",
    "content": "I just found a google pixel phone. And I’m trying to move my information over from my iPhone 7 to this new phone. I watched one You TUBE DIY In hopes I could find a quick way to restart the hard drive in the phone and erase everything so that I can just start using it as if it were brand new. \nIn order to use this phone I knew that I had to figure out how to set it back to default warehouse settings In order to use it. So I actually have about five different Google/email accounts, and I signed in flawlessly with each one of them.  So this new phone that I’m just trying to get set up and maybe switch over some information from my other phone is acting strange going back-and-forth.instead of bringing me to the main page to get started using the phone, it’s keeping me stuck In the preliminary pages of Limbo... questioning and getting set up.  just to clarify what I’m kind of scene is that as I’m setting up this New phone that it happened to luckily fine on the sidewalk in perfect condition, I did the right thing by completely deleting everything the whole hard drive starting from scratch etc. but as I try to set up my Google accounts in this Google phone  even after putting my Sim card in this phone it will give me a little hope by asking me my Google email password. And anytime I do it is excepted, as though I’m all set and the next step would be the phone opening up to me. But in a nutshell, even after me personal questions about my Google account and passwords etc. which I give to them correctly every time, I suddenly feel at a loss because I’ve just done everything asked and filled out all my information but the last question they ask before they will even allow me to see the main screen the main menu is the fact that they either asking me for the previous owners Google information and password. This is quite ridiculous because as you know I found the phone so how would I know that and why are they asking me my information and saying “congratulations we can’t wait for you to see what we have to offer” etc.\nAsking me for the previoususers emails and google info did not make sense to me which is why am stuck in this situation. I can’t even use this phone because apparently I’m supposed to know the previous owners Google information or something? Yes, this was a long question but thank you very much for reading it if you did. I would really appreciate an answer if you guys have any ideas in any way shape or form. I’m almost positive that there’s a certain way to completely erase everything and start from scratch and that’s what I was trying to do and that’s what I thought I did when I watched that video on YouTube and it did seem to work but I thought there was more to it than that anywaythank you. If you’d like to respond my email is\nReidcu1984@gmail.com\nCell 424-200-2313",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 2",
    "post_time": "2020-01-11T07:59:39.891885+00:00",
    "reply": "1 Recommended Answer"
}