{
    "url": "https://support.google.com/pixelphone/thread/82055164/how-to-escalate-my-case-for-pixel-4-xl-device-issue?hl=en",
    "title": "How to escalate my case for Pixel 4 XL device issue",
    "content": "Hi, I have a Pixel 4 XL that recently started giving me issues with face recognition (I realised that there have been may other similar community posts about this issue due to an issue with the last system update). After reaching out to support team and following all their steps (including the final step of doing a factory reset) the problem still remained and the team finally conveyed the phone can be replaced.\nNow I have been given an RMA and I have ordered the replacement phone but I realised I have been charged $1267  (as a hold amount) - which is the price of a brand new Pixel 4 XL - while I would be getting a refurbished phone as a replacement.\n\nI tried several time to call up the support team to explain that I should not be charged the full price of the phone (it should either be a reduced price or I should be given a brand new phone as a replacement) - even though the price is technically a block which would be released. However, in a situation where if a customer is not able to return the phone (due to any reason) then Google would be charging the price of a brand new phone for a refurbished device which is not correct.\n\nMy multiple attempts to call the support team have just resulted in me being on hold for nearly an hour with someone eventually 'promising' that someone will get back and email the response - but till date no one has bothered to reply.\n\nIs there anyway to escalate a grievance related to a Google Pixel? I am not sure why Google has made it so hard for customers to not find ways to escalate complaints/grievances (the only options that we can find is writing these issues on community forums or restarting the process of reaching out to support team again.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 4 XL",
    "post_time": "2020-11-10T12:03:47.997442+00:00",
    "reply": "2 Replies"
}