{
    "url": "https://support.google.com/pixelphone/thread/38861300/my-backup-exists-in-drive-for-4xl-but-after-factory-reset-phone-does-not-see-the-backup-to-restore?hl=en",
    "title": "My backup exists in Drive for 4XL, but after factory reset phone does not see the backup to restore",
    "content": "Hello. On April 7 I did a factory reset of my 4XL. Phone has never been in any betas. I checked the Settings->Advanced->Backups before the reset and it showed that my phone backed up device settings, sms, call logs, and the app settings. \n\nWhen I try to restore, the only backup the 4XL sees is an old Chromebook I have. It does not see the 4XL that I backed up. That said, I have backed up and restored this phone successfully in January.\n\nI had the exact same problem with my 2XL back last fall. That 2XL had been on a beta (I did unenroll the device), but I figured that restore might have been still affected by the beta. I am concerned now as my 4XL which was set up as a fresh new device when I purchased it, is now having the same issue. I am paying for Google One additional support and space.\n\nI contacted Google 1:1 support 2 days ago and all they would do is tell me that if my device was backed up I could restore. At the time the tech told me that I could no longer see Pixel backups in Drive because that functionality was removed. I learned since that this is not true, and I can clearly see the backup in my Google Drive that the 4XL could not see. \n\nI asked for this to be escalated and I am waiting still. I also asked for my case to be escalated last fall and I got no response at that time either.\n\nIs there anything else I can check for these backups? I was smart this time and backed up my texts via 3rd party, but I still had to manually reinstall the 120 apps I have, as well as set up device settings. The Google support tech also suggested that I use a 3rd party backup solution.\n\nAlso, what do folks do when Google support does not get back to you? I have not had much luck getting accurate information or promised followups. Thanks!",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 4 XL",
    "post_time": "2020-04-09T05:03:20.591342+00:00",
    "reply": "6 Replies"
}