{
    "url": "https://support.google.com/pixelphone/thread/15051999/why-is-google-still-allowing-the-android-10-update-to-run?hl=en",
    "title": "Why is Google still allowing the Android 10 update to run?",
    "content": "After reading the news and on the forums it seems like this update was launched around Sept 3rd 2019. Just a few days after there were many issues with the new Android 10 update and people were scrambling to find issues for this. Any issues relating to camera functions, receiving/making calls and mainly the lag and freezing of many apps in general. \n\nGoogle has not yet found a solution to all this but what bothers me the most is that I got the notification to update to Android 10 about 3 days ago. Yes 3 days ago which makes it on the 19th. Why is Google still releasing a broken software/firmware to ALL their users when the issue is not fixed. My phone was working normally a few days ago and now I can barely use my phone. I don't think I need to begin and summarize just how inconvenient this has made all users that had to be affected by this mess. It seems that the \"My Verizon\" app was a main issue which stopped a lot of phones to work properly but I don't even have that app because I do not use Verizon. I just got off the phone with a google representative and they have informed me that their engineers are working on the issue but there is no ACTUAL date to know when this will be fixed. Considering this whole mess has already been in the works for almost 2 weeks now, I hope they find a fix soon. For the record:\n\n-I have troubleshooted by going to safe mode and the same issues are there\n-I updated all my apps to best of my now \"broken\" phone ability, it just crashes now and I have other updates still pending for 2 days\n\n\nNow I'm forced to go out and buy another phone because otherwise I cannot work properly. I run a business and I'm on the phone everyday speaking with clients from different countries.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel",
    "post_time": "2019-09-22T22:41:56.831383+00:00",
    "reply": "5 Replies"
}