{
    "url": "https://support.google.com/pixelphone/thread/70448122/pixel-4xl-dead-after-having-50-battery-issue-for-about-a-day?hl=en",
    "title": "Pixel 4xl dead after having 50% battery issue for about a day",
    "content": "Hi, today, after I unplugged my Pixel 4xl from the battery charger it has completely died.\n\nIt started yesterday with I finding my phone turning of randomly and then having 50% battery showing. I scouted internet and found that a lot of people had issue with this, some suggesting pressing on the right back, 1 inch from below, quarter inch from the right would solve this. I tried, but I did not dare to press hard so that did not solve the issue.\n\nThis continued during the day and last night I plugged it in my Pixel charger asked my partner to make sure I woke up as I had no idea my phone would fire off the alarm. The alarm however worked find this morning when it was in the carger, It also fired up the morning routines giving me weather, calendar and news feed, in all a standard morning. I went up and disconnected my phone from the charger and put it on my desk and performed some other morning routines, getting back about 20 minutes later to my phone its dead, stone dead, ready for 6 feet under joke.\n\nI have tried pressing the start button for longest period ever, tried switching to my old pixel 1 charger, switching to a non brand cable, connecting to computer waiting for 15 minutes as some has suggested, long press start button and waiting for 2 minutes and then try to call the phone as some other has suggested as it could be a screen issue. But its dead, so dead, no other phone is more dead than this, as I see it :)\n\nI need help! Much help, as I have no other phone available at the moment and I have switched to e-sim.\n\nAny suggestion on how to bring my Pixel 4xl back to life is more appreciated then a drizzle of maple syrup on a Sunday pancake!\n\nBjörn",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2020-09-11T08:18:56.676507+00:00",
    "reply": "4 Replies"
}