{
    "url": "https://support.google.com/pixelphone/thread/62649725/introducing-the-pixel-4a?hl=en",
    "title": "Introducing the Pixel 4a",
    "content": "Hi everyone,\n We're excited to announce the newest additions to #teampixel: meet the Pixel 4a.\n    To learn more about the ideas and innovation that went into our newest Pixel check out our blog, and find the tech specs here.\n  The device is available in select countries on the Google Store.\n  Pixel 4a FAQs\n  Where can I order the device?\nPixel 4a is now available for pre-order in the US on the Google Store and on Google Fi. It will be available to customers on August 20 through the Google Store, Best Buy, Amazon, and more, as well as US Carriers including Google Fi, US Cellular and Verizon.\n  For availability in other countries, please visit the Google Store for more details: https://goo.gle/32YLz7B \n  How much does it cost?\nAll details on pricing in selected markets can be found at the Google Store\n  Pixel 4a battery\nPixel 4a has a 3140 mAh typical battery(2) capacity which is the biggest battery of any standard (non-XL) Pixel. It also provides an all day Adaptive Battery experience(1) which lowers power to processes running in the background and apps you’re unlikely to use.\n  Pixel 4a camera\nPixel 4a has a single, high quality 12MP rear camera with an updated f/1.7 lens that lets in more light than 3a.  We focused on a single high quality camera given zoom/ultra-wide account for a small % of photos taken, and the strong performance of software enabled portrait mode.\n  Is Pixel 4a a 5G device? Why not?\nNo, Pixel 4a is a 4G device that includes many premium features at a competitive price point. Pixel 5G phones are coming later this year. \n  (1) Approximate battery life based on a mix of talk, data, standby, and use of other features, with always on display off. An active display and other usage factors will decrease battery life. Pixel 4a battery testing conducted in Mountain View, California in early 2020 on pre-production hardware and software. Actual results may vary.\n(2) Estimate of typical capacity based upon testing and expected cell behavior",
    "is_img": 1,
    "category": "Other, Google Pixel 4a",
    "post_time": "2020-08-03T15:18:49.223879+00:00",
    "reply": "0 Replies"
}