{
    "url": "https://support.google.com/pixelphone/thread/11535670/usb-connector-not-working-as-expected-on-pixel-2-xl?hl=en",
    "title": "USB connector not working as expected on Pixel 2 XL?",
    "content": "When I connect the phone to any PC, tried with different type of cables, it's just telling me it's charging. Nothing really happened on the both sides. I can not transfer files, can not make an USB debugging sessions. So I thought this maybe a hardware-related problem. Okay, first I need to be sure it isn't software related, but it is.\nI tried to reboot device to boot loader (or fastboot mode) using the \"Key Combination\".\nThen I connect the phone to PC. Here, fastboot recognize my phone... ? \nOkay, after that I tried to boot the device while keeping the USB connection by selecting Start in the menu. \nNow the devices is up, it's asking me for USB debugging authorization, on the lock screen, the phone is telling me that it is \"Charging slowly\" (not the plain \"Charging\" like before).\nThe USB port is working, perfectly. The phone showed up in everywhere it should (Device Manage, adb, etc..)\nBut, if I ever remove the connection, everything will be gone.\nUnplug and reconnect, the phone will not be recognized anymore. Only charging.\nCome back to boot loader, reconnect device 1-2 times, PC recognized it again in fast boot mode.\nSo this should be a software problem.\nI can't flashing images to downgrade to other version and check if problem is existed in Oreo or not, too bad.\n\nHow can I deal with this ?\nIs there any kind of information that I could provide to you guys to fix this problems ?\nP/s: \nMy PC is on Windows 10. \nPhone is on Pie and updated with the latest August Security Patch.\nIf I need to connect properly to my PC again, I must revoke USB authorization, uninstall all Pixel device on Windows' Device Manager before trying to boot manually from boot loader again",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth",
    "post_time": "2019-08-08T06:31:02.563041+00:00",
    "reply": "0 Replies"
}