{
    "url": "https://support.google.com/pixelphone/thread/12125147/pixel-3-xl-battery-swollen-how-long-to-approve-rma?hl=en",
    "title": "Pixel 3 XL: Battery Swollen -- How Long to Approve RMA?",
    "content": "Right now, I'm in the process of trying to get my 10 month old Pixel 3 XL replaced (because the battery is swelling up) with their \"Advanced Exchange\" process.  Three days ago (13 August 2019), they requested (and I sent) some information for that exchange.  They were supposed to send me an email \"with a link to order your replacement device and it will ship to you within 3-5 business days.\"  Again, that was almost three full days ago.  I've not received that email.  I've sent two follow up emails (24 and 48 hours after giving them the necessary information), but have received no response.  I'm assuming someone, somewhere is supposed to be approving the actual RMA and sending me that order link.  How long should that take?  Their last email said 3-5 business days SHIPPING.  But, it's been 3 business days already and I haven't even gotten to the order phase.\n\nBackground information:\nEarly 13 August 2019:  I took my Pixel 3 XL (in its Google Pixel fabric case) off my Pixel Stand (where it always charges) and noticed the back was deforming and the case was being pushed away from the side.  I assume the battery is swelling.\n13 August 2019, 0742 hours:  Not sure whether to use my two year Preferred Care or just talk to the Google Store where I bought it, I decide to Chat with the Store.  I talk to Mack who sends me an email asking for photos of the front and back of the phone.  I do so (along with pictures of the side where the case is being forced apart by the swollen battery).  He sends my case off to Tier 2 Support.\n13 August 2019, 0959 hours:  Hallie (Tier 2 Support) emails me and asks me what's happening.  I reply.\n13 August 2019, 1213 hours:  Hallie replies (starting the email with \"I understand how alarming this can get as your safety is really important to us and it is not the experience we want for you\"), asks if I want to go with Advanced or Standard Exchange, and asks for my contact information.\n13 August 2019, 1219 hours:  I reply by saying to go with the Advanced Exchange and give her the required information.\nCrickets.\n14 August 2019, 1201 hours:  I send another email, repeating the information and ask if everything's OK.\nCrickets.\n15 August 2019, 1312 hours:  I send another email asking how long it should take to get that email with the ordering link.\nCrickets.\nAnd, here I am now hoping someone can clarify how long this should take.",
    "is_img": 0,
    "category": "Other, Google Pixel 3 XL",
    "post_time": "2019-08-16T12:58:44.543091+00:00",
    "reply": "1 Recommended Answer"
}