{
    "url": "https://support.google.com/pixelphone/thread/7778088/how-to-recover-data-if-unable-to-connect-phone-to-computer-or-see-them-in-the-phone-memory-issue?hl=en",
    "title": "How to recover data if unable to connect phone to computer or see them in the phone? Memory issue",
    "content": "Dear Google (or any kind fellow human-being),\nI had some issues with the built-in photo app (the pinwheel logo), namely it kept crashing while browsing photos. Therefore I tried to reinstall it through the play store. Then something super weird happened: all my photos and data seemed to have gone. They are still on my phone, somewhere, but my (Google?) applications can't detect them, so all the photos I've taken (camera as screenshots) just don't show up, I can't play music in the stock music player, nor take any new screenshots/photos.\n\nWhen I try to take a photo (with the stock camera app) or screenshot (by holding the power and volume key) it just says the memory is full, but it's clearly lying, since I can go in through the file browser and see there's space left. Also, all my personal ring tones, sounds, etc, have been replaced by some super weird stock ones (I presume; maybe even hard-coded midi files, by the sound of it...). The weird thing is that all other apps seem to work normally and I can, for example, take and receive photos with other apps.\n\nSince all the data is clearly all there, I wanted to connect to retrieve it, but I can't do that either. I went to the store to get professional help, but they said they couldn't connect to the device, although their computer did sense \"something\" was connected, but they didn't want to install new drivers and instead directed me to you.\n\nSo here I am: can you please help me connect my phone to a computer and then fix the problem with my stock apps? I was told by the store where I bought the phone it has been reported to happen because all the Google apps are connected with one another.\n\nI really to get help with this asap, because it's really embarrassing. I'm a staunch supporter of Google over for example Huawei, because I trust Google more, so I really hope someone can help me with this.\n\nThank you very much in advance!\n\n\nBest regards,\nFredrik",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel",
    "post_time": "2019-06-10T18:06:20.329774+00:00",
    "reply": "2 Replies"
}