{
    "url": "https://support.google.com/pixelphone/thread/93264014/2m-old-google-pixel-4a-5g-sound-as-weak-speaker-on-top-bottom-crackles-speech-to-text-sounds-bad?hl=en",
    "title": "2m old Google Pixel 4A 5G sound as weak. Speaker On top & bottom crackles. Speech to text sounds bad",
    "content": "The top speaker and bottom speaker are lackluster when playing a video or music. It's frankly crap. I would have returned it to Best buy but Christmas affected it so now I'm stuck with it. Now, the top speaker crackles whenever I'm playing music which makes it even worse. Then when I'm doing speech to text and I hit the microphone it lets out the worst crackling sound. It's embarrassing when I have a brand new phone that I paid $500 for. My previous Google pixel 3 XL was great except the bottom speaker started crackling to the point where it was going to have to be replaced and I just needed to get an upgrade in phone. These were rated high but I miss my front facing speakers, camera quality and it didn't freeze up like this one does and even pressing the power button and the up volume button does not reset it you just have to wait. I hate this phone. I know it's under warranty there's got to be a one-year warranty and I won't my money back I want my Google pixel 3 XL repurchase to use because it was great. I've had the Google pixel 2 XL Google pixel 3 XL and now the 4A 5G and the 3XL was great. I bought it used for $50 and it lasted me 2 years. This $500 phone that's unlocked because I have visible cell phone service is junk. Where do I go? I can't go to Best buy because I'm past my two weeks to return it or it would have already been gone. I still have my box I still have everything that was in my box and I hate this phone and I want it gone. Where do I go from here? I'm disabled and that's a lot of money for crap phone function. I should have just bought the used phone and been done. I'm embarrassed to use it around my friends.",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 4a (5G)",
    "post_time": "2021-01-13T08:11:20.599703+00:00",
    "reply": "0 Replies"
}