{
    "url": "https://support.google.com/pixelphone/thread/21855867/motion-sense-a-new-way-for-your-pixel-to-understand-you?hl=en",
    "title": "Motion Sense - A new way for your Pixel to understand you",
    "content": "Hi everyone,\n\nI want to share a little more about Motion Sense™, the Soli radar technology powering several of our helpful new features this year. \n\nMotion Sense creates a new way to interact with your device, accelerating your control of the phone, helping you stay in the moment, and letting you interact when touch isn't convenient.  It automatically turns on your display when you approach and keeps it off when no one is around. It triggers face unlock when you reach for it. It lets you skip songs with a swipe and snooze alarms with a wave. You can silence incoming calls instantly. You can even wave hello to your favorite Pokemon!\n\nOur Quick Gesture features in particular are about accelerating your control of your phone:\nTouchless multitasking\nControl your music with a swipe no matter what else you’re doing: driving, eating, while your display is off, or even when you’re in another app.\nStay in the moment\nAvoid getting distracted by your morning notifications when you go to snooze your alarm on your phone. Just wave to snooze alarms and dismiss timers. \nStop interruptions\nWhen your phone starts ringing at a bad time, you can silence it instantly with a wave. \n\n\nYou can turn on Motion Sense features in Setup and in Settings under System > Motion Sense. You can separately toggle each of the Motion Sense features. \n\nMotion Sense is based on Google’s Soli radar technology. In principle, this is similar to the radar technology used to track large objects like planes. We’ve created a miniature version in a chip located at the top of your Pixel 4. When Motion Sense is turned on, it emits a radio frequency signal from this chip. The signal goes out into the world and gets reflected back by the things around your phone. These continuous reflections are sensed by the antennas in the chip and processed on-device to sense your motions. If the right motion is detected, it will trigger the corresponding Motion Sense feature. This motion processing happens only on your phone, and radar sensor data is never saved or shared with other Google services. \n\n\nTo minimize false triggers, Motion Sense ignores motions when it’s in your pocket or bag, or when your phone is moving around a lot. Still, it’s important to keep in mind that this is new technology. In some instances, your phone may detect gestures when you don't intend it to, like when there are motions over your phone that look very similar to swipes. We are very interested to hear about these instances so that we can learn from them to make our algorithms better in the future. \n\nAnother aspect of Motion Sense being a new technology is that it is not available in all countries due to differences in radio frequency regulations. We hope to make it available in more places soon. If you travel from a country where Motion Sense is available to one where it is not, you will receive a notification letting you know that Motion Sense is temporarily disabled. Motion Sense is also disabled while in airplane mode and in battery saver mode. \n\nMotion Sense is one of our most helpful and exciting innovations in Pixel 4. I look forward to hearing your feedback on this thread, both about the features you find most helpful and the features you find yourself not using as much, so that we can make Motion Sense better in the future. We plan to release more features over time.\n\nBrandon \nProduct Manager",
    "is_img": 1,
    "category": "Other",
    "post_time": "2019-12-03T20:06:08.898091+00:00",
    "reply": "24 Replies"
}