{
    "url": "https://support.google.com/pixelphone/thread/43119005/horrendous-customer-service-experiences-how-do-i-escalate-google-complaints?hl=en",
    "title": "Horrendous customer service experiences: how do I escalate Google complaints?",
    "content": "I have had two horrendous experiences with Google customer service. I have never experienced such poor customer service toward loyal customers before. At a time when companies are showing their true colors, Google shows that they do not care about their customers. The responses I've gotten from them are basically \"tough luck!\" Completely dismissive and issues created by Google's poor policies are then flipped back on the customer. \n\nMost recent Google customer service experience: I switched my entire family over from iPhones to Google smartphones last year, and during one of the purchase periods (in late August), there was a promo to receive $50 Google store credit for future purchase. There was never any indication in the promo terms or emails/confirmations surrounding the order that there would be an expiration on the $50 promo credit. When I went to make a purchase this week and use that credit, I saw that it had disappeared from my account. I contacted Google to inquire and they said that the credit expired in December, and that Google had (allegedly) sent an email about this in October. Why, when I placed an order in late August, would you send an email in regards to that order in October and assume that the customer would receive it? I receive Google marketing emails multiple times per week, and so it never would have occurred to me that an *important* email would be sent two months after I made a purchase. There was also no notification sent in December before it was expiring. I have no proof of this in my inbox or spam folder, and Google said they cannot re-send a copy, and cannot provide any proof to me of its existence -- yet, that is what I am supposed to go on (so, a customer's voice means nothing). \"Tough luck\" on the credit, and completely dismissive reply emails. There is \"nothing they can do.\" Well, yes, they can do something. They just chose not to. Google could easily extend credit to a loyal customer who has spent thousands on Google phones, Google Home products, and Google Drive upgraded accounts. But they chose to be a company that disrespects their customers and shows no gratitude for loyalty of their brand. That is why this community message board is full of stories and experiences like mine. \n\nI had another similar customer service experience with Google last year in which they stiffed me $90+ on a phone trade-in and, again, \"tough luck\" on my part (even though it was 100% Google's fault in miscommunicating trade-in dates -- they actually sent out two different dates, which I have proof of in my email confirmation and trade-in materials -- yet, this somehow became the customer's fault, which is Google's default stance).\n\nSo, the moral of the story is that Google does not care about their loyal customers and has horrendous customer service practices. Do not waste your time getting in touch with any issue, because you will be made to feel like you are a nuisance. \n\n*If anyone has information on how I can escalate customer service issues beyond their incredibly unhelpful customer service team, please post here.* I am so frustrated and disheartened, and will certainly be switching over from the Google products I have, which is a shame -- because we were such a Google household.",
    "is_img": 0,
    "category": "Other",
    "post_time": "2020-04-28T23:07:03.153992+00:00",
    "reply": "2 Replies"
}