{
    "url": "https://support.google.com/pixelphone/thread/74774095/touch-issues-target-size-or-sensitivity-no-screen-protector?hl=en",
    "title": "Touch Issues - Target Size or Sensitivity? NO SCREEN PROTECTOR",
    "content": "Pinch to zoom issues:\n\nI suddenly began experiencing issues with touch on my Pixel 4a which I bought brand new about a month ago directly from Google. When I bought the phone, before upgrading to Android 11, I did notice some issues when I pinched to zoom on an image. It seemed as if when I touched the small thumbnail of the image in my gallery and it opened I had to wait 1 second or 2 after it opened full screen for me to be able to zoom in and out by pinching and even then it stuttered. \n\nThis happened to when I double tapped on the image to zoom to that specific spot, it didn't always zoom when I tapped, I had to do it several times for it to actually zoom in. This small issue suddenly stopped happening as often so I didn't really notice it as much and attributed it to a one time thing. \n\nRight now when watching a video on YouTube and I use 2 fingers to expand it to full screen it does absolutely nothing. \n\nAlso happening again now is the pinch to zoom feature is also completely gone. I can't zoom in on any pictures. \n\nDouble tap to zoom takes so many taps before it actually zooms in and then it doesn't always zoom in to the spot I was tapping and double tapping to zoom back out is also near impossible.\n\nTyping touch issues:\n\nBut yesterday, weeks after I downloaded Android 11, I began to have issues with touch on certain parts of the screen. I noticed when I was typing a message. Certain letters on the keyboard would not register my touch unless I tapped harder or pressed harder on the letter or that particular area of the screen. This is why I don't know if it's an issue with the screen sensitivity not sensing my touch or an issue with the target area of my touch.\n\nFor example when tapping on the letter \"y\" or u\" it wouldn't write the letter unless I tapped harder. I could tap 10 times on  \"y\" or u\" and it wouldn't write the letter. However if I tapped 10 times on \"t\" or \"i\" which are on opposite sides of \"y\" and \"u\" then I would get the keyboard to write 10 \"t's\" and \"i's\" with no issue using normal tapping. The same thing happens with the letter \"h\", when I tap on it several times in a row with normal tapping it doesn't write it. The letters \"g\" and \"j\" however work fine. \n\nThe letter \"n\" registers if tapped with normal force but not on each tap, for example if I tapped on it 5 times it only wrote it 3 times. The letter \"m\" next to it works fine. However \"b\" doesn't work. When I tap on \"b\" it registers my touch on \"v\" sometimes and even when I tap harder on \"b\" it doesn't register.\n\nAll the other letters work fine most of the time but when I am typing words rather than just tapping on letters I get these random swipe gestures even though I'm not using swipe to type, I'm just typing regularly. It's really annoquing and inconvenient to say the least I wrote this on my laptop because writing it on my phone would have been a nightmare. \n\nOther touch issues:\n\nOther issues I experienced are when swiping up from the bottom of the screen to show my open apps it doesn't always work. Instead the phone seems to think I'm trying to open the app drawer and displays the animation that shows how to swipe to open the app drawer. I am making sure I am swiping from the very bottom of the screen but still. I have to do it slowly for it to work.\n\nWhen swiping form the edge to bring up the Google Assistant also takes several attempts. \n\nThese are just some of the major touch issues I have been having but I have had others where the touch is just off.\n\nPLEASE HELP!",
    "is_img": 0,
    "category": "Other, Google Pixel 4a",
    "post_time": "2020-10-03T21:01:26.17107+00:00",
    "reply": "6 Replies"
}