{
    "url": "https://support.google.com/pixelphone/thread/60167632/set-up-new-device-something-went-wrong-unable-to-automate-setting-up-of-new-phone?hl=en",
    "title": "Set up New device - something went wrong - unable to automate setting up of new phone.",
    "content": "\"device disconnected\"  -- The set up nearby devices - seems to start off fine... the phones see each other, I get confirmation screens to continue and within seconds of starting the setup it fails... every time.  Tried 3 times with each phone I own; 4 separate phones... 12 failed attempts.\n\nI've got numerous old android phones running android 5,8 and 9... each of these phones have over 40 google email accounts pre loaded with 200+ apps (most are custom - not in the app store)  For me to manually type in all 40 email accounts - confirm and password will take way too long... and I plan to buy a couple new phones to try out over the next few weeks and need to get this automation working...  Once the accounts are all loaded I'm sure I'll have to type in passwords at least... but thats not awful; then they can all download the affiliated app store apps.. and I'll still have 50 more custom apps to install and configure...   I need as much automation as I can get.\n\nI really wish the Android OS would improve the backup/restore functionality to more of an enterprise level deployment system; including all types of accounts, apps, settings and data (including custom offline APK's that have local data folders)\n\nAnyone with suggestions I would appreciate it; including those who may have experience using third party programs in Android or PC - I've had mixed opinions of PC software like MobiKin Assistant - or root apps like clockworkmod Helium and Titanium Backup... I'd prefer to stick with stock google stuff but I'll use what I have to...\n\nI've always had trouble getting this feature to work.. if I have ONE google account on a stock phone with no apps it seems to work fine.. add 2 accounts or 5.. or 40+ google email accounts and it seems to just never work.",
    "is_img": 0,
    "category": "Setting up and Personalizing your Device, Google Pixel 4 XL",
    "post_time": "2020-07-21T05:25:01.475623+00:00",
    "reply": "3 Replies"
}