{
    "url": "https://support.google.com/pixelphone/thread/111863194/roaming-data-exhausted-phone-won-t-send-texts?hl=en",
    "title": "Roaming data exhausted phone won't send texts",
    "content": "I visit family and friends in a part of the US where my phone service coverage allows roaming data but that amount expires in about 24 to 48 hours. Because I visit them in a very wooded part of the country, my service only works when I'm in town around stores and businesses. The minute I'm driving between these little towns I have no coverage at all so letting people know I'm on my way or have been in an accident is a total crapshoot and is contingent on whether or not I happen to be close to a cell tower.\n\nWhat's worse is when I'm at the place I'm staying, my ability to send and receive messages is also a crapshoot, especially with group texts. Now I've been having this issue for years and every time I'm up here I'll visit the community boards to try to figure out how can I fix this basic communication issue. Believe me I've read so many replies from the last 5 years of related topics and must have tried them all with little success. And usually I just give up and just use the land line.\n\nThis time around though I've found a workaround that seems to be a clumsily perfect solution and what I want to ask the community, is if any one else has had this issue, what they've done, and is this something that will be different with the Pixel 6 phone. And if you have had this issue, I'm offering my solution.\n\nAt home base I have my phone set to recognize the wifi here to nake and receive calls. It works for calls but not for texts or pictures. I've tried clearing up storage, clearing cache, switching between mobile data, tuning off the phone, nothing worked. Some times I'll send a text and never get a response. Other times I'll be sent a text that may take a while to get to me. What seems to happen is that the messages are sent to cell towers and because my roaming data is exhausted, that protocol prevents those texts from ever landing. One time I received a text that had been bouncing around the cell phone towers for close to 2 years. And I got that message when I was 350 miles away from where it was sent.\n\nMy workaround is this. When I'm at a house -or business that has WiFi, turn off mobile data altogether and turn on airplane mode. Connect to the local WiFi and use that exclusively. When I have to leave that comfort zone I turn off airplane mode and return to open WiFi and turn mobile data back on to get calls and directional data. So in other words if I can restrict all of my data to go through a local WiFi source exclusively, everything work fine. I just have to go into Lisa Douglas mode ala Green Acres to get it to work.",
    "is_img": 0,
    "category": "Connectivity, Network, Bluetooth, Google Pixel 3",
    "post_time": "2021-05-31T15:40:55.765528+00:00",
    "reply": "0 Replies"
}