{
    "url": "https://support.google.com/pixelphone/thread/74169023/introducing-the-pixel-4a-5g-and-pixel-5?hl=en",
    "title": "Introducing the Pixel 4a (5G) and Pixel 5",
    "content": "Hi everyone,\n\nWe're excited to announce the newest additions to #teampixel: meet the Pixel 4a (5G) and Pixel 5 packing more helpful Google features into phones backed by the power and speeds of 5G*(1).\n\n\n\nTo learn more about the ideas and innovation that went into our newest Pixel check out our blog, and find the tech specs here.\n\nPixel 4a (5G) will be available in Japan on Oct. 15 and eight other countries starting in November, and Pixel 5 will be available starting Oct. 15 in the U.S. and eight other countries.\n\nLooking for the Pixel’s that’s right for you? Head to the Google Store now.\n\nPixel 4a (5G) and Pixel 5 FAQs\n\nHow much does it cost?\nAll details on pricing in selected markets can be found at the Google Store\n\nWhat colors is the Pixel 4a (5G) available in?\nPixel 4a (5G) will be available in Just Black on the Google Store. Verizon will also sell the Pixel 4a (5G) in Clearly White.\n\nWhat colors is the Pixel 5 available in?\nPixel 5 will be available in Just Black and Sorta Sage.\n\nWhich carriers will support 5G on Pixel phones?\nWe are continuously working to improve our 5G support. Check out the Pixel help center (g.co/pixel/networkinfo) for all the carriers that are certified to support 5G on Pixel phones*(1).\n\nWill DSDS work on 5G?\nWhen you have two SIMs enabled the device will only connect to 4G networks, if you want to connect to a 5G network, simply turn off one of the SIMs using the toggle in the SIM Settings menu. Learn how to use dual SIMs on your Google Pixel phone here: https://goo.gle/HowToUseDSDS\n\n*(1) Requires a 5G data plan (sold separately). 5G service and roaming not available on all carrier networks or in all areas. Contact carrier for details about current 5G network performance, compatibility, and availability. Phone connects to 5G networks but, 5G service, speed and performance depend on many factors including, but not limited to, carrier network capabilities, device configuration and capabilities, network traffic, location, signal strength and signal obstruction. Actual results may vary. Some features not available in all areas. Data rates may apply. See g.co/pixel/networkinfo for info",
    "is_img": 1,
    "category": "Other, Google Pixel 5",
    "post_time": "2020-09-30T18:43:37.474092+00:00",
    "reply": "0 Replies"
}