{
    "url": "https://support.google.com/pixelphone/thread/104609310/is-there-any-way-to-backup-a-pixel-that-will-not-charge-turn-on?hl=en",
    "title": "Is there any way to backup a Pixel that will not charge/turn on?",
    "content": "So over the past couple months, I've been having issues with my Pixel 4 XL's battery that have only been getting more frequent and more substantial. Specifically, sometimes the phone would say it is having a \"problem reading the battery meter.\" This would result in the phone displaying an inaccurate battery percentage or simply refusing to charge (displaying a \"?\" on the battery icon when turned off and plugged in). Sometimes I would be able to temporarily fix the issue by using a tip I read online where you apply slight pressure to the battery area. While that worked the first few times, it quickly became less reliable. Fast forward to today, my phone said it was at 87% but must have not been reading from the battery correctly, because the phone suddenly shut off from low power. Now, whatever I do, I cannot get the phone to charge again. Hard rebooting doesn't do anything, the pressure trick has run its course, I have tried everything I have found suggested online and nothing has gotten the phone to accept charge again. The phone recognizes it is charging (when plugged in it will display the charging battery icon for a split second as opposed to the red \"low battery\" icon when unplugged) but due to the issues with reading the battery meter the phone simply will not allow the battery to be charged. I discovered online that this is a very common hardware flaw with the 4 XL involving the battery FPC connector and that it will have to be repaired/replaced by a professional.\n So, at this point, I've come to terms that I will have to send in my phone for repair. My 1-year warranty unfortunately ended in December, but I'm willing to pay the repair cost considering how much I have enjoyed my time with the 4 XL and would rather not shell out the money for a new phone. However, my dilemma is that I do not have a backup of my phone. I was prepared to do so after the issues becoming more frequent these past few days, but the phone shutting off at \"87%\" blindsided me and I missed my opportunity. Since from what I've read, repairing the phone involves a complete wipe and reset, I am curious if there exists any way to back up my phone in the current state it is in. There is some data on my phone apart from the cloud services that I would be really upset to lose and if I could obtain a backup of it I would be much more comfortable with having it repaired. So if there is either a way to retrieve backup data from the phone while it is dead, a way to repair it without wiping the data, or a secret way of getting it to charge just one last time so I can get a backup before sending it in, that would ease a lot of my worries. Thank you.\n\nEdit: I did just discover the \"one year extended warranty program\" regarding these battery issues, which I believe I fall under and would be exempt from repair costs, which is fantastic to hear. So I still just need to know if there is any way to preserve my data before taking it to the local uBreakiFix.",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 4 XL",
    "post_time": "2021-04-01T03:06:27.607658+00:00",
    "reply": "1 Reply"
}