{
    "url": "https://support.google.com/pixelphone/thread/32077388/new-pixel-features-just-dropped?hl=en",
    "title": "New Pixel features just dropped",
    "content": "The new features that Pixel just dropped include updates that focus on customizing your Pixel’s look and feel, making it easy to pay with your phone, getting help from Pixel when you need it, and having more fun with your camera. The March feature drop will begin rolling out to Pixel devices starting on March 2nd. It will roll out in stages over the next two weeks. We encourage you to check your Android version and update to the latest version to receive the latest features. Once updated, look out for a notification from the Tips app to learn more. \n\nCards & Passes\nPress and hold the power button to swipe through your credit cards and tickets, or access anything else in your wallet, like emergency contacts and medical information. \n\nThis will roll out to Pixel 2, 3, 3a, 4 in the US, Canada, UK, Australia, Germany, France, Singapore, Taiwan, Spain, Italy, and Ireland. Learn more here.\n\nScreenshot a boarding pass to add it to Google Pay\nGetting on a flight is also easier than ever with Google Pay on your Pixel. Take a screenshot of a boarding pass to automatically generate a smart chip that lets you save to Google Pay. The pass can then be accessed via the power button and a helpful notification will pop up before your flight. \n\nThis will begin rolling out to Pixel 3, 3a, and 4 in these countries on March 12. Learn more here.\n\nTap to pause with Motion Sense\nYou can already use Motion Sense to skip forward or go back to a previous song. Now you can also pause and resume music with a tapping gesture above the phone. So you can easily pause music when you're having a conversation, without even picking up your phone. [1] \n\nThis will begin rolling out to Pixel 4 in the US, Canada, UK, Germany, France, Spain, Italy, Japan, Ireland, Australia, Singapore, and Taiwan. Learn more here. \n\nDark theme scheduling\nDark theme gets even more helpful. Pixel devices will get more flexibility in switching from light to dark background, with the ability to schedule Dark theme based on local sunrise and sunset times. \n\nTo enable scheduling, go to Settings > Display > Dark theme > Schedule. Dark theme scheduling will roll out to Pixel 2, 3, 3a, 4 globally. Learn more here.\n\nRules on Pixel\nPixel gives you the ability to automatically enable certain rules based on WiFi network or physical location. Customize your ringtone to go silent when you connect to your office WiFi, or go on Do Not Disturb when you walk in the front door of your house to focus on the people and things that matter most. \n\nTo configure, go to Settings > System > Rules. Rules will roll out to Pixel 2, 3, 3a, 4 globally. Learn more here.\n\nEmojis 12.1 Update\nEmojis on Pixel will now be a more customizable and inclusive thanks to the emoji 12.1 update, with 169 new emojis to represent a wider variation of gender, race and skin tones and more combinations to better reflect reality. \n\nTo use, open an app where you can write, like Gmail or Keep. Tap where you can text. Tap Emoji ☺. Emojis 12.1 will roll out to Pixel 2, 3, 3a, 4 globally. Learn more here.\n\nDuo AR Effects\nGet creative with AR effects you can use live on your video call with friends. They change based on your facial expressions. Together, they give your Duo calls a whole new layer of fun. \n\nTo use Duo effects during a call, tap> Effects to choose an effect. Duo AR effects will roll out to Pixel 3 and 4 globally. \n\nBetter Selfies on Pixel 4\nYour front-facing camera can now create images with depth, which improves Portrait Blur and color pop, and lets you create 3D photos on Facebook. \n\nTo turn on, open Camera and tap the Down arrow > Settings > Advanced > Social Media Depth Features. Once on, photos you take in the default mode can be edited by following these steps:\nPortrait blur: open the photo in Google Photos and tapping Edit photo > Edit photo> then move the Blur slider\nColor pop: open the photo in Google Photos and tapping Edit > Color Pop\nTo create a 3D photo on facebook: open Facebook > What’s on your mind? > 3D Photos > Select your image. \n\nThis will roll out to Pixel 4 globally.\n Car crash detection in Australia and the United Kingdom\nOn Pixel 4, the Safety app uses phones’ sensors to quickly detect if you’ve been in a severe car crash, and checks with you to see if you need emergency services [2]. For those who need emergency services, you can request help via a voice command or with a single tap. If you’re unresponsive, your Pixel will share relevant details, like location info with emergency responders.\n\nTo turn on car crash detection, visit the Personal Safety app. Car crash detection is available now on Pixel 4 in the United States. Car crash detection will roll out to Pixel 4 in Australia and the UK. Only available in English. Learn more here.\n\nLive Caption for Pixel 2\nLive Caption automatically captions media playing on your phone. You can use it on videos, podcasts, and audio messages – even stuff you record yourself [3]. \n\nTo turn on Live Caption, press either volume button and tap the Live Caption icon . Live Caption is available now on Pixel 3, 3a, and 4. Live Caption will begin rolling out globally to Pixel 2 on March 12. Learn more here.\n\nImprovements to long press\nIn addition to long press, you can now firmly press to get more help from your apps more quickly. \n\nLong press improvements will roll out to Pixel 4 globally. \n\nImprovements to Adaptive Brightness\nAdaptive Brightness will now temporarily increase screen brightness to make reading content on your screen easier when in extremely bright ambient lighting, like direct sunlight. \n\nAdaptive brightness improvements will roll out to Pixel 4 globally. Learn more here.\n\nSummary of Availability per Device\n\n\n-------------------------------------------------------------\n\n[1].Not all phone features are controlled by Motion Sense. \n[2] Car crash detection may not detect all accidents. High-impact activities may trigger calls to emergency services. This feature is dependent upon network connectivity and other factors and may not be reliable for emergency communications or available in all areas. \n[3] English only.  Accuracy of Live Caption is dependent upon the quality and clarity of the audio source.  Not applicable to music, phone calls or VOIP and not available on all media apps.",
    "is_img": 1,
    "category": "Other, Google Pixel 4",
    "post_time": "2020-03-02T17:54:45.084942+00:00",
    "reply": "0 Replies"
}