{
    "url": "https://support.google.com/pixelphone/thread/23208044/pixel-4-xl-crashing?hl=en",
    "title": "Pixel 4 XL Crashing",
    "content": "I used the phone for 5-6 days and suddenly it just went black, when trying to wake it up on the lock screen the notification bar just went crazy  going up and down but the display didn't show any image nor could I get past here. When contacting Google support (from Google One to Google Store to Google Help Center) and following the troubleshooting steps they recommended finally I was asked to request a repair.  I must note that this issue originally started like 3 day after purchase, that time I restarted in safe mode, updated to the December features drop and rebooted, suddenly everything seemed to be corrected. 2 or 3 days later it happened again, I flashed the phone several times as it would allow to pass the configuration screen from time to time, something weird happened one time: when you are asked to press the edged to test the assistant I tried doing it with no answer, as if some sensor or the assistant software were failing\n\nI followed other recommendations I found over the internet for Pixel issues as trying to install other keyboards, disable face recognition and any pin/pattern for security, preventing the phone updating any app or the software itself, with SIM, without SIM, fully charged, connected to a PC, connected to the (of course original) charger, turning off ambient EQ and the 90hz refresh rate, without success so finally I gave up and requested the repair (7-10 days as no close by repair site was available), I want to emphasize that nothing has happened with the device: no drops, no water nor humidity, nothing more than regular use.\n\nHas anyone went through something like this (either the failure or the repair process)?\n\nAndroid 10\nBuild Number QQ1B.191205.012.A1\n\nAny advise will be appreciated",
    "is_img": 1,
    "category": "Device Performance, Google Pixel 4 XL",
    "post_time": "2019-12-18T17:39:00.694114+00:00",
    "reply": "4 Replies"
}