{
    "url": "https://support.google.com/pixelphone/thread/3885323/pixel-2-black-screen-and-device-unresponsive?hl=en",
    "title": "Pixel 2 black screen and device unresponsive",
    "content": "Hey,\n\nSo I'm not a full time phone repairman, but I've been known to fix a few issues with my wife's phones in the past. Most of the time, I'm successful, but this one has me stumped.\n\nMy wife was walking around with the phone in her pocket, then she went to pull it out and then noticed the screen was all black. Initially confused, she thought maybe it had turned off somehow. She checked the battery about an hour prior and it wasn't even to the half-way point yet, so no reason to think the battery could drain that fast. She tried turning it on, but then I noticed something as she tried this. After precisely 12 seconds after she would touch the power button once, the screen would flash some garbled contents(red and yellow streaks) for about 20 milliseconds(I work on video games, so I guess I have a trained eye for these sorts of things). This told me two things. First of all, the device wasn't \"dead\", it was just in some sort of garbled state which leads me to the second thing; what we were seeing on screen was a bad memory copy which suggests to me that the graphics card/driver is messed up. After fiddling with it some more, and watching people online shut down their pixel 2 device, I decided I would try to shut down the device.\n\nI tapped the power button once, then long pressed it for 5 seconds, then tapped the screen where the power-off should be. Success! The phone vibrated, and I thought that might be the end of it, but when I tried to turn it back on, the same thing happened. There was no google screen, or any screen for that matter, and it was just all black. I tried it again, this time I tried to use the lower volume+power key combo to no avail. I tried all sorts of permutations of it as well. I \"shut down\" the device using the method I spoke about above, then tried powering it back on using the lower button method to hopefully get me in to safe mode. I tried shutting it down using the lower volume+power button combo and that didn't appear to do anything. I'm all out of ideas.\n\nI'd like to get back in to the phone to get any pictures from today(thankfully, the pictures from yesterday were all backed up) but I can't without the screen. Does anyone have any ideas or something I could try to get the phone working again?",
    "is_img": 0,
    "category": "Battery and Power, Google Pixel 2",
    "post_time": "2019-04-09T23:08:35.976377+00:00",
    "reply": "1 Reply"
}