{
    "url": "https://support.google.com/pixelphone/thread/25990212/service-repair-issue-pixel-3a?hl=en",
    "title": "Service / Repair Issue - Pixel 3A",
    "content": "Dear Sir/Ma'am,\n                                    Sub : Online Ticket No- GL0094385\n                                    Ref  : Device Pickup Date : 3rd January 2020\n                                    Phone Model : Google Pxel 3A\n                                    Date of Purchase : 22nd May 2019 ( Under Warranty)\n                                    IMEI No : 92GAYO125K\n I have given my phone for repair due to the display not working properly to the Google pixel team on 3rd January 2020. The phone was inspected by the service man at our home and was taken to the service center. We received a mail from the team that it will have to be taken for further checks, post which we received a mail with a quotation. The mail said that the repair will not be covered under warranty, though the phone has been purchased in May 2019(which is less than a year). The detailed reasons have not been given. The quotation for repair for Google Pixel 3A 64GB Just black has been given as 51,472.62 INR. The cost of the phone is 33,999 INR. Again they have contacted us and mentioned that they will do Repair  for Approx Rs.17,000/- The difference between First Repair Expenses and Second Contact Repair Expenses are Approx Rs. 34,000/- IT'S NOTHING BUT CHEATING & EXPLOITATION OF CUSTOMERS.\nSuch atrocious costs for repair for a phone that has been bought less than a year ago is a direct display of lack of consumer concern. It displays the fact that you do not want to care for a consumer after the product has been bought, and are set to find ways to make sure the customer buys a new product altogether. I am writing this mail to you with a heavy heart, as I was once a happy user of your product. It saddens me to see such a bad service from the creators of the same.\n\nSINCE IT IS UNDER WARRANTY IF YOU DO NOT RESOLVE THE ISSUE AND WE ARE GOING TO TAKE LEGAL ACTION\n\nRAVI KUMAR / PRAGNYA PAPPALA",
    "is_img": 0,
    "category": "Device Performance, Google Pixel 3a",
    "post_time": "2020-01-18T06:50:00.881+00:00",
    "reply": "0 Replies"
}