{
    "url": "https://support.google.com/pixelphone/thread/33721449/pixel-2-xl-camera-fails-to-open-or-load?hl=en",
    "title": "Pixel 2 XL Camera Fails to open or Load",
    "content": "OK so I've seen lots of posts about the Pixel 2 Camera failing after a recent update. \n\nI was one of the people affected by this issue. my camera on my Pixel 2 XL didn't suddenly stop working, it started to fail to load a few times and then it started to fail to load a lot of the time. Finally, after a few weeks, it got to the point where the camera failed to load at all.\n\n I contacted support and did all the normal tricks like try a different app, clear cache, uninstall updates, wipe phone none of these things worked. \n\nThe only workaround I found was to wave a small neodymium magnet near the camera while opening the app. This would allow the camera to open.  Once the app was open you need to move the magnet away from the phone or the focus would go all wobbly. \n\nAfter a few more weeks of this, I found it really annoying to have to remember to carry a magnet around in my pocket. I logged a new call with google and they instructed me to RMA the device. about a week and a bit later I received a refurbished phone from google (which was actually pretty nice since the phone was out of warranty by about a month.) \n\nNow this phone was way behind in patches. So as a test I would update and then test the camera and update again and test the camera (all previous apps were loaded) \n\nQP1A.191005.007a1 OK Tested 6 times\nQP1A.191105.004 OK Tested 6 times\nQQ1A.191205.008 OK Tested 6 times\nQQ2A.200305.002 OK Tested 6 times\n\nI actually don't think this is a software update issue. I believe the actuator arm of the camera wears out after about 2 years of heavy use.  I use my camera daily since it's the one I have on me. \n\nI did previously post the logcats where it said the actuator arm failed but the post has since been deleted by someone else. \n\nSo for anyone else out there with a similar pixel 2 camera issue. have you logged it with google?",
    "is_img": 0,
    "category": "Camera, Google Pixel 2",
    "post_time": "2020-03-15T23:22:23.598224+00:00",
    "reply": "1 Reply"
}