{
    "url": "https://support.google.com/pixelphone/thread/70284902/alarm-routine-misbehaves-after-android-11-update?hl=en",
    "title": "Alarm routine misbehaves after Android 11 update.",
    "content": "I am one of the people who ran into all sorts of trouble after the recent update to Android 11. The biggest issue is with the touchscreen that is oversensitive now and results in a million of fathom presses per minute. That aside, I just noticed another quirky thing today. \nIn the morning, when the alarm goes off, it automatically triggers a routine of providing details on the day's tasks, weather, and alike, and then it starts playing news. All worked fine until the update. Today, the routine started as usual, but when it came to news, the management window for it (pause, fast forward, etc) just didn't appear in the notification area at all! There it was, Google Assistant's voice reading news with no possibility whatsoever to control it. I have around 30 news sources going that way, which results in literally hours of news, and usually I just stop 15-25 minutes into it from the above-mentioned management panel in the notification area. As the window seems missing now, I just had to restart the phone to shut up those news. Anyone else with the same issue?\n\nP.S. General afterthought on the update. I found myself to be a die-hard fan of clean Android and Google recently, and I've been recommending all my friends to switch to Android. Now this update came, and it has so many bugs that frankly left me shocked. It feels like a throwback into nightmares of 2010s, when Android on third-manufacturer devices was so buggy it was barely usable.  Clean Android is awesome for everyday use, but I only now realized it's the first major update I received since my romance with Google's devices. And no, it's no better than those old days when an update would introduce more bugs than good features. Really, Google? You disappointed me so much that I started to think about switching to iPhone instead - and that comes from a person who is never ever said one good word about Apple in her entire life. Heck, I was given a free iPhone X twice in the last 6 months, and both times I ended up giving it up after 2 weeks and buying Pixels (3a and now 4a) instead. \nYeah, I know Google is going to fix these bugs soon, but just the general attitude of pushing an update that is half-baked and making customers struggle for several days is what makes me think about my choice of phones for the future. With Apple, I won't enjoy the simplicity and customization Android has to offer, but I won't struggle after each update either. If the entire selling point of Pixels is just how simpler they make our lives, then sorry, it ain't it.",
    "is_img": 0,
    "category": "Google Assistant and Voice Actions, Google Pixel 4a",
    "post_time": "2020-09-10T14:37:57.711202+00:00",
    "reply": "0 Replies"
}